; ModuleID = 'dns_tc.c'
source_filename = "dns_tc.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.qtypes = type { i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.dns_record_limits_malicious = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.exfil_security_config_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_dns_limites = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egrees_redirect_ring_buff_non_standard_port = type { ptr, ptr }
%struct.exfil_security_egress_reconnisance_map_scan = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_protocols_identifier_maps = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redurect_ts_verify = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_loop_time = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_count_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_drop_count_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_vxlan_dns_transport = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_rate_limit_map = type { ptr, ptr, ptr, ptr }
%struct.kernel_handler_map = type { ptr, ptr, ptr, ptr, ptr }
%struct.exfil_raw_packet_mirror = type { i16, i16, i8, i8 }
%struct.dns_volume_stats = type { i64, i32 }
%struct.checkSum_redirect_struct_value = type { i16, i64 }


!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "qtypes", scope: !2, file: !44, line: 69, type: !362, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 19.1.1 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !55, globals: !162, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "dns_tc.c", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "85dad51bea7ab5899bbe32a0a97a8551")
!4 = !{!5, !39, !43, !49}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 29, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "9c2bb8c4aeb4064bd816bf98027ba7c1")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!9 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!10 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!11 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!12 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!13 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!14 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!15 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!16 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!17 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!18 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!19 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!20 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!21 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!22 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!23 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!24 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!25 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!26 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!27 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!28 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!29 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!30 = !DIEnumerator(name: "IPPROTO_L2TP", value: 115)
!31 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!32 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!33 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!34 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!35 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!36 = !DIEnumerator(name: "IPPROTO_SMC", value: 256)
!37 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!38 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 6050, baseType: !7, size: 32, elements: !41)
!40 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "eec04c95b9f59f758a8270a58c2ff5f6")
!41 = !{!42}
!42 = !DIEnumerator(name: "BPF_F_INGRESS", value: 1)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MALICIOUS_FLAGS", file: !44, line: 17, baseType: !7, size: 32, elements: !45)
!44 = !DIFile(filename: "./dns.h", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "5cfdbc692acc202e55e1b638d5f1dad9")
!45 = !{!46, !47, !48}
!46 = !DIEnumerator(name: "BENIGN", value: 0)
!47 = !DIEnumerator(name: "SUSPICIOUS", value: 1)
!48 = !DIEnumerator(name: "MALICIOUS", value: 2)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 1349, baseType: !7, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIEnumerator(name: "BPF_ANY", value: 0)
!52 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!53 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!54 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!55 = !{!56, !59, !60, !71, !72, !73, !103, !113, !114, !115, !116, !121, !131, !78, !139, !141}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !57, line: 24, baseType: !58)
!57 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!58 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_header", file: !44, line: 86, size: 96, elements: !62)
!62 = !{!63, !64, !65, !68, !69, !70}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "transaction_id", scope: !61, file: !44, line: 87, baseType: !56, size: 16)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !61, file: !44, line: 88, baseType: !56, size: 16, offset: 16)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "qd_count", scope: !61, file: !44, line: 90, baseType: !66, size: 16, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !67, line: 32, baseType: !56)
!67 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "bf9fbc0e8f60927fef9d8917535375a6")
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ans_count", scope: !61, file: !44, line: 91, baseType: !66, size: 16, offset: 48)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "auth_count", scope: !61, file: !44, line: 92, baseType: !66, size: 16, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "add_count", scope: !61, file: !44, line: 93, baseType: !66, size: 16, offset: 80)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !57, line: 27, baseType: !7)
!72 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !75, line: 87, size: 160, elements: !76)
!75 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "149778ace30a1ff208adc8783fd04b29")
!76 = !{!77, !80, !81, !82, !83, !84, !85, !86, !87, !89}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !74, file: !75, line: 89, baseType: !78, size: 4, flags: DIFlagBitField, extraData: i64 0)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !57, line: 21, baseType: !79)
!79 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !74, file: !75, line: 90, baseType: !78, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !74, file: !75, line: 97, baseType: !78, size: 8, offset: 8)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !74, file: !75, line: 98, baseType: !66, size: 16, offset: 16)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !75, line: 99, baseType: !66, size: 16, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !74, file: !75, line: 100, baseType: !66, size: 16, offset: 48)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !74, file: !75, line: 101, baseType: !78, size: 8, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !74, file: !75, line: 102, baseType: !78, size: 8, offset: 72)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !74, file: !75, line: 103, baseType: !88, size: 16, offset: 80)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !67, line: 38, baseType: !56)
!89 = !DIDerivedType(tag: DW_TAG_member, scope: !74, file: !75, line: 104, baseType: !90, size: 64, offset: 96)
!90 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !74, file: !75, line: 104, size: 64, elements: !91)
!91 = !{!92, !98}
!92 = !DIDerivedType(tag: DW_TAG_member, scope: !90, file: !75, line: 104, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !75, line: 104, size: 64, elements: !94)
!94 = !{!95, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !93, file: !75, line: 104, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !67, line: 34, baseType: !71)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !93, file: !75, line: 104, baseType: !96, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !90, file: !75, line: 104, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !75, line: 104, size: 64, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !99, file: !75, line: 104, baseType: !96, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !99, file: !75, line: 104, baseType: !96, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_header_tcp", file: !44, line: 96, size: 112, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !104, file: !44, line: 97, baseType: !56, size: 16)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "transaction_id", scope: !104, file: !44, line: 98, baseType: !56, size: 16, offset: 16)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !104, file: !44, line: 99, baseType: !56, size: 16, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "qd_count", scope: !104, file: !44, line: 100, baseType: !66, size: 16, offset: 48)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ans_count", scope: !104, file: !44, line: 101, baseType: !66, size: 16, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "auth_count", scope: !104, file: !44, line: 102, baseType: !66, size: 16, offset: 80)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "add_count", scope: !104, file: !44, line: 103, baseType: !66, size: 16, offset: 96)
!113 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vxlanhdr", file: !3, line: 62, size: 64, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "vx_flags", scope: !117, file: !3, line: 63, baseType: !96, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "vx_vni", scope: !117, file: !3, line: 64, baseType: !96, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !123, line: 173, size: 112, elements: !124)
!123 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "163f54fb1af2e21fea410f14eb18fa76")
!124 = !{!125, !129, !130}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !122, file: !123, line: 174, baseType: !126, size: 48)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 48, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 6)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !122, file: !123, line: 175, baseType: !126, size: 48, offset: 48)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !122, file: !123, line: 176, baseType: !66, size: 16, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !133, line: 23, size: 64, elements: !134)
!133 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "40b541977cf3a9ce2b2728b52f4091a4")
!134 = !{!135, !136, !137, !138}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !132, file: !133, line: 24, baseType: !66, size: 16)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !132, file: !133, line: 25, baseType: !66, size: 16, offset: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !132, file: !133, line: 26, baseType: !66, size: 16, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !132, file: !133, line: 27, baseType: !88, size: 16, offset: 48)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !57, line: 31, baseType: !140)
!140 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !143, line: 25, size: 160, elements: !144)
!143 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "1aa35012f509549bad9f3decb5d3e7a2")
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !142, file: !143, line: 26, baseType: !66, size: 16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !142, file: !143, line: 27, baseType: !66, size: 16, offset: 16)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !142, file: !143, line: 28, baseType: !96, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !142, file: !143, line: 29, baseType: !96, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !142, file: !143, line: 31, baseType: !56, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !142, file: !143, line: 32, baseType: !56, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !142, file: !143, line: 33, baseType: !56, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !142, file: !143, line: 34, baseType: !56, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !142, file: !143, line: 35, baseType: !56, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !142, file: !143, line: 36, baseType: !56, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !142, file: !143, line: 37, baseType: !56, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !142, file: !143, line: 38, baseType: !56, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !142, file: !143, line: 39, baseType: !56, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !142, file: !143, line: 40, baseType: !56, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !142, file: !143, line: 55, baseType: !66, size: 16, offset: 112)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !142, file: !143, line: 56, baseType: !88, size: 16, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !142, file: !143, line: 57, baseType: !66, size: 16, offset: 144)
!162 = !{!0, !163, !170, !182, !185, !205, !207, !209, !554, !562, !570, !575, !581, !586, !596, !602, !608, !614, !619, !624, !626, !628, !630, !632, !634, !636, !641, !643, !658, !668, !682, !705, !713, !725, !738, !746, !754, !762, !770, !783, !792, !807, !842, !848, !854, !860, !866, !872, !899, !904, !908, !913, !915, !918, !920, !922, !927, !929, !934, !936, !938, !941, !943, !945, !950, !952, !957, !962, !967, !969, !971, !974, !982, !996, !998, !1004}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "valid_opcodes", scope: !2, file: !44, line: 107, type: !165, isLocal: false, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 64, elements: !168)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!168 = !{!169}
!169 = !DISubrange(count: 2)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "DNS_RECORD_LIMITS", scope: !2, file: !44, line: 225, type: !172, isLocal: false, isDefinition: true)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_record_limits_malicious", file: !44, line: 209, size: 256, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_DOMAIN_LENGTH", scope: !172, file: !44, line: 210, baseType: !71, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_DOMAIN_LENGTH", scope: !172, file: !44, line: 211, baseType: !71, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_SUBDOMAIN_LENGTH_PER_LABEL", scope: !172, file: !44, line: 214, baseType: !71, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_SUBDOMAIN_LENGTH_PER_LABEL", scope: !172, file: !44, line: 215, baseType: !71, size: 32, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_LABEL_COUNT", scope: !172, file: !44, line: 218, baseType: !71, size: 32, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_LABEL_COUNT", scope: !172, file: !44, line: 219, baseType: !71, size: 32, offset: 160)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_SUBDOMAIN_LENGTH_EXCLUDING_TLD", scope: !172, file: !44, line: 222, baseType: !71, size: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_SUBDOMAIN_LENGTH_EXCLUDING_TLD", scope: !172, file: !44, line: 223, baseType: !71, size: 32, offset: 224)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "redirect_skb_mark", scope: !2, file: !184, line: 66, type: !71, isLocal: false, isDefinition: true)
!184 = !DIFile(filename: "./consts.h", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "74d6ac54a4381b6c10a29848f8a0b183")
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "bridge_redirect_addr_ipv6_suspicious", scope: !2, file: !184, line: 78, type: !187, isLocal: false, isDefinition: true)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !188, line: 33, size: 128, elements: !189)
!188 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "fca1889f0274df066e49cf4d8db8011e")
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !187, file: !188, line: 40, baseType: !191, size: 128)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !187, file: !188, line: 34, size: 128, elements: !192)
!192 = !{!193, !197, !201}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !191, file: !188, line: 35, baseType: !194, size: 128)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 128, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !191, file: !188, line: 37, baseType: !198, size: 128)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !191, file: !188, line: 38, baseType: !202, size: 128)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 4)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "bridge_redirect_addr_ipv6_malicious", scope: !2, file: !184, line: 92, type: !187, isLocal: false, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "INSECURE", scope: !2, file: !3, line: 103, type: !71, isLocal: false, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "____fmt", scope: !211, file: !3, line: 1389, type: !549, isLocal: true, isDefinition: true)
!211 = distinct !DISubprogram(name: "classify", scope: !3, file: !3, line: 1304, type: !212, scopeLine: 1304, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !307)
!212 = !DISubroutineType(types: !213)
!213 = !{!167, !214}
!214 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !215, size: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !40, line: 6229, size: 1536, elements: !216)
!216 = !{!217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !233, !234, !235, !236, !237, !238, !239, !240, !241, !243, !244, !245, !246, !247, !279, !280, !281, !282, !304, !305, !306}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !215, file: !40, line: 6230, baseType: !71, size: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !215, file: !40, line: 6231, baseType: !71, size: 32, offset: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !215, file: !40, line: 6232, baseType: !71, size: 32, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !215, file: !40, line: 6233, baseType: !71, size: 32, offset: 96)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !215, file: !40, line: 6234, baseType: !71, size: 32, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !215, file: !40, line: 6235, baseType: !71, size: 32, offset: 160)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !215, file: !40, line: 6236, baseType: !71, size: 32, offset: 192)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !215, file: !40, line: 6237, baseType: !71, size: 32, offset: 224)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !215, file: !40, line: 6238, baseType: !71, size: 32, offset: 256)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !215, file: !40, line: 6239, baseType: !71, size: 32, offset: 288)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !215, file: !40, line: 6240, baseType: !71, size: 32, offset: 320)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !215, file: !40, line: 6241, baseType: !71, size: 32, offset: 352)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !215, file: !40, line: 6242, baseType: !230, size: 160, offset: 384)
!230 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 160, elements: !231)
!231 = !{!232}
!232 = !DISubrange(count: 5)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !215, file: !40, line: 6243, baseType: !71, size: 32, offset: 544)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !215, file: !40, line: 6244, baseType: !71, size: 32, offset: 576)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !215, file: !40, line: 6245, baseType: !71, size: 32, offset: 608)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !215, file: !40, line: 6246, baseType: !71, size: 32, offset: 640)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !215, file: !40, line: 6247, baseType: !71, size: 32, offset: 672)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !215, file: !40, line: 6250, baseType: !71, size: 32, offset: 704)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !215, file: !40, line: 6251, baseType: !71, size: 32, offset: 736)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !215, file: !40, line: 6252, baseType: !71, size: 32, offset: 768)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !215, file: !40, line: 6253, baseType: !242, size: 128, offset: 800)
!242 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !203)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !215, file: !40, line: 6254, baseType: !242, size: 128, offset: 928)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !215, file: !40, line: 6255, baseType: !71, size: 32, offset: 1056)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !215, file: !40, line: 6256, baseType: !71, size: 32, offset: 1088)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !215, file: !40, line: 6259, baseType: !71, size: 32, offset: 1120)
!247 = !DIDerivedType(tag: DW_TAG_member, scope: !215, file: !40, line: 6260, baseType: !248, size: 64, align: 64, offset: 1152)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !215, file: !40, line: 6260, size: 64, align: 64, elements: !249)
!249 = !{!250}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !248, file: !40, line: 6260, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !40, line: 7271, size: 448, elements: !253)
!253 = !{!254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !277, !278}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !252, file: !40, line: 7272, baseType: !56, size: 16)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !252, file: !40, line: 7273, baseType: !56, size: 16, offset: 16)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !252, file: !40, line: 7274, baseType: !56, size: 16, offset: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !252, file: !40, line: 7275, baseType: !78, size: 8, offset: 48)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !252, file: !40, line: 7276, baseType: !78, size: 8, offset: 56)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !252, file: !40, line: 7277, baseType: !78, size: 8, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !252, file: !40, line: 7278, baseType: !78, size: 8, offset: 72)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !252, file: !40, line: 7279, baseType: !66, size: 16, offset: 80)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !252, file: !40, line: 7280, baseType: !66, size: 16, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !252, file: !40, line: 7281, baseType: !66, size: 16, offset: 112)
!264 = !DIDerivedType(tag: DW_TAG_member, scope: !252, file: !40, line: 7282, baseType: !265, size: 256, offset: 128)
!265 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !252, file: !40, line: 7282, size: 256, elements: !266)
!266 = !{!267, !272}
!267 = !DIDerivedType(tag: DW_TAG_member, scope: !265, file: !40, line: 7283, baseType: !268, size: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !265, file: !40, line: 7283, size: 64, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !268, file: !40, line: 7284, baseType: !96, size: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !268, file: !40, line: 7285, baseType: !96, size: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, scope: !265, file: !40, line: 7287, baseType: !273, size: 256)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !265, file: !40, line: 7287, size: 256, elements: !274)
!274 = !{!275, !276}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !273, file: !40, line: 7288, baseType: !242, size: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !273, file: !40, line: 7289, baseType: !242, size: 128, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !252, file: !40, line: 7292, baseType: !71, size: 32, offset: 384)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !252, file: !40, line: 7293, baseType: !96, size: 32, offset: 416)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !215, file: !40, line: 6261, baseType: !139, size: 64, offset: 1216)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !215, file: !40, line: 6262, baseType: !71, size: 32, offset: 1280)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !215, file: !40, line: 6263, baseType: !71, size: 32, offset: 1312)
!282 = !DIDerivedType(tag: DW_TAG_member, scope: !215, file: !40, line: 6264, baseType: !283, size: 64, align: 64, offset: 1344)
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !215, file: !40, line: 6264, size: 64, align: 64, elements: !284)
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !283, file: !40, line: 6264, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !40, line: 6333, size: 640, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !287, file: !40, line: 6334, baseType: !71, size: 32)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !287, file: !40, line: 6335, baseType: !71, size: 32, offset: 32)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !287, file: !40, line: 6336, baseType: !71, size: 32, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !287, file: !40, line: 6337, baseType: !71, size: 32, offset: 96)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !287, file: !40, line: 6338, baseType: !71, size: 32, offset: 128)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !287, file: !40, line: 6339, baseType: !71, size: 32, offset: 160)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !287, file: !40, line: 6341, baseType: !71, size: 32, offset: 192)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !287, file: !40, line: 6342, baseType: !242, size: 128, offset: 224)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !287, file: !40, line: 6343, baseType: !71, size: 32, offset: 352)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !287, file: !40, line: 6344, baseType: !66, size: 16, offset: 384)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !287, file: !40, line: 6346, baseType: !71, size: 32, offset: 416)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !287, file: !40, line: 6347, baseType: !242, size: 128, offset: 448)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !287, file: !40, line: 6348, baseType: !71, size: 32, offset: 576)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !287, file: !40, line: 6349, baseType: !303, size: 32, offset: 608)
!303 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !57, line: 26, baseType: !167)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !215, file: !40, line: 6265, baseType: !71, size: 32, offset: 1408)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp_type", scope: !215, file: !40, line: 6266, baseType: !78, size: 8, offset: 1440)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "hwtstamp", scope: !215, file: !40, line: 6268, baseType: !139, size: 64, offset: 1472)
!307 = !{!308, !309, !314, !386, !387, !388, !415, !416, !417, !418, !419, !427, !432, !433, !434, !435, !438, !439, !440, !447, !448, !449, !450, !451, !459, !460, !463, !467, !468, !469, !475, !476, !479, !482, !483, !484, !485, !486, !487, !488, !489, !490, !491, !494, !498, !499, !500, !501, !502, !503, !506, !507, !512, !513, !514, !515, !518, !519, !520, !521, !522, !525, !526, !527, !528, !529, !530, !533, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546}
!308 = !DILocalVariable(name: "skb", arg: 1, scope: !211, file: !3, line: 1304, type: !214)
!309 = !DILocalVariable(name: "cursor", scope: !211, file: !3, line: 1306, type: !310)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "skb_cursor", file: !3, line: 57, size: 128, elements: !311)
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !310, file: !3, line: 58, baseType: !59, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !310, file: !3, line: 59, baseType: !59, size: 64, offset: 64)
!314 = !DILocalVariable(name: "actions", scope: !211, file: !3, line: 1307, type: !315)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_actions", file: !3, line: 72, size: 960, elements: !316)
!316 = !{!317, !323, !327, !331, !332, !333, !337, !338, !342, !346, !350, !354, !358, !378, !382}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_init", scope: !315, file: !3, line: 73, baseType: !318, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !319, size: 64)
!319 = !DISubroutineType(types: !320)
!320 = !{!321, !322, !214}
!321 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "packet_class_action", scope: !315, file: !3, line: 74, baseType: !324, size: 64, offset: 64)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64)
!325 = !DISubroutineType(types: !326)
!326 = !{!315, !315}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "parse_eth", scope: !315, file: !3, line: 76, baseType: !328, size: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DISubroutineType(types: !330)
!330 = !{!78, !322}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "parse_ipv4", scope: !315, file: !3, line: 78, baseType: !328, size: 64, offset: 192)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "parse_ipv6", scope: !315, file: !3, line: 79, baseType: !328, size: 64, offset: 256)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "parse_udp", scope: !315, file: !3, line: 81, baseType: !334, size: 64, offset: 320)
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DISubroutineType(types: !336)
!336 = !{!78, !322, !321}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "parse_tcp", scope: !315, file: !3, line: 82, baseType: !334, size: 64, offset: 384)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_header_size", scope: !315, file: !3, line: 88, baseType: !339, size: 64, offset: 448)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!340 = !DISubroutineType(types: !341)
!341 = !{!78, !322, !321, !321}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_transport_udp", scope: !315, file: !3, line: 89, baseType: !343, size: 64, offset: 512)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64)
!344 = !DISubroutineType(types: !345)
!345 = !{!78, !322, !59, !71, !71, !60, !71}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_transport_tcp", scope: !315, file: !3, line: 90, baseType: !347, size: 64, offset: 576)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DISubroutineType(types: !349)
!349 = !{!78, !322, !59, !103, !71}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_memsafet_payload", scope: !315, file: !3, line: 92, baseType: !351, size: 64, offset: 640)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DISubroutineType(types: !353)
!353 = !{!78, !322, !59, !60}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_memsafet_payload_transport_tcp", scope: !315, file: !3, line: 93, baseType: !355, size: 64, offset: 704)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DISubroutineType(types: !357)
!357 = !{!78, !322, !59, !103}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_queries_section", scope: !315, file: !3, line: 96, baseType: !359, size: 64, offset: 768)
!359 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !360, size: 64)
!360 = !DISubroutineType(types: !361)
!361 = !{!78, !322, !56, !362}
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qtypes", file: !44, line: 66, size: 112, elements: !363)
!363 = !{!364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !362, file: !44, line: 67, baseType: !78, size: 8)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "NS", scope: !362, file: !44, line: 67, baseType: !78, size: 8, offset: 8)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "CNAME", scope: !362, file: !44, line: 67, baseType: !78, size: 8, offset: 16)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "SOA", scope: !362, file: !44, line: 67, baseType: !78, size: 8, offset: 24)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "PTR", scope: !362, file: !44, line: 67, baseType: !78, size: 8, offset: 32)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "MX", scope: !362, file: !44, line: 67, baseType: !78, size: 8, offset: 40)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "TXT", scope: !362, file: !44, line: 67, baseType: !78, size: 8, offset: 48)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "AAAA", scope: !362, file: !44, line: 67, baseType: !78, size: 8, offset: 56)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "SRV", scope: !362, file: !44, line: 67, baseType: !78, size: 8, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "NAPTR", scope: !362, file: !44, line: 67, baseType: !78, size: 8, offset: 72)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "OPT", scope: !362, file: !44, line: 67, baseType: !78, size: 8, offset: 80)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "HTTPS", scope: !362, file: !44, line: 68, baseType: !78, size: 8, offset: 88)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ANY", scope: !362, file: !44, line: 68, baseType: !78, size: 8, offset: 96)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "NULL_TYPE", scope: !362, file: !44, line: 68, baseType: !78, size: 8, offset: 104)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_non_standard_port", scope: !315, file: !3, line: 99, baseType: !379, size: 64, offset: 832)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!78, !322, !214, !59, !60}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_non_standard_port_tcp", scope: !315, file: !3, line: 100, baseType: !383, size: 64, offset: 896)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!78, !322, !214, !59, !103}
!386 = !DILocalVariable(name: "eth", scope: !211, file: !3, line: 1312, type: !121)
!387 = !DILocalVariable(name: "ip", scope: !211, file: !3, line: 1313, type: !73)
!388 = !DILocalVariable(name: "ipv6", scope: !211, file: !3, line: 1314, type: !389)
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !391, line: 118, size: 320, elements: !392)
!391 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "d288e308e142e51c48e7422f4fbbaa3f")
!392 = !{!393, !394, !395, !399, !400, !401, !402}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !390, file: !391, line: 120, baseType: !78, size: 4, flags: DIFlagBitField, extraData: i64 0)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !390, file: !391, line: 121, baseType: !78, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !390, file: !391, line: 128, baseType: !396, size: 24, offset: 8)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 24, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 3)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !390, file: !391, line: 130, baseType: !66, size: 16, offset: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !390, file: !391, line: 131, baseType: !78, size: 8, offset: 48)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !390, file: !391, line: 132, baseType: !78, size: 8, offset: 56)
!402 = !DIDerivedType(tag: DW_TAG_member, scope: !390, file: !391, line: 134, baseType: !403, size: 256, offset: 64)
!403 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !390, file: !391, line: 134, size: 256, elements: !404)
!404 = !{!405, !410}
!405 = !DIDerivedType(tag: DW_TAG_member, scope: !403, file: !391, line: 134, baseType: !406, size: 256)
!406 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !403, file: !391, line: 134, size: 256, elements: !407)
!407 = !{!408, !409}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !406, file: !391, line: 134, baseType: !187, size: 128)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !406, file: !391, line: 134, baseType: !187, size: 128, offset: 128)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !403, file: !391, line: 134, baseType: !411, size: 256)
!411 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !403, file: !391, line: 134, size: 256, elements: !412)
!412 = !{!413, !414}
!413 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !411, file: !391, line: 134, baseType: !187, size: 128)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !411, file: !391, line: 134, baseType: !187, size: 128, offset: 128)
!415 = !DILocalVariable(name: "nhoff", scope: !211, file: !3, line: 1320, type: !71)
!416 = !DILocalVariable(name: "udp", scope: !211, file: !3, line: 1331, type: !131)
!417 = !DILocalVariable(name: "tcp", scope: !211, file: !3, line: 1331, type: !141)
!418 = !DILocalVariable(name: "hproto", scope: !211, file: !3, line: 1333, type: !66)
!419 = !DILocalVariable(name: "vlan", scope: !420, file: !3, line: 1336, type: !422)
!420 = distinct !DILexicalBlock(scope: !421, file: !3, line: 1335, column: 92)
!421 = distinct !DILexicalBlock(scope: !211, file: !3, line: 1335, column: 9)
!422 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !423, size: 64)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !3, line: 67, size: 32, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !423, file: !3, line: 68, baseType: !66, size: 16)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !423, file: !3, line: 69, baseType: !66, size: 16, offset: 16)
!427 = !DILocalVariable(name: "udp_data", scope: !428, file: !3, line: 1361, type: !59)
!428 = distinct !DILexicalBlock(scope: !429, file: !3, line: 1357, column: 42)
!429 = distinct !DILexicalBlock(scope: !430, file: !3, line: 1357, column: 13)
!430 = distinct !DILexicalBlock(scope: !431, file: !3, line: 1350, column: 46)
!431 = distinct !DILexicalBlock(scope: !211, file: !3, line: 1350, column: 9)
!432 = !DILocalVariable(name: "total_offset", scope: !428, file: !3, line: 1364, type: !71)
!433 = !DILocalVariable(name: "udp_payload_len", scope: !428, file: !3, line: 1366, type: !71)
!434 = !DILocalVariable(name: "udp_payload_exclude_header", scope: !428, file: !3, line: 1367, type: !71)
!435 = !DILocalVariable(name: "dns_payload", scope: !436, file: !3, line: 1375, type: !59)
!436 = distinct !DILexicalBlock(scope: !437, file: !3, line: 1370, column: 58)
!437 = distinct !DILexicalBlock(scope: !428, file: !3, line: 1370, column: 17)
!438 = !DILocalVariable(name: "dns", scope: !436, file: !3, line: 1377, type: !60)
!439 = !DILocalVariable(name: "parse_flag", scope: !436, file: !3, line: 1384, type: !78)
!440 = !DILocalVariable(name: "result", scope: !436, file: !3, line: 1386, type: !441)
!441 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "result_parse_dns_labels", file: !184, line: 107, size: 32, elements: !442)
!442 = !{!443, !444, !445, !446}
!443 = !DIDerivedType(tag: DW_TAG_member, name: "deep_scan_mirror", scope: !441, file: !184, line: 108, baseType: !321, size: 8)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !441, file: !184, line: 109, baseType: !321, size: 8, offset: 8)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "isBenign", scope: !441, file: !184, line: 110, baseType: !321, size: 8, offset: 16)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "isC2c", scope: !441, file: !184, line: 111, baseType: !321, size: 8, offset: 24)
!447 = !DILocalVariable(name: "current_dest_addr", scope: !436, file: !3, line: 1392, type: !96)
!448 = !DILocalVariable(name: "dest_addr_route", scope: !436, file: !3, line: 1393, type: !96)
!449 = !DILocalVariable(name: "dest_addr_route_malicious", scope: !436, file: !3, line: 1394, type: !96)
!450 = !DILocalVariable(name: "out", scope: !436, file: !3, line: 1396, type: !71)
!451 = !DILocalVariable(name: "config", scope: !436, file: !3, line: 1398, type: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_kernel_config", file: !184, line: 25, size: 128, elements: !454)
!454 = !{!455, !456, !457, !458}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "BridgeIndexId", scope: !453, file: !184, line: 26, baseType: !71, size: 32)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "NfNdpBridgeIndexId", scope: !453, file: !184, line: 27, baseType: !71, size: 32, offset: 32)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "RedirectIpv4", scope: !453, file: !184, line: 28, baseType: !96, size: 32, offset: 64)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "NfNdpBridgeRedirectIpv4", scope: !453, file: !184, line: 29, baseType: !96, size: 32, offset: 96)
!459 = !DILocalVariable(name: "br_index", scope: !436, file: !3, line: 1399, type: !71)
!460 = !DILocalVariable(name: "redirect_address_from_config", scope: !461, file: !3, line: 1402, type: !96)
!461 = distinct !DILexicalBlock(scope: !462, file: !3, line: 1401, column: 29)
!462 = distinct !DILexicalBlock(scope: !436, file: !3, line: 1401, column: 21)
!463 = !DILocalVariable(name: "csum_diff_drop", scope: !464, file: !3, line: 1432, type: !71)
!464 = distinct !DILexicalBlock(scope: !465, file: !3, line: 1421, column: 38)
!465 = distinct !DILexicalBlock(scope: !466, file: !3, line: 1421, column: 26)
!466 = distinct !DILexicalBlock(scope: !436, file: !3, line: 1413, column: 21)
!467 = !DILocalVariable(name: "transaction_id", scope: !436, file: !3, line: 1455, type: !56)
!468 = !DILocalVariable(name: "ip_checksum", scope: !436, file: !3, line: 1456, type: !56)
!469 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !436, file: !3, line: 1457, type: !470)
!470 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !471, size: 64)
!471 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "checkSum_redirect_struct_value", file: !3, line: 134, size: 128, elements: !472)
!472 = !{!473, !474}
!473 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !471, file: !3, line: 135, baseType: !56, size: 16)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_timets", scope: !471, file: !3, line: 136, baseType: !139, size: 64, offset: 64)
!475 = !DILocalVariable(name: "csum_diff", scope: !436, file: !3, line: 1483, type: !71)
!476 = !DILocalVariable(name: "tcp_data", scope: !477, file: !3, line: 1520, type: !59)
!477 = distinct !DILexicalBlock(scope: !478, file: !3, line: 1515, column: 48)
!478 = distinct !DILexicalBlock(scope: !429, file: !3, line: 1515, column: 19)
!479 = !DILocalVariable(name: "dns_payload", scope: !480, file: !3, line: 1525, type: !59)
!480 = distinct !DILexicalBlock(scope: !481, file: !3, line: 1523, column: 58)
!481 = distinct !DILexicalBlock(scope: !477, file: !3, line: 1523, column: 17)
!482 = !DILocalVariable(name: "dns", scope: !480, file: !3, line: 1527, type: !103)
!483 = !DILocalVariable(name: "parse_flag", scope: !480, file: !3, line: 1535, type: !78)
!484 = !DILocalVariable(name: "result", scope: !480, file: !3, line: 1537, type: !441)
!485 = !DILocalVariable(name: "current_dest_addr", scope: !480, file: !3, line: 1540, type: !96)
!486 = !DILocalVariable(name: "dest_addr_route", scope: !480, file: !3, line: 1541, type: !96)
!487 = !DILocalVariable(name: "dest_addr_route_malicious", scope: !480, file: !3, line: 1542, type: !96)
!488 = !DILocalVariable(name: "out", scope: !480, file: !3, line: 1544, type: !71)
!489 = !DILocalVariable(name: "config", scope: !480, file: !3, line: 1545, type: !452)
!490 = !DILocalVariable(name: "br_index", scope: !480, file: !3, line: 1546, type: !71)
!491 = !DILocalVariable(name: "redirect_address_from_config", scope: !492, file: !3, line: 1549, type: !96)
!492 = distinct !DILexicalBlock(scope: !493, file: !3, line: 1548, column: 29)
!493 = distinct !DILexicalBlock(scope: !480, file: !3, line: 1548, column: 21)
!494 = !DILocalVariable(name: "br_index", scope: !495, file: !3, line: 1564, type: !71)
!495 = distinct !DILexicalBlock(scope: !496, file: !3, line: 1562, column: 39)
!496 = distinct !DILexicalBlock(scope: !497, file: !3, line: 1562, column: 26)
!497 = distinct !DILexicalBlock(scope: !480, file: !3, line: 1560, column: 21)
!498 = !DILocalVariable(name: "config", scope: !495, file: !3, line: 1565, type: !452)
!499 = !DILocalVariable(name: "csum_diff_drop", scope: !495, file: !3, line: 1573, type: !71)
!500 = !DILocalVariable(name: "transaction_id", scope: !480, file: !3, line: 1597, type: !71)
!501 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !480, file: !3, line: 1599, type: !470)
!502 = !DILocalVariable(name: "tcp_payload_len", scope: !480, file: !3, line: 1619, type: !71)
!503 = !DILocalVariable(name: "dns_rate_limit_action", scope: !504, file: !3, line: 1621, type: !78)
!504 = distinct !DILexicalBlock(scope: !505, file: !3, line: 1620, column: 46)
!505 = distinct !DILexicalBlock(scope: !480, file: !3, line: 1620, column: 21)
!506 = !DILocalVariable(name: "csum_diff", scope: !480, file: !3, line: 1634, type: !71)
!507 = !DILocalVariable(name: "udp_data", scope: !508, file: !3, line: 1673, type: !59)
!508 = distinct !DILexicalBlock(scope: !509, file: !3, line: 1668, column: 43)
!509 = distinct !DILexicalBlock(scope: !510, file: !3, line: 1668, column: 13)
!510 = distinct !DILexicalBlock(scope: !511, file: !3, line: 1663, column: 51)
!511 = distinct !DILexicalBlock(scope: !431, file: !3, line: 1663, column: 12)
!512 = !DILocalVariable(name: "total_offset", scope: !508, file: !3, line: 1676, type: !71)
!513 = !DILocalVariable(name: "udp_payload_len", scope: !508, file: !3, line: 1678, type: !71)
!514 = !DILocalVariable(name: "udp_payload_exclude_header", scope: !508, file: !3, line: 1679, type: !71)
!515 = !DILocalVariable(name: "dns_payload", scope: !516, file: !3, line: 1685, type: !59)
!516 = distinct !DILexicalBlock(scope: !517, file: !3, line: 1681, column: 58)
!517 = distinct !DILexicalBlock(scope: !508, file: !3, line: 1681, column: 17)
!518 = !DILocalVariable(name: "dns", scope: !516, file: !3, line: 1687, type: !60)
!519 = !DILocalVariable(name: "parse_flag", scope: !516, file: !3, line: 1694, type: !78)
!520 = !DILocalVariable(name: "result", scope: !516, file: !3, line: 1696, type: !441)
!521 = !DILocalVariable(name: "dns_payload_size", scope: !516, file: !3, line: 1699, type: !56)
!522 = !DILocalVariable(name: "dns_rate_limit_action", scope: !523, file: !3, line: 1701, type: !78)
!523 = distinct !DILexicalBlock(scope: !524, file: !3, line: 1700, column: 46)
!524 = distinct !DILexicalBlock(scope: !516, file: !3, line: 1700, column: 21)
!525 = !DILocalVariable(name: "out", scope: !516, file: !3, line: 1707, type: !71)
!526 = !DILocalVariable(name: "config", scope: !516, file: !3, line: 1709, type: !452)
!527 = !DILocalVariable(name: "br_index", scope: !516, file: !3, line: 1710, type: !71)
!528 = !DILocalVariable(name: "transaction_id", scope: !516, file: !3, line: 1744, type: !56)
!529 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !516, file: !3, line: 1746, type: !470)
!530 = !DILocalVariable(name: "tcp_data", scope: !531, file: !3, line: 1787, type: !59)
!531 = distinct !DILexicalBlock(scope: !532, file: !3, line: 1782, column: 49)
!532 = distinct !DILexicalBlock(scope: !509, file: !3, line: 1782, column: 19)
!533 = !DILocalVariable(name: "dns", scope: !534, file: !3, line: 1792, type: !103)
!534 = distinct !DILexicalBlock(scope: !535, file: !3, line: 1790, column: 58)
!535 = distinct !DILexicalBlock(scope: !531, file: !3, line: 1790, column: 17)
!536 = !DILocalVariable(name: "dns_payload", scope: !534, file: !3, line: 1795, type: !59)
!537 = !DILocalVariable(name: "parse_flag", scope: !534, file: !3, line: 1803, type: !78)
!538 = !DILocalVariable(name: "result", scope: !534, file: !3, line: 1805, type: !441)
!539 = !DILocalVariable(name: "skb_ifIndex", scope: !534, file: !3, line: 1807, type: !71)
!540 = !DILocalVariable(name: "out", scope: !534, file: !3, line: 1810, type: !71)
!541 = !DILocalVariable(name: "config", scope: !534, file: !3, line: 1812, type: !452)
!542 = !DILocalVariable(name: "br_index", scope: !534, file: !3, line: 1813, type: !71)
!543 = !DILocalVariable(name: "transaction_id", scope: !534, file: !3, line: 1832, type: !56)
!544 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !534, file: !3, line: 1834, type: !470)
!545 = !DILocalVariable(name: "tcp_payload_len", scope: !534, file: !3, line: 1855, type: !71)
!546 = !DILocalVariable(name: "dns_rate_limit_action", scope: !547, file: !3, line: 1857, type: !78)
!547 = distinct !DILexicalBlock(scope: !548, file: !3, line: 1856, column: 46)
!548 = distinct !DILexicalBlock(scope: !534, file: !3, line: 1856, column: 21)
!549 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 624, elements: !552)
!550 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !551)
!551 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!552 = !{!553}
!553 = !DISubrange(count: 78)
!554 = !DIGlobalVariableExpression(var: !555, expr: !DIExpression())
!555 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !556, line: 177, type: !557, isLocal: true, isDefinition: true)
!556 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "", checksumkind: CSK_MD5, checksum: "65e4dc8e3121f91a5c2c9eb8563c5692")
!557 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !558)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !559, size: 64)
!559 = !DISubroutineType(types: !560)
!560 = !{!113, !561, !71, null}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !550, size: 64)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !556, line: 56, type: !564, isLocal: true, isDefinition: true)
!564 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !565)
!565 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !566, size: 64)
!566 = !DISubroutineType(types: !567)
!567 = !{!59, !59, !568}
!568 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !569, size: 64)
!569 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "____fmt", scope: !211, file: !3, line: 1408, type: !572, isLocal: true, isDefinition: true)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 464, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 58)
!575 = !DIGlobalVariableExpression(var: !576, expr: !DIExpression())
!576 = distinct !DIGlobalVariable(name: "bpf_skb_load_bytes", scope: !2, file: !556, line: 719, type: !577, isLocal: true, isDefinition: true)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !578)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DISubroutineType(types: !580)
!580 = !{!113, !568, !71, !59, !71}
!581 = !DIGlobalVariableExpression(var: !582, expr: !DIExpression())
!582 = distinct !DIGlobalVariable(name: "____fmt", scope: !211, file: !3, line: 1429, type: !583, isLocal: true, isDefinition: true)
!583 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 512, elements: !584)
!584 = !{!585}
!585 = !DISubrange(count: 64)
!586 = !DIGlobalVariableExpression(var: !587, expr: !DIExpression())
!587 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !556, line: 796, type: !588, isLocal: true, isDefinition: true)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !589)
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !590, size: 64)
!590 = !DISubroutineType(types: !591)
!591 = !{!592, !594, !71, !594, !71, !595}
!592 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !57, line: 30, baseType: !593)
!593 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!594 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!595 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !67, line: 39, baseType: !71)
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "bpf_l3_csum_replace", scope: !2, file: !556, line: 256, type: !598, isLocal: true, isDefinition: true)
!598 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !599)
!599 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !600, size: 64)
!600 = !DISubroutineType(types: !601)
!601 = !{!113, !214, !71, !139, !139, !139}
!602 = !DIGlobalVariableExpression(var: !603, expr: !DIExpression())
!603 = distinct !DIGlobalVariable(name: "bpf_skb_store_bytes", scope: !2, file: !556, line: 227, type: !604, isLocal: true, isDefinition: true)
!604 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !605)
!605 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !606, size: 64)
!606 = !DISubroutineType(types: !607)
!607 = !{!113, !214, !71, !568, !71, !139}
!608 = !DIGlobalVariableExpression(var: !609, expr: !DIExpression())
!609 = distinct !DIGlobalVariable(name: "bpf_redirect", scope: !2, file: !556, line: 621, type: !610, isLocal: true, isDefinition: true)
!610 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !611)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DISubroutineType(types: !613)
!613 = !{!113, !71, !139}
!614 = !DIGlobalVariableExpression(var: !615, expr: !DIExpression())
!615 = distinct !DIGlobalVariable(name: "____fmt", scope: !211, file: !3, line: 1462, type: !616, isLocal: true, isDefinition: true)
!616 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 1344, elements: !617)
!617 = !{!618}
!618 = !DISubrange(count: 168)
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "____fmt", scope: !211, file: !3, line: 1555, type: !621, isLocal: true, isDefinition: true)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 672, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 84)
!624 = !DIGlobalVariableExpression(var: !625, expr: !DIExpression())
!625 = distinct !DIGlobalVariable(name: "____fmt", scope: !211, file: !3, line: 1569, type: !583, isLocal: true, isDefinition: true)
!626 = !DIGlobalVariableExpression(var: !627, expr: !DIExpression())
!627 = distinct !DIGlobalVariable(name: "____fmt", scope: !211, file: !3, line: 1604, type: !616, isLocal: true, isDefinition: true)
!628 = !DIGlobalVariableExpression(var: !629, expr: !DIExpression())
!629 = distinct !DIGlobalVariable(name: "____fmt", scope: !211, file: !3, line: 1715, type: !572, isLocal: true, isDefinition: true)
!630 = !DIGlobalVariableExpression(var: !631, expr: !DIExpression())
!631 = distinct !DIGlobalVariable(name: "____fmt", scope: !211, file: !3, line: 1751, type: !616, isLocal: true, isDefinition: true)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "____fmt", scope: !211, file: !3, line: 1818, type: !572, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "____fmt", scope: !211, file: !3, line: 1839, type: !616, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "__license", scope: !2, file: !3, line: 1882, type: !638, isLocal: false, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 104, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 13)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "flags", scope: !2, file: !44, line: 21, type: !43, isLocal: false, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "exfil_security_config_map", scope: !2, file: !184, line: 37, type: !645, isLocal: false, isDefinition: true)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_config_map", file: !184, line: 32, size: 256, elements: !646)
!646 = !{!647, !652, !654, !655}
!647 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !645, file: !184, line: 33, baseType: !648, size: 64)
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !649, size: 64)
!649 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 32, elements: !650)
!650 = !{!651}
!651 = !DISubrange(count: 1)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !645, file: !184, line: 34, baseType: !653, size: 64, offset: 64)
!653 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !645, file: !184, line: 35, baseType: !452, size: 64, offset: 128)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !645, file: !184, line: 36, baseType: !656, size: 64, offset: 192)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 2048, elements: !584)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "exfil_security_egress_dns_limites", scope: !2, file: !184, line: 49, type: !660, isLocal: false, isDefinition: true)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_dns_limites", file: !184, line: 44, size: 256, elements: !661)
!661 = !{!662, !663, !664, !665}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !660, file: !184, line: 45, baseType: !648, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !660, file: !184, line: 46, baseType: !653, size: 64, offset: 64)
!664 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !660, file: !184, line: 47, baseType: !653, size: 64, offset: 128)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !660, file: !184, line: 48, baseType: !666, size: 64, offset: 192)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 512, elements: !195)
!668 = !DIGlobalVariableExpression(var: !669, expr: !DIExpression())
!669 = distinct !DIGlobalVariable(name: "exfil_security_egrees_redirect_ring_buff_non_standard_port", scope: !2, file: !3, line: 112, type: !670, isLocal: false, isDefinition: true)
!670 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egrees_redirect_ring_buff_non_standard_port", file: !3, line: 109, size: 128, elements: !671)
!671 = !{!672, !677}
!672 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !670, file: !3, line: 110, baseType: !673, size: 64)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 864, elements: !675)
!675 = !{!676}
!676 = !DISubrange(count: 27)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !670, file: !3, line: 111, baseType: !678, size: 64, offset: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 536870912, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 16777216)
!682 = !DIGlobalVariableExpression(var: !683, expr: !DIExpression())
!683 = distinct !DIGlobalVariable(name: "exfil_security_egress_reconnisance_map_scan", scope: !2, file: !3, line: 130, type: !684, isLocal: false, isDefinition: true)
!684 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_reconnisance_map_scan", file: !3, line: 125, size: 256, elements: !685)
!685 = !{!686, !691, !692, !700}
!686 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !684, file: !3, line: 126, baseType: !687, size: 64)
!687 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !688, size: 64)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 288, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 9)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !684, file: !3, line: 127, baseType: !115, size: 64, offset: 64)
!692 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !684, file: !3, line: 128, baseType: !693, size: 64, offset: 128)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_raw_packet_mirror", file: !3, line: 116, size: 48, elements: !695)
!695 = !{!696, !697, !698, !699}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !694, file: !3, line: 117, baseType: !56, size: 16)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !694, file: !3, line: 118, baseType: !56, size: 16, offset: 16)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "isUdp", scope: !694, file: !3, line: 119, baseType: !78, size: 8, offset: 32)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "isPacketRescanedAndMalicious", scope: !694, file: !3, line: 120, baseType: !78, size: 8, offset: 40)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !684, file: !3, line: 129, baseType: !701, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 2097152, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 65536)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_map", scope: !2, file: !3, line: 145, type: !707, isLocal: false, isDefinition: true)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_map", file: !3, line: 140, size: 256, elements: !708)
!708 = !{!709, !710, !711, !712}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !707, file: !3, line: 141, baseType: !687, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !707, file: !3, line: 142, baseType: !115, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !707, file: !3, line: 143, baseType: !470, size: 64, offset: 128)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !707, file: !3, line: 144, baseType: !678, size: 64, offset: 192)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "exfil_security_protocols_identifier_maps", scope: !2, file: !3, line: 155, type: !715, isLocal: false, isDefinition: true)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_protocols_identifier_maps", file: !3, line: 150, size: 256, elements: !716)
!716 = !{!717, !720, !721, !722}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !715, file: !3, line: 151, baseType: !718, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !719, size: 64)
!719 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 64, elements: !168)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !715, file: !3, line: 152, baseType: !653, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !715, file: !3, line: 153, baseType: !115, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !715, file: !3, line: 154, baseType: !723, size: 64, offset: 192)
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !724, size: 64)
!724 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 160, elements: !231)
!725 = !DIGlobalVariableExpression(var: !726, expr: !DIExpression())
!726 = distinct !DIGlobalVariable(name: "exfil_security_egress_redurect_ts_verify", scope: !2, file: !3, line: 162, type: !727, isLocal: false, isDefinition: true)
!727 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redurect_ts_verify", file: !3, line: 157, size: 256, elements: !728)
!728 = !{!729, !730, !732, !733}
!729 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !727, file: !3, line: 158, baseType: !687, size: 64)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !727, file: !3, line: 159, baseType: !731, size: 64, offset: 64)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !727, file: !3, line: 160, baseType: !114, size: 64, offset: 128)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !727, file: !3, line: 161, baseType: !734, size: 64, offset: 192)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !735, size: 64)
!735 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 1048576, elements: !736)
!736 = !{!737}
!737 = !DISubrange(count: 32768)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_loop_time", scope: !2, file: !3, line: 173, type: !740, isLocal: false, isDefinition: true)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_loop_time", file: !3, line: 168, size: 256, elements: !741)
!741 = !{!742, !743, !744, !745}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !740, file: !3, line: 169, baseType: !687, size: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !740, file: !3, line: 170, baseType: !653, size: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !740, file: !3, line: 171, baseType: !731, size: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !740, file: !3, line: 172, baseType: !734, size: 64, offset: 192)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_count_map", scope: !2, file: !3, line: 181, type: !748, isLocal: false, isDefinition: true)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_count_map", file: !3, line: 176, size: 256, elements: !749)
!749 = !{!750, !751, !752, !753}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !748, file: !3, line: 177, baseType: !687, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !748, file: !3, line: 178, baseType: !115, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !748, file: !3, line: 179, baseType: !653, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !748, file: !3, line: 180, baseType: !648, size: 64, offset: 192)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_drop_count_map", scope: !2, file: !3, line: 189, type: !756, isLocal: false, isDefinition: true)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_drop_count_map", file: !3, line: 184, size: 256, elements: !757)
!757 = !{!758, !759, !760, !761}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !756, file: !3, line: 185, baseType: !687, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !756, file: !3, line: 186, baseType: !115, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !756, file: !3, line: 187, baseType: !653, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !756, file: !3, line: 188, baseType: !648, size: 64, offset: 192)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "exfil_security_egress_vxlan_dns_transport", scope: !2, file: !3, line: 196, type: !764, isLocal: false, isDefinition: true)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_vxlan_dns_transport", file: !3, line: 191, size: 256, elements: !765)
!765 = !{!766, !767, !768, !769}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !764, file: !3, line: 192, baseType: !687, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !764, file: !3, line: 193, baseType: !114, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !764, file: !3, line: 194, baseType: !653, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !764, file: !3, line: 195, baseType: !648, size: 64, offset: 192)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "exfil_security_egress_rate_limit_map", scope: !2, file: !3, line: 213, type: !772, isLocal: false, isDefinition: true)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_rate_limit_map", file: !3, line: 208, size: 256, elements: !773)
!773 = !{!774, !775, !776, !782}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !772, file: !3, line: 209, baseType: !687, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !772, file: !3, line: 210, baseType: !115, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !772, file: !3, line: 211, baseType: !777, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !778, size: 64)
!778 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_volume_stats", file: !3, line: 200, size: 128, elements: !779)
!779 = !{!780, !781}
!780 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !778, file: !3, line: 201, baseType: !139, size: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "packet_size", scope: !778, file: !3, line: 202, baseType: !71, size: 32, offset: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !772, file: !3, line: 212, baseType: !648, size: 64, offset: 192)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "maps", scope: !2, file: !3, line: 1281, type: !785, isLocal: false, isDefinition: true)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_handler_map", file: !3, line: 1275, size: 320, elements: !786)
!786 = !{!787, !788, !789, !790, !791}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !785, file: !3, line: 1276, baseType: !648, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !785, file: !3, line: 1277, baseType: !678, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !785, file: !3, line: 1278, baseType: !114, size: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !785, file: !3, line: 1279, baseType: !115, size: 64, offset: 192)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !785, file: !3, line: 1280, baseType: !648, size: 64, offset: 256)
!792 = !DIGlobalVariableExpression(var: !793, expr: !DIExpression())
!793 = distinct !DIGlobalVariable(name: "____fmt", scope: !794, file: !3, line: 265, type: !804, isLocal: true, isDefinition: true)
!794 = distinct !DISubprogram(name: "process_udp_payload_mem_verification", scope: !3, file: !3, line: 247, type: !795, scopeLine: 247, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !797)
!795 = !DISubroutineType(types: !796)
!796 = !{!78, !131, !322, !321}
!797 = !{!798, !799, !800, !801, !802, !803}
!798 = !DILocalVariable(name: "udp", arg: 1, scope: !794, file: !3, line: 247, type: !131)
!799 = !DILocalVariable(name: "skb", arg: 2, scope: !794, file: !3, line: 247, type: !322)
!800 = !DILocalVariable(name: "isIPv4", arg: 3, scope: !794, file: !3, line: 247, type: !321)
!801 = !DILocalVariable(name: "udp_len", scope: !794, file: !3, line: 248, type: !56)
!802 = !DILocalVariable(name: "udp_len_payload", scope: !794, file: !3, line: 249, type: !56)
!803 = !DILocalVariable(name: "udp_data", scope: !794, file: !3, line: 252, type: !59)
!804 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 288, elements: !805)
!805 = !{!806}
!806 = !DISubrange(count: 36)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "____fmt", scope: !809, file: !3, line: 719, type: !572, isLocal: true, isDefinition: true)
!809 = distinct !DISubprogram(name: "parse_dns_payload_non_standard_port", scope: !3, file: !3, line: 701, type: !380, scopeLine: 702, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !810)
!810 = !{!811, !812, !813, !814, !815, !818, !819, !820, !821, !834, !835, !836, !837, !838, !841}
!811 = !DILocalVariable(name: "skb", arg: 1, scope: !809, file: !3, line: 701, type: !322)
!812 = !DILocalVariable(name: "raw_skb", arg: 2, scope: !809, file: !3, line: 701, type: !214)
!813 = !DILocalVariable(name: "dns_payload", arg: 3, scope: !809, file: !3, line: 701, type: !59)
!814 = !DILocalVariable(name: "dns_header", arg: 4, scope: !809, file: !3, line: 702, type: !60)
!815 = !DILocalVariable(name: "br_index", scope: !816, file: !3, line: 707, type: !71)
!816 = distinct !DILexicalBlock(scope: !817, file: !3, line: 706, column: 76)
!817 = distinct !DILexicalBlock(scope: !809, file: !3, line: 706, column: 9)
!818 = !DILocalVariable(name: "out", scope: !816, file: !3, line: 708, type: !71)
!819 = !DILocalVariable(name: "dest_addr_route", scope: !816, file: !3, line: 709, type: !96)
!820 = !DILocalVariable(name: "config", scope: !816, file: !3, line: 712, type: !452)
!821 = !DILocalVariable(name: "flags", scope: !809, file: !3, line: 726, type: !822)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_flags", file: !44, line: 53, size: 80, elements: !823)
!823 = !{!824, !825, !826, !827, !828, !829, !830, !831, !832, !833}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "qr", scope: !822, file: !44, line: 54, baseType: !78, size: 8)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !822, file: !44, line: 55, baseType: !78, size: 8, offset: 8)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !822, file: !44, line: 56, baseType: !78, size: 8, offset: 16)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !822, file: !44, line: 57, baseType: !78, size: 8, offset: 24)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "rd", scope: !822, file: !44, line: 58, baseType: !78, size: 8, offset: 32)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ra", scope: !822, file: !44, line: 59, baseType: !78, size: 8, offset: 40)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !822, file: !44, line: 60, baseType: !78, size: 8, offset: 48)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !822, file: !44, line: 61, baseType: !78, size: 8, offset: 56)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !822, file: !44, line: 62, baseType: !78, size: 8, offset: 64)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !822, file: !44, line: 63, baseType: !78, size: 8, offset: 72)
!834 = !DILocalVariable(name: "qd_count", scope: !809, file: !3, line: 730, type: !56)
!835 = !DILocalVariable(name: "ans_count", scope: !809, file: !3, line: 731, type: !56)
!836 = !DILocalVariable(name: "auth_count", scope: !809, file: !3, line: 732, type: !56)
!837 = !DILocalVariable(name: "add_count", scope: !809, file: !3, line: 733, type: !56)
!838 = !DILocalVariable(name: "raw_dns_flags", scope: !839, file: !3, line: 747, type: !56)
!839 = distinct !DILexicalBlock(scope: !840, file: !3, line: 741, column: 25)
!840 = distinct !DILexicalBlock(scope: !809, file: !3, line: 741, column: 9)
!841 = !DILocalVariable(name: "dns_header_flags", scope: !839, file: !3, line: 754, type: !822)
!842 = !DIGlobalVariableExpression(var: !843, expr: !DIExpression())
!843 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !556, line: 78, type: !844, isLocal: true, isDefinition: true)
!844 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !845)
!845 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !846, size: 64)
!846 = !DISubroutineType(types: !847)
!847 = !{!113, !59, !568, !568, !139}
!848 = !DIGlobalVariableExpression(var: !849, expr: !DIExpression())
!849 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !556, line: 114, type: !850, isLocal: true, isDefinition: true)
!850 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !851)
!851 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !852, size: 64)
!852 = !DISubroutineType(types: !853)
!853 = !{!139}
!854 = !DIGlobalVariableExpression(var: !855, expr: !DIExpression())
!855 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !556, line: 88, type: !856, isLocal: true, isDefinition: true)
!856 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !857)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DISubroutineType(types: !859)
!859 = !{!113, !59, !568}
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "bpf_ringbuf_reserve", scope: !2, file: !556, line: 3176, type: !862, isLocal: true, isDefinition: true)
!862 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!59, !59, !139, !139}
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "bpf_ringbuf_submit", scope: !2, file: !556, line: 3194, type: !868, isLocal: true, isDefinition: true)
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{null, !59, !139}
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "____fmt", scope: !874, file: !3, line: 872, type: !572, isLocal: true, isDefinition: true)
!874 = distinct !DISubprogram(name: "__process_packet_clone_redirection_non_standard_port", scope: !3, file: !3, line: 857, type: !875, scopeLine: 857, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !877)
!875 = !DISubroutineType(types: !876)
!876 = !{!78, !214, !321, !56, !56}
!877 = !{!878, !879, !880, !881, !882, !883, !884, !885, !886, !887, !888, !892, !893, !894, !897}
!878 = !DILocalVariable(name: "skb", arg: 1, scope: !874, file: !3, line: 857, type: !214)
!879 = !DILocalVariable(name: "isUdp", arg: 2, scope: !874, file: !3, line: 857, type: !321)
!880 = !DILocalVariable(name: "__transport_dest_port", arg: 3, scope: !874, file: !3, line: 857, type: !56)
!881 = !DILocalVariable(name: "__transport_src_port", arg: 4, scope: !874, file: !3, line: 857, type: !56)
!882 = !DILocalVariable(name: "br_index", scope: !874, file: !3, line: 860, type: !71)
!883 = !DILocalVariable(name: "out", scope: !874, file: !3, line: 861, type: !71)
!884 = !DILocalVariable(name: "dest_addr_route", scope: !874, file: !3, line: 862, type: !96)
!885 = !DILocalVariable(name: "config", scope: !874, file: !3, line: 865, type: !452)
!886 = !DILocalVariable(name: "MAX_PROTOCOL_SIZE", scope: !874, file: !3, line: 877, type: !167)
!887 = !DILocalVariable(name: "isTunnelC2CStandardUdpTransport", scope: !874, file: !3, line: 879, type: !321)
!888 = !DILocalVariable(name: "i", scope: !889, file: !3, line: 882, type: !167)
!889 = distinct !DILexicalBlock(scope: !890, file: !3, line: 882, column: 9)
!890 = distinct !DILexicalBlock(scope: !891, file: !3, line: 880, column: 16)
!891 = distinct !DILexicalBlock(scope: !874, file: !3, line: 880, column: 9)
!892 = !DILocalVariable(name: "udp_dst_transfer_key", scope: !874, file: !3, line: 890, type: !56)
!893 = !DILocalVariable(name: "raw_pack", scope: !874, file: !3, line: 891, type: !693)
!894 = !DILocalVariable(name: "pack", scope: !895, file: !3, line: 893, type: !694)
!895 = distinct !DILexicalBlock(scope: !896, file: !3, line: 892, column: 19)
!896 = distinct !DILexicalBlock(scope: !874, file: !3, line: 892, column: 9)
!897 = !DILocalVariable(name: "re_scanned_packed_and_malicious", scope: !898, file: !3, line: 916, type: !78)
!898 = distinct !DILexicalBlock(scope: !896, file: !3, line: 914, column: 11)
!899 = !DIGlobalVariableExpression(var: !900, expr: !DIExpression())
!900 = distinct !DIGlobalVariable(name: "____fmt", scope: !874, file: !3, line: 901, type: !901, isLocal: true, isDefinition: true)
!901 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 576, elements: !902)
!902 = !{!903}
!903 = !DISubrange(count: 72)
!904 = !DIGlobalVariableExpression(var: !905, expr: !DIExpression())
!905 = distinct !DIGlobalVariable(scope: null, file: !906, line: 11, type: !907, isLocal: true, isDefinition: true)
!906 = !DIFile(filename: "./raw_proc.h", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "a725efa43c227a0df9a1ab85e6b8a9ad")
!907 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 32, elements: !203)
!908 = !DIGlobalVariableExpression(var: !909, expr: !DIExpression())
!909 = distinct !DIGlobalVariable(scope: null, file: !906, line: 12, type: !910, isLocal: true, isDefinition: true)
!910 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 96, elements: !911)
!911 = !{!912}
!912 = !DISubrange(count: 12)
!913 = !DIGlobalVariableExpression(var: !914, expr: !DIExpression())
!914 = distinct !DIGlobalVariable(scope: null, file: !906, line: 13, type: !910, isLocal: true, isDefinition: true)
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(scope: null, file: !906, line: 14, type: !917, isLocal: true, isDefinition: true)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 40, elements: !231)
!918 = !DIGlobalVariableExpression(var: !919, expr: !DIExpression())
!919 = distinct !DIGlobalVariable(scope: null, file: !906, line: 15, type: !907, isLocal: true, isDefinition: true)
!920 = !DIGlobalVariableExpression(var: !921, expr: !DIExpression())
!921 = distinct !DIGlobalVariable(scope: null, file: !906, line: 16, type: !917, isLocal: true, isDefinition: true)
!922 = !DIGlobalVariableExpression(var: !923, expr: !DIExpression())
!923 = distinct !DIGlobalVariable(scope: null, file: !906, line: 17, type: !924, isLocal: true, isDefinition: true)
!924 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 80, elements: !925)
!925 = !{!926}
!926 = !DISubrange(count: 10)
!927 = !DIGlobalVariableExpression(var: !928, expr: !DIExpression())
!928 = distinct !DIGlobalVariable(scope: null, file: !906, line: 18, type: !907, isLocal: true, isDefinition: true)
!929 = !DIGlobalVariableExpression(var: !930, expr: !DIExpression())
!930 = distinct !DIGlobalVariable(scope: null, file: !906, line: 19, type: !931, isLocal: true, isDefinition: true)
!931 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 56, elements: !932)
!932 = !{!933}
!933 = !DISubrange(count: 7)
!934 = !DIGlobalVariableExpression(var: !935, expr: !DIExpression())
!935 = distinct !DIGlobalVariable(scope: null, file: !906, line: 20, type: !931, isLocal: true, isDefinition: true)
!936 = !DIGlobalVariableExpression(var: !937, expr: !DIExpression())
!937 = distinct !DIGlobalVariable(scope: null, file: !906, line: 21, type: !917, isLocal: true, isDefinition: true)
!938 = !DIGlobalVariableExpression(var: !939, expr: !DIExpression())
!939 = distinct !DIGlobalVariable(scope: null, file: !906, line: 22, type: !940, isLocal: true, isDefinition: true)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 64, elements: !199)
!941 = !DIGlobalVariableExpression(var: !942, expr: !DIExpression())
!942 = distinct !DIGlobalVariable(scope: null, file: !906, line: 23, type: !638, isLocal: true, isDefinition: true)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(scope: null, file: !906, line: 24, type: !924, isLocal: true, isDefinition: true)
!945 = !DIGlobalVariableExpression(var: !946, expr: !DIExpression())
!946 = distinct !DIGlobalVariable(scope: null, file: !906, line: 25, type: !947, isLocal: true, isDefinition: true)
!947 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 88, elements: !948)
!948 = !{!949}
!949 = !DISubrange(count: 11)
!950 = !DIGlobalVariableExpression(var: !951, expr: !DIExpression())
!951 = distinct !DIGlobalVariable(scope: null, file: !906, line: 26, type: !924, isLocal: true, isDefinition: true)
!952 = !DIGlobalVariableExpression(var: !953, expr: !DIExpression())
!953 = distinct !DIGlobalVariable(scope: null, file: !906, line: 27, type: !954, isLocal: true, isDefinition: true)
!954 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 168, elements: !955)
!955 = !{!956}
!956 = !DISubrange(count: 21)
!957 = !DIGlobalVariableExpression(var: !958, expr: !DIExpression())
!958 = distinct !DIGlobalVariable(scope: null, file: !906, line: 28, type: !959, isLocal: true, isDefinition: true)
!959 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 136, elements: !960)
!960 = !{!961}
!961 = !DISubrange(count: 17)
!962 = !DIGlobalVariableExpression(var: !963, expr: !DIExpression())
!963 = distinct !DIGlobalVariable(scope: null, file: !906, line: 29, type: !964, isLocal: true, isDefinition: true)
!964 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 176, elements: !965)
!965 = !{!966}
!966 = !DISubrange(count: 22)
!967 = !DIGlobalVariableExpression(var: !968, expr: !DIExpression())
!968 = distinct !DIGlobalVariable(scope: null, file: !906, line: 30, type: !917, isLocal: true, isDefinition: true)
!969 = !DIGlobalVariableExpression(var: !970, expr: !DIExpression())
!970 = distinct !DIGlobalVariable(scope: null, file: !906, line: 31, type: !947, isLocal: true, isDefinition: true)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !906, line: 32, type: !973, isLocal: true, isDefinition: true)
!973 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 72, elements: !689)
!974 = !DIGlobalVariableExpression(var: !975, expr: !DIExpression())
!975 = distinct !DIGlobalVariable(name: "UDP_PROTOCOLS", scope: !2, file: !906, line: 10, type: !976, isLocal: true, isDefinition: true)
!976 = !DICompositeType(tag: DW_TAG_array_type, baseType: !977, size: 2816, elements: !965)
!977 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !978)
!978 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PortMapping", file: !906, line: 5, size: 128, elements: !979)
!979 = !{!980, !981}
!980 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !978, file: !906, line: 6, baseType: !561, size: 64)
!981 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !978, file: !906, line: 7, baseType: !167, size: 32, offset: 64)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "____fmt", scope: !984, file: !3, line: 823, type: !993, isLocal: true, isDefinition: true)
!984 = distinct !DISubprogram(name: "__clone_redirect_packet", scope: !3, file: !3, line: 821, type: !985, scopeLine: 821, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !987)
!985 = !DISubroutineType(types: !986)
!986 = !{!78, !214, !71, !96}
!987 = !{!988, !989, !990, !991, !992}
!988 = !DILocalVariable(name: "skb", arg: 1, scope: !984, file: !3, line: 821, type: !214)
!989 = !DILocalVariable(name: "br_index", arg: 2, scope: !984, file: !3, line: 821, type: !71)
!990 = !DILocalVariable(name: "dest_addr_route", arg: 3, scope: !984, file: !3, line: 821, type: !96)
!991 = !DILocalVariable(name: "current_dest_addr", scope: !984, file: !3, line: 824, type: !96)
!992 = !DILocalVariable(name: "csum_diff_drop", scope: !984, file: !3, line: 831, type: !71)
!993 = !DICompositeType(tag: DW_TAG_array_type, baseType: !550, size: 432, elements: !994)
!994 = !{!995}
!995 = !DISubrange(count: 54)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(name: "____fmt", scope: !984, file: !3, line: 827, type: !583, isLocal: true, isDefinition: true)
!998 = !DIGlobalVariableExpression(var: !999, expr: !DIExpression())
!999 = distinct !DIGlobalVariable(name: "bpf_clone_redirect", scope: !2, file: !556, line: 357, type: !1000, isLocal: true, isDefinition: true)
!1000 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1001)
!1001 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1002, size: 64)
!1002 = !DISubroutineType(types: !1003)
!1003 = !{!113, !214, !71, !139}
!1004 = !DIGlobalVariableExpression(var: !1005, expr: !DIExpression())
!1005 = distinct !DIGlobalVariable(name: "____fmt", scope: !984, file: !3, line: 847, type: !993, isLocal: true, isDefinition: true)
!1006 = !{i32 7, !"Dwarf Version", i32 5}
!1007 = !{i32 2, !"Debug Info Version", i32 3}
!1008 = !{i32 1, !"wchar_size", i32 4}
!1009 = !{i32 7, !"frame-pointer", i32 2}
!1010 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!1011 = !{!"Ubuntu clang version 19.1.1 (1ubuntu1)"}
!1012 = distinct !DIAssignID()
!1013 = !DILocalVariable(name: "label_key_subdomain_per_label_min", scope: !1014, file: !3, line: 577, type: !71)
!1014 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 565, column: 26)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 565, column: 10)
!1016 = distinct !DILexicalBlock(scope: !1017, file: !3, line: 564, column: 23)
!1017 = distinct !DILexicalBlock(scope: !1018, file: !3, line: 564, column: 8)
!1018 = distinct !DISubprogram(name: "parse_dns_payload_memsafet_payload_transport_tcp", scope: !3, file: !3, line: 534, type: !356, scopeLine: 535, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1019)
!1019 = !{!1020, !1021, !1022, !1023, !1024, !1025, !1026, !1027, !1028, !1029, !1013, !1030, !1031, !1032, !1033, !1034, !1035, !1036, !1037, !1038, !1040, !1043, !1044, !1045, !1046, !1048, !1051, !1052, !1053}
!1020 = !DILocalVariable(name: "skb", arg: 1, scope: !1018, file: !3, line: 534, type: !322)
!1021 = !DILocalVariable(name: "dns_payload", arg: 2, scope: !1018, file: !3, line: 534, type: !59)
!1022 = !DILocalVariable(name: "dns_header", arg: 3, scope: !1018, file: !3, line: 535, type: !103)
!1023 = !DILocalVariable(name: "flags", scope: !1018, file: !3, line: 540, type: !822)
!1024 = !DILocalVariable(name: "qd_count", scope: !1018, file: !3, line: 550, type: !56)
!1025 = !DILocalVariable(name: "ans_count", scope: !1018, file: !3, line: 551, type: !56)
!1026 = !DILocalVariable(name: "auth_count", scope: !1018, file: !3, line: 552, type: !56)
!1027 = !DILocalVariable(name: "add_count", scope: !1018, file: !3, line: 553, type: !56)
!1028 = !DILocalVariable(name: "dns_payload_buffer", scope: !1018, file: !3, line: 556, type: !114)
!1029 = !DILocalVariable(name: "oc", scope: !1014, file: !3, line: 576, type: !167)
!1030 = !DILocalVariable(name: "label_key_subdomain_per_label_max", scope: !1014, file: !3, line: 577, type: !71)
!1031 = !DILocalVariable(name: "label_key_label_count_min", scope: !1014, file: !3, line: 578, type: !71)
!1032 = !DILocalVariable(name: "label_key_label_count_max", scope: !1014, file: !3, line: 578, type: !71)
!1033 = !DILocalVariable(name: "MIN_SUBDOMAIN_LENGTH_PER_LABEL_KERNEL_MAP", scope: !1014, file: !3, line: 580, type: !653)
!1034 = !DILocalVariable(name: "MAX_SUBDOMAIN_LENGTH_PER_LABEL_KERNEL_MAP", scope: !1014, file: !3, line: 581, type: !653)
!1035 = !DILocalVariable(name: "MIN_LABEL_COUNT_KERNEL_MAP", scope: !1014, file: !3, line: 582, type: !653)
!1036 = !DILocalVariable(name: "MAX_LABEL_COUNT_KERNEL_MAP", scope: !1014, file: !3, line: 583, type: !653)
