; ModuleID = 'dns_tc.c'
source_filename = "dns_tc.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.qtypes = type { i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.dns_record_limits_malicious = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.exfil_security_config_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_dns_limites = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egrees_redirect_ring_buff_non_standard_port = type { ptr, ptr }
%struct.exfil_security_egress_reconnisance_map_scan = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_protocols_identifier_maps = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redurect_ts_verify = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_loop_time = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_count_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_drop_count_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_vxlan_dns_transport = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_rate_limit_map = type { ptr, ptr, ptr, ptr }
%struct.kernel_handler_map = type { ptr, ptr, ptr, ptr, ptr }
%struct.in6_addr = type { %union.anon }
%union.anon = type { [4 x i32] }
%struct.exfil_raw_packet_mirror = type { i16, i16, i8, i8 }
%struct.dns_volume_stats = type { i64, i32 }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "qtypes", scope: !2, file: !44, line: 69, type: !369, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 19.1.1 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !55, globals: !162, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "dns_tc.c", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "a3eaeeb1a20e8c98ec0280dba7f13bb5")
!4 = !{!5, !39, !43, !49}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 29, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "9c2bb8c4aeb4064bd816bf98027ba7c1")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!9 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!10 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!11 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!12 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!13 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!14 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!15 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!16 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!17 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!18 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!19 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!20 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!21 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!22 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!23 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!24 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!25 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!26 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!27 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!28 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!29 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!30 = !DIEnumerator(name: "IPPROTO_L2TP", value: 115)
!31 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!32 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!33 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!34 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!35 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!36 = !DIEnumerator(name: "IPPROTO_SMC", value: 256)
!37 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!38 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 6050, baseType: !7, size: 32, elements: !41)
!40 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "eec04c95b9f59f758a8270a58c2ff5f6")
!41 = !{!42}
!42 = !DIEnumerator(name: "BPF_F_INGRESS", value: 1)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MALICIOUS_FLAGS", file: !44, line: 17, baseType: !7, size: 32, elements: !45)
!44 = !DIFile(filename: "./dns.h", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "5cfdbc692acc202e55e1b638d5f1dad9")
!45 = !{!46, !47, !48}
!46 = !DIEnumerator(name: "BENIGN", value: 0)
!47 = !DIEnumerator(name: "SUSPICIOUS", value: 1)
!48 = !DIEnumerator(name: "MALICIOUS", value: 2)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 1349, baseType: !7, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIEnumerator(name: "BPF_ANY", value: 0)
!52 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!53 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!54 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!55 = !{!56, !59, !60, !71, !72, !73, !103, !113, !114, !115, !116, !121, !131, !78, !139, !141}
!56 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !57, line: 24, baseType: !58)
!57 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!58 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_header", file: !44, line: 86, size: 96, elements: !62)
!62 = !{!63, !64, !65, !68, !69, !70}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "transaction_id", scope: !61, file: !44, line: 87, baseType: !56, size: 16)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !61, file: !44, line: 88, baseType: !56, size: 16, offset: 16)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "qd_count", scope: !61, file: !44, line: 90, baseType: !66, size: 16, offset: 32)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !67, line: 32, baseType: !56)
!67 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "bf9fbc0e8f60927fef9d8917535375a6")
!68 = !DIDerivedType(tag: DW_TAG_member, name: "ans_count", scope: !61, file: !44, line: 91, baseType: !66, size: 16, offset: 48)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "auth_count", scope: !61, file: !44, line: 92, baseType: !66, size: 16, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "add_count", scope: !61, file: !44, line: 93, baseType: !66, size: 16, offset: 80)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !57, line: 27, baseType: !7)
!72 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !75, line: 87, size: 160, elements: !76)
!75 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "149778ace30a1ff208adc8783fd04b29")
!76 = !{!77, !80, !81, !82, !83, !84, !85, !86, !87, !89}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !74, file: !75, line: 89, baseType: !78, size: 4, flags: DIFlagBitField, extraData: i64 0)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !57, line: 21, baseType: !79)
!79 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !74, file: !75, line: 90, baseType: !78, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !74, file: !75, line: 97, baseType: !78, size: 8, offset: 8)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !74, file: !75, line: 98, baseType: !66, size: 16, offset: 16)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !74, file: !75, line: 99, baseType: !66, size: 16, offset: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !74, file: !75, line: 100, baseType: !66, size: 16, offset: 48)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !74, file: !75, line: 101, baseType: !78, size: 8, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !74, file: !75, line: 102, baseType: !78, size: 8, offset: 72)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !74, file: !75, line: 103, baseType: !88, size: 16, offset: 80)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !67, line: 38, baseType: !56)
!89 = !DIDerivedType(tag: DW_TAG_member, scope: !74, file: !75, line: 104, baseType: !90, size: 64, offset: 96)
!90 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !74, file: !75, line: 104, size: 64, elements: !91)
!91 = !{!92, !98}
!92 = !DIDerivedType(tag: DW_TAG_member, scope: !90, file: !75, line: 104, baseType: !93, size: 64)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !75, line: 104, size: 64, elements: !94)
!94 = !{!95, !97}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !93, file: !75, line: 104, baseType: !96, size: 32)
!96 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !67, line: 34, baseType: !71)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !93, file: !75, line: 104, baseType: !96, size: 32, offset: 32)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !90, file: !75, line: 104, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !90, file: !75, line: 104, size: 64, elements: !100)
!100 = !{!101, !102}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !99, file: !75, line: 104, baseType: !96, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !99, file: !75, line: 104, baseType: !96, size: 32, offset: 32)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_header_tcp", file: !44, line: 96, size: 112, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !104, file: !44, line: 97, baseType: !56, size: 16)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "transaction_id", scope: !104, file: !44, line: 98, baseType: !56, size: 16, offset: 16)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !104, file: !44, line: 99, baseType: !56, size: 16, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "qd_count", scope: !104, file: !44, line: 100, baseType: !66, size: 16, offset: 48)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ans_count", scope: !104, file: !44, line: 101, baseType: !66, size: 16, offset: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "auth_count", scope: !104, file: !44, line: 102, baseType: !66, size: 16, offset: 80)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "add_count", scope: !104, file: !44, line: 103, baseType: !66, size: 16, offset: 96)
!113 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vxlanhdr", file: !3, line: 65, size: 64, elements: !118)
!118 = !{!119, !120}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "vx_flags", scope: !117, file: !3, line: 66, baseType: !96, size: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "vx_vni", scope: !117, file: !3, line: 67, baseType: !96, size: 32, offset: 32)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !123, line: 173, size: 112, elements: !124)
!123 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "163f54fb1af2e21fea410f14eb18fa76")
!124 = !{!125, !129, !130}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !122, file: !123, line: 174, baseType: !126, size: 48)
!126 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 48, elements: !127)
!127 = !{!128}
!128 = !DISubrange(count: 6)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !122, file: !123, line: 175, baseType: !126, size: 48, offset: 48)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !122, file: !123, line: 176, baseType: !66, size: 16, offset: 96)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !133, line: 23, size: 64, elements: !134)
!133 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "40b541977cf3a9ce2b2728b52f4091a4")
!134 = !{!135, !136, !137, !138}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !132, file: !133, line: 24, baseType: !66, size: 16)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !132, file: !133, line: 25, baseType: !66, size: 16, offset: 16)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !132, file: !133, line: 26, baseType: !66, size: 16, offset: 32)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !132, file: !133, line: 27, baseType: !88, size: 16, offset: 48)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !57, line: 31, baseType: !140)
!140 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !143, line: 25, size: 160, elements: !144)
!143 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "1aa35012f509549bad9f3decb5d3e7a2")
!144 = !{!145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !142, file: !143, line: 26, baseType: !66, size: 16)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !142, file: !143, line: 27, baseType: !66, size: 16, offset: 16)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !142, file: !143, line: 28, baseType: !96, size: 32, offset: 32)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !142, file: !143, line: 29, baseType: !96, size: 32, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !142, file: !143, line: 31, baseType: !56, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !142, file: !143, line: 32, baseType: !56, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !142, file: !143, line: 33, baseType: !56, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !142, file: !143, line: 34, baseType: !56, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !142, file: !143, line: 35, baseType: !56, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !142, file: !143, line: 36, baseType: !56, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !142, file: !143, line: 37, baseType: !56, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !142, file: !143, line: 38, baseType: !56, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !142, file: !143, line: 39, baseType: !56, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !142, file: !143, line: 40, baseType: !56, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !142, file: !143, line: 55, baseType: !66, size: 16, offset: 112)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !142, file: !143, line: 56, baseType: !88, size: 16, offset: 128)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !142, file: !143, line: 57, baseType: !66, size: 16, offset: 144)
!162 = !{!0, !163, !170, !182, !185, !205, !207, !209, !211, !562, !570, !578, !583, !589, !594, !604, !610, !616, !622, !627, !632, !634, !636, !638, !640, !642, !644, !649, !651, !666, !676, !690, !713, !721, !733, !746, !754, !762, !770, !778, !791, !800, !815, !850, !856, !862, !868, !874, !880, !907, !912, !916, !921, !923, !926, !928, !930, !935, !937, !942, !944, !946, !949, !951, !953, !958, !960, !965, !970, !975, !977, !979, !982, !990, !1001, !1007, !1012}
!163 = !DIGlobalVariableExpression(var: !164, expr: !DIExpression())
!164 = distinct !DIGlobalVariable(name: "valid_opcodes", scope: !2, file: !44, line: 107, type: !165, isLocal: false, isDefinition: true)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !166, size: 64, elements: !168)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !167)
!167 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!168 = !{!169}
!169 = !DISubrange(count: 2)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "DNS_RECORD_LIMITS", scope: !2, file: !44, line: 225, type: !172, isLocal: false, isDefinition: true)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_record_limits_malicious", file: !44, line: 209, size: 256, elements: !173)
!173 = !{!174, !175, !176, !177, !178, !179, !180, !181}
!174 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_DOMAIN_LENGTH", scope: !172, file: !44, line: 210, baseType: !71, size: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_DOMAIN_LENGTH", scope: !172, file: !44, line: 211, baseType: !71, size: 32, offset: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_SUBDOMAIN_LENGTH_PER_LABEL", scope: !172, file: !44, line: 214, baseType: !71, size: 32, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_SUBDOMAIN_LENGTH_PER_LABEL", scope: !172, file: !44, line: 215, baseType: !71, size: 32, offset: 96)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_LABEL_COUNT", scope: !172, file: !44, line: 218, baseType: !71, size: 32, offset: 128)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_LABEL_COUNT", scope: !172, file: !44, line: 219, baseType: !71, size: 32, offset: 160)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_SUBDOMAIN_LENGTH_EXCLUDING_TLD", scope: !172, file: !44, line: 222, baseType: !71, size: 32, offset: 192)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_SUBDOMAIN_LENGTH_EXCLUDING_TLD", scope: !172, file: !44, line: 223, baseType: !71, size: 32, offset: 224)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "redirect_skb_mark", scope: !2, file: !184, line: 68, type: !71, isLocal: false, isDefinition: true)
!184 = !DIFile(filename: "./consts.h", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "42ec6d9419410e4006cb63e2d23f1c83")
!185 = !DIGlobalVariableExpression(var: !186, expr: !DIExpression())
!186 = distinct !DIGlobalVariable(name: "bridge_redirect_addr_ipv6_suspicious", scope: !2, file: !184, line: 80, type: !187, isLocal: false, isDefinition: true)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !188, line: 33, size: 128, elements: !189)
!188 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "fca1889f0274df066e49cf4d8db8011e")
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !187, file: !188, line: 40, baseType: !191, size: 128)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !187, file: !188, line: 34, size: 128, elements: !192)
!192 = !{!193, !197, !201}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !191, file: !188, line: 35, baseType: !194, size: 128)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 128, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !191, file: !188, line: 37, baseType: !198, size: 128)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 128, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !191, file: !188, line: 38, baseType: !202, size: 128)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !96, size: 128, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 4)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "bridge_redirect_addr_ipv6_malicious", scope: !2, file: !184, line: 94, type: !187, isLocal: false, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "bridge_redirect_addr_ipv6_malicious_tunnel", scope: !2, file: !184, line: 108, type: !187, isLocal: false, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "INSECURE", scope: !2, file: !3, line: 106, type: !71, isLocal: false, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "____fmt", scope: !213, file: !3, line: 1391, type: !557, isLocal: true, isDefinition: true)
!213 = distinct !DISubprogram(name: "classify", scope: !3, file: !3, line: 1306, type: !214, scopeLine: 1306, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !309)
!214 = !DISubroutineType(types: !215)
!215 = !{!167, !216}
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !40, line: 6229, size: 1536, elements: !218)
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !235, !236, !237, !238, !239, !240, !241, !242, !243, !245, !246, !247, !248, !249, !281, !282, !283, !284, !306, !307, !308}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !217, file: !40, line: 6230, baseType: !71, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !217, file: !40, line: 6231, baseType: !71, size: 32, offset: 32)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !217, file: !40, line: 6232, baseType: !71, size: 32, offset: 64)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !217, file: !40, line: 6233, baseType: !71, size: 32, offset: 96)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !217, file: !40, line: 6234, baseType: !71, size: 32, offset: 128)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !217, file: !40, line: 6235, baseType: !71, size: 32, offset: 160)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !217, file: !40, line: 6236, baseType: !71, size: 32, offset: 192)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !217, file: !40, line: 6237, baseType: !71, size: 32, offset: 224)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !217, file: !40, line: 6238, baseType: !71, size: 32, offset: 256)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !217, file: !40, line: 6239, baseType: !71, size: 32, offset: 288)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !217, file: !40, line: 6240, baseType: !71, size: 32, offset: 320)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !217, file: !40, line: 6241, baseType: !71, size: 32, offset: 352)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !217, file: !40, line: 6242, baseType: !232, size: 160, offset: 384)
!232 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 160, elements: !233)
!233 = !{!234}
!234 = !DISubrange(count: 5)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !217, file: !40, line: 6243, baseType: !71, size: 32, offset: 544)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !217, file: !40, line: 6244, baseType: !71, size: 32, offset: 576)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !217, file: !40, line: 6245, baseType: !71, size: 32, offset: 608)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !217, file: !40, line: 6246, baseType: !71, size: 32, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !217, file: !40, line: 6247, baseType: !71, size: 32, offset: 672)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !217, file: !40, line: 6250, baseType: !71, size: 32, offset: 704)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !217, file: !40, line: 6251, baseType: !71, size: 32, offset: 736)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !217, file: !40, line: 6252, baseType: !71, size: 32, offset: 768)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !217, file: !40, line: 6253, baseType: !244, size: 128, offset: 800)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 128, elements: !203)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !217, file: !40, line: 6254, baseType: !244, size: 128, offset: 928)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !217, file: !40, line: 6255, baseType: !71, size: 32, offset: 1056)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !217, file: !40, line: 6256, baseType: !71, size: 32, offset: 1088)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !217, file: !40, line: 6259, baseType: !71, size: 32, offset: 1120)
!249 = !DIDerivedType(tag: DW_TAG_member, scope: !217, file: !40, line: 6260, baseType: !250, size: 64, align: 64, offset: 1152)
!250 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !217, file: !40, line: 6260, size: 64, align: 64, elements: !251)
!251 = !{!252}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !250, file: !40, line: 6260, baseType: !253, size: 64)
!253 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !254, size: 64)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !40, line: 7271, size: 448, elements: !255)
!255 = !{!256, !257, !258, !259, !260, !261, !262, !263, !264, !265, !266, !279, !280}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !254, file: !40, line: 7272, baseType: !56, size: 16)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !254, file: !40, line: 7273, baseType: !56, size: 16, offset: 16)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !254, file: !40, line: 7274, baseType: !56, size: 16, offset: 32)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !254, file: !40, line: 7275, baseType: !78, size: 8, offset: 48)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !254, file: !40, line: 7276, baseType: !78, size: 8, offset: 56)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !254, file: !40, line: 7277, baseType: !78, size: 8, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !254, file: !40, line: 7278, baseType: !78, size: 8, offset: 72)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !254, file: !40, line: 7279, baseType: !66, size: 16, offset: 80)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !254, file: !40, line: 7280, baseType: !66, size: 16, offset: 96)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !254, file: !40, line: 7281, baseType: !66, size: 16, offset: 112)
!266 = !DIDerivedType(tag: DW_TAG_member, scope: !254, file: !40, line: 7282, baseType: !267, size: 256, offset: 128)
!267 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !254, file: !40, line: 7282, size: 256, elements: !268)
!268 = !{!269, !274}
!269 = !DIDerivedType(tag: DW_TAG_member, scope: !267, file: !40, line: 7283, baseType: !270, size: 64)
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !267, file: !40, line: 7283, size: 64, elements: !271)
!271 = !{!272, !273}
!272 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !270, file: !40, line: 7284, baseType: !96, size: 32)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !270, file: !40, line: 7285, baseType: !96, size: 32, offset: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, scope: !267, file: !40, line: 7287, baseType: !275, size: 256)
!275 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !267, file: !40, line: 7287, size: 256, elements: !276)
!276 = !{!277, !278}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !275, file: !40, line: 7288, baseType: !244, size: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !275, file: !40, line: 7289, baseType: !244, size: 128, offset: 128)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !254, file: !40, line: 7292, baseType: !71, size: 32, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !254, file: !40, line: 7293, baseType: !96, size: 32, offset: 416)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !217, file: !40, line: 6261, baseType: !139, size: 64, offset: 1216)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !217, file: !40, line: 6262, baseType: !71, size: 32, offset: 1280)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !217, file: !40, line: 6263, baseType: !71, size: 32, offset: 1312)
!284 = !DIDerivedType(tag: DW_TAG_member, scope: !217, file: !40, line: 6264, baseType: !285, size: 64, align: 64, offset: 1344)
!285 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !217, file: !40, line: 6264, size: 64, align: 64, elements: !286)
!286 = !{!287}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !285, file: !40, line: 6264, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !289, size: 64)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !40, line: 6333, size: 640, elements: !290)
!290 = !{!291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !289, file: !40, line: 6334, baseType: !71, size: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !289, file: !40, line: 6335, baseType: !71, size: 32, offset: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !289, file: !40, line: 6336, baseType: !71, size: 32, offset: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !289, file: !40, line: 6337, baseType: !71, size: 32, offset: 96)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !289, file: !40, line: 6338, baseType: !71, size: 32, offset: 128)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !289, file: !40, line: 6339, baseType: !71, size: 32, offset: 160)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !289, file: !40, line: 6341, baseType: !71, size: 32, offset: 192)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !289, file: !40, line: 6342, baseType: !244, size: 128, offset: 224)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !289, file: !40, line: 6343, baseType: !71, size: 32, offset: 352)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !289, file: !40, line: 6344, baseType: !66, size: 16, offset: 384)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !289, file: !40, line: 6346, baseType: !71, size: 32, offset: 416)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !289, file: !40, line: 6347, baseType: !244, size: 128, offset: 448)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !289, file: !40, line: 6348, baseType: !71, size: 32, offset: 576)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !289, file: !40, line: 6349, baseType: !305, size: 32, offset: 608)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !57, line: 26, baseType: !167)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !217, file: !40, line: 6265, baseType: !71, size: 32, offset: 1408)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp_type", scope: !217, file: !40, line: 6266, baseType: !78, size: 8, offset: 1440)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "hwtstamp", scope: !217, file: !40, line: 6268, baseType: !139, size: 64, offset: 1472)
!309 = !{!310, !311, !321, !393, !394, !395, !422, !423, !424, !425, !426, !434, !435, !440, !441, !442, !443, !446, !447, !448, !455, !456, !457, !458, !459, !467, !468, !471, !475, !476, !477, !483, !484, !487, !490, !491, !492, !493, !494, !495, !496, !497, !498, !499, !502, !506, !507, !508, !509, !510, !511, !514, !515, !520, !521, !522, !523, !526, !527, !528, !529, !530, !533, !534, !535, !536, !537, !538, !541, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554}
!310 = !DILocalVariable(name: "skb", arg: 1, scope: !213, file: !3, line: 1306, type: !216)
!311 = !DILocalVariable(name: "cursor", scope: !213, file: !3, line: 1308, type: !312)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "skb_cursor", file: !3, line: 59, size: 192, elements: !313)
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !312, file: !3, line: 60, baseType: !59, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !312, file: !3, line: 61, baseType: !59, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !312, file: !3, line: 62, baseType: !317, size: 64, offset: 128)
!317 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !318, size: 64)
!318 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_spin_lock", file: !40, line: 7311, size: 32, elements: !319)
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !318, file: !40, line: 7312, baseType: !71, size: 32)
!321 = !DILocalVariable(name: "actions", scope: !213, file: !3, line: 1309, type: !322)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_actions", file: !3, line: 75, size: 960, elements: !323)
!323 = !{!324, !330, !334, !338, !339, !340, !344, !345, !349, !353, !357, !361, !365, !385, !389}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_init", scope: !322, file: !3, line: 76, baseType: !325, size: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !326, size: 64)
!326 = !DISubroutineType(types: !327)
!327 = !{!328, !329, !216}
!328 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "packet_class_action", scope: !322, file: !3, line: 77, baseType: !331, size: 64, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!332 = !DISubroutineType(types: !333)
!333 = !{!322, !322}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "parse_eth", scope: !322, file: !3, line: 79, baseType: !335, size: 64, offset: 128)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64)
!336 = !DISubroutineType(types: !337)
!337 = !{!78, !329}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "parse_ipv4", scope: !322, file: !3, line: 81, baseType: !335, size: 64, offset: 192)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "parse_ipv6", scope: !322, file: !3, line: 82, baseType: !335, size: 64, offset: 256)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "parse_udp", scope: !322, file: !3, line: 84, baseType: !341, size: 64, offset: 320)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DISubroutineType(types: !343)
!343 = !{!78, !329, !328}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "parse_tcp", scope: !322, file: !3, line: 85, baseType: !341, size: 64, offset: 384)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_header_size", scope: !322, file: !3, line: 91, baseType: !346, size: 64, offset: 448)
!346 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !347, size: 64)
!347 = !DISubroutineType(types: !348)
!348 = !{!78, !329, !328, !328}
!349 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_transport_udp", scope: !322, file: !3, line: 92, baseType: !350, size: 64, offset: 512)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = !DISubroutineType(types: !352)
!352 = !{!78, !329, !59, !71, !71, !60, !71}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_transport_tcp", scope: !322, file: !3, line: 93, baseType: !354, size: 64, offset: 576)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64)
!355 = !DISubroutineType(types: !356)
!356 = !{!78, !329, !59, !103, !71}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_memsafet_payload", scope: !322, file: !3, line: 95, baseType: !358, size: 64, offset: 640)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!78, !329, !59, !60}
!361 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_memsafet_payload_transport_tcp", scope: !322, file: !3, line: 96, baseType: !362, size: 64, offset: 704)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64)
!363 = !DISubroutineType(types: !364)
!364 = !{!78, !329, !59, !103}
!365 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_queries_section", scope: !322, file: !3, line: 99, baseType: !366, size: 64, offset: 768)
!366 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !367, size: 64)
!367 = !DISubroutineType(types: !368)
!368 = !{!78, !329, !56, !369}
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qtypes", file: !44, line: 66, size: 112, elements: !370)
!370 = !{!371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !369, file: !44, line: 67, baseType: !78, size: 8)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "NS", scope: !369, file: !44, line: 67, baseType: !78, size: 8, offset: 8)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "CNAME", scope: !369, file: !44, line: 67, baseType: !78, size: 8, offset: 16)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "SOA", scope: !369, file: !44, line: 67, baseType: !78, size: 8, offset: 24)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "PTR", scope: !369, file: !44, line: 67, baseType: !78, size: 8, offset: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "MX", scope: !369, file: !44, line: 67, baseType: !78, size: 8, offset: 40)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "TXT", scope: !369, file: !44, line: 67, baseType: !78, size: 8, offset: 48)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "AAAA", scope: !369, file: !44, line: 67, baseType: !78, size: 8, offset: 56)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "SRV", scope: !369, file: !44, line: 67, baseType: !78, size: 8, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "NAPTR", scope: !369, file: !44, line: 67, baseType: !78, size: 8, offset: 72)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "OPT", scope: !369, file: !44, line: 67, baseType: !78, size: 8, offset: 80)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "HTTPS", scope: !369, file: !44, line: 68, baseType: !78, size: 8, offset: 88)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "ANY", scope: !369, file: !44, line: 68, baseType: !78, size: 8, offset: 96)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "NULL_TYPE", scope: !369, file: !44, line: 68, baseType: !78, size: 8, offset: 104)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_non_standard_port", scope: !322, file: !3, line: 102, baseType: !386, size: 64, offset: 832)
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DISubroutineType(types: !388)
!388 = !{!78, !329, !216, !59, !60}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_non_standard_port_tcp", scope: !322, file: !3, line: 103, baseType: !390, size: 64, offset: 896)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !391, size: 64)
!391 = !DISubroutineType(types: !392)
!392 = !{!78, !329, !216, !59, !103}
!393 = !DILocalVariable(name: "eth", scope: !213, file: !3, line: 1314, type: !121)
!394 = !DILocalVariable(name: "ip", scope: !213, file: !3, line: 1315, type: !73)
!395 = !DILocalVariable(name: "ipv6", scope: !213, file: !3, line: 1316, type: !396)
!396 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !397, size: 64)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !398, line: 118, size: 320, elements: !399)
!398 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "d288e308e142e51c48e7422f4fbbaa3f")
!399 = !{!400, !401, !402, !406, !407, !408, !409}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !397, file: !398, line: 120, baseType: !78, size: 4, flags: DIFlagBitField, extraData: i64 0)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !397, file: !398, line: 121, baseType: !78, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !397, file: !398, line: 128, baseType: !403, size: 24, offset: 8)
!403 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 24, elements: !404)
!404 = !{!405}
!405 = !DISubrange(count: 3)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !397, file: !398, line: 130, baseType: !66, size: 16, offset: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !397, file: !398, line: 131, baseType: !78, size: 8, offset: 48)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !397, file: !398, line: 132, baseType: !78, size: 8, offset: 56)
!409 = !DIDerivedType(tag: DW_TAG_member, scope: !397, file: !398, line: 134, baseType: !410, size: 256, offset: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !397, file: !398, line: 134, size: 256, elements: !411)
!411 = !{!412, !417}
!412 = !DIDerivedType(tag: DW_TAG_member, scope: !410, file: !398, line: 134, baseType: !413, size: 256)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !398, line: 134, size: 256, elements: !414)
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !413, file: !398, line: 134, baseType: !187, size: 128)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !413, file: !398, line: 134, baseType: !187, size: 128, offset: 128)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !410, file: !398, line: 134, baseType: !418, size: 256)
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !410, file: !398, line: 134, size: 256, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !418, file: !398, line: 134, baseType: !187, size: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !418, file: !398, line: 134, baseType: !187, size: 128, offset: 128)
!422 = !DILocalVariable(name: "nhoff", scope: !213, file: !3, line: 1322, type: !71)
!423 = !DILocalVariable(name: "udp", scope: !213, file: !3, line: 1333, type: !131)
!424 = !DILocalVariable(name: "tcp", scope: !213, file: !3, line: 1333, type: !141)
!425 = !DILocalVariable(name: "hproto", scope: !213, file: !3, line: 1335, type: !66)
!426 = !DILocalVariable(name: "vlan", scope: !427, file: !3, line: 1338, type: !429)
!427 = distinct !DILexicalBlock(scope: !428, file: !3, line: 1337, column: 92)
!428 = distinct !DILexicalBlock(scope: !213, file: !3, line: 1337, column: 9)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !430, size: 64)
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !3, line: 70, size: 32, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !430, file: !3, line: 71, baseType: !66, size: 16)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !430, file: !3, line: 72, baseType: !66, size: 16, offset: 16)
!434 = !DILocalVariable(name: "isEncapL2", scope: !213, file: !3, line: 1350, type: !328)
!435 = !DILocalVariable(name: "udp_data", scope: !436, file: !3, line: 1363, type: !59)
!436 = distinct !DILexicalBlock(scope: !437, file: !3, line: 1359, column: 42)
!437 = distinct !DILexicalBlock(scope: !438, file: !3, line: 1359, column: 13)
!438 = distinct !DILexicalBlock(scope: !439, file: !3, line: 1352, column: 40)
!439 = distinct !DILexicalBlock(scope: !213, file: !3, line: 1352, column: 9)
!440 = !DILocalVariable(name: "total_offset", scope: !436, file: !3, line: 1366, type: !71)
!441 = !DILocalVariable(name: "udp_payload_len", scope: !436, file: !3, line: 1368, type: !71)
!442 = !DILocalVariable(name: "udp_payload_exclude_header", scope: !436, file: !3, line: 1369, type: !71)
!443 = !DILocalVariable(name: "dns_payload", scope: !444, file: !3, line: 1377, type: !59)
!444 = distinct !DILexicalBlock(scope: !445, file: !3, line: 1372, column: 58)
!445 = distinct !DILexicalBlock(scope: !436, file: !3, line: 1372, column: 17)
!446 = !DILocalVariable(name: "dns", scope: !444, file: !3, line: 1379, type: !60)
!447 = !DILocalVariable(name: "parse_flag", scope: !444, file: !3, line: 1386, type: !78)
!448 = !DILocalVariable(name: "result", scope: !444, file: !3, line: 1388, type: !449)
!449 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "result_parse_dns_labels", file: !184, line: 153, size: 32, elements: !450)
!450 = !{!451, !452, !453, !454}
!451 = !DIDerivedType(tag: DW_TAG_member, name: "deep_scan_mirror", scope: !449, file: !184, line: 154, baseType: !328, size: 8)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !449, file: !184, line: 155, baseType: !328, size: 8, offset: 8)
!453 = !DIDerivedType(tag: DW_TAG_member, name: "isBenign", scope: !449, file: !184, line: 156, baseType: !328, size: 8, offset: 16)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "isC2c", scope: !449, file: !184, line: 157, baseType: !328, size: 8, offset: 24)
!455 = !DILocalVariable(name: "current_dest_addr", scope: !444, file: !3, line: 1394, type: !96)
!456 = !DILocalVariable(name: "dest_addr_route", scope: !444, file: !3, line: 1395, type: !96)
!457 = !DILocalVariable(name: "dest_addr_route_malicious", scope: !444, file: !3, line: 1396, type: !96)
!458 = !DILocalVariable(name: "out", scope: !444, file: !3, line: 1398, type: !71)
!459 = !DILocalVariable(name: "config", scope: !444, file: !3, line: 1400, type: !460)
!460 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !461, size: 64)
!461 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_kernel_config", file: !184, line: 27, size: 128, elements: !462)
!462 = !{!463, !464, !465, !466}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "BridgeIndexId", scope: !461, file: !184, line: 28, baseType: !71, size: 32)
!464 = !DIDerivedType(tag: DW_TAG_member, name: "NfNdpBridgeIndexId", scope: !461, file: !184, line: 29, baseType: !71, size: 32, offset: 32)
!465 = !DIDerivedType(tag: DW_TAG_member, name: "RedirectIpv4", scope: !461, file: !184, line: 30, baseType: !96, size: 32, offset: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "NfNdpBridgeRedirectIpv4", scope: !461, file: !184, line: 31, baseType: !96, size: 32, offset: 96)
!467 = !DILocalVariable(name: "br_index", scope: !444, file: !3, line: 1401, type: !71)
!468 = !DILocalVariable(name: "redirect_address_from_config", scope: !469, file: !3, line: 1404, type: !96)
!469 = distinct !DILexicalBlock(scope: !470, file: !3, line: 1403, column: 29)
!470 = distinct !DILexicalBlock(scope: !444, file: !3, line: 1403, column: 21)
!471 = !DILocalVariable(name: "csum_diff_drop", scope: !472, file: !3, line: 1434, type: !71)
!472 = distinct !DILexicalBlock(scope: !473, file: !3, line: 1423, column: 38)
!473 = distinct !DILexicalBlock(scope: !474, file: !3, line: 1423, column: 26)
!474 = distinct !DILexicalBlock(scope: !444, file: !3, line: 1415, column: 21)
!475 = !DILocalVariable(name: "transaction_id", scope: !444, file: !3, line: 1457, type: !56)
!476 = !DILocalVariable(name: "ip_checksum", scope: !444, file: !3, line: 1458, type: !56)
!477 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !444, file: !3, line: 1459, type: !478)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !479, size: 64)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "checkSum_redirect_struct_value", file: !3, line: 137, size: 128, elements: !480)
!480 = !{!481, !482}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !479, file: !3, line: 138, baseType: !56, size: 16)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_timets", scope: !479, file: !3, line: 139, baseType: !139, size: 64, offset: 64)
!483 = !DILocalVariable(name: "csum_diff", scope: !444, file: !3, line: 1485, type: !71)
!484 = !DILocalVariable(name: "tcp_data", scope: !485, file: !3, line: 1527, type: !59)
!485 = distinct !DILexicalBlock(scope: !486, file: !3, line: 1522, column: 48)
!486 = distinct !DILexicalBlock(scope: !437, file: !3, line: 1522, column: 19)
!487 = !DILocalVariable(name: "dns_payload", scope: !488, file: !3, line: 1532, type: !59)
!488 = distinct !DILexicalBlock(scope: !489, file: !3, line: 1530, column: 58)
!489 = distinct !DILexicalBlock(scope: !485, file: !3, line: 1530, column: 17)
!490 = !DILocalVariable(name: "dns", scope: !488, file: !3, line: 1534, type: !103)
!491 = !DILocalVariable(name: "parse_flag", scope: !488, file: !3, line: 1542, type: !78)
!492 = !DILocalVariable(name: "result", scope: !488, file: !3, line: 1544, type: !449)
!493 = !DILocalVariable(name: "current_dest_addr", scope: !488, file: !3, line: 1547, type: !96)
!494 = !DILocalVariable(name: "dest_addr_route", scope: !488, file: !3, line: 1548, type: !96)
!495 = !DILocalVariable(name: "dest_addr_route_malicious", scope: !488, file: !3, line: 1549, type: !96)
!496 = !DILocalVariable(name: "out", scope: !488, file: !3, line: 1551, type: !71)
!497 = !DILocalVariable(name: "config", scope: !488, file: !3, line: 1552, type: !460)
!498 = !DILocalVariable(name: "br_index", scope: !488, file: !3, line: 1553, type: !71)
!499 = !DILocalVariable(name: "redirect_address_from_config", scope: !500, file: !3, line: 1556, type: !96)
!500 = distinct !DILexicalBlock(scope: !501, file: !3, line: 1555, column: 29)
!501 = distinct !DILexicalBlock(scope: !488, file: !3, line: 1555, column: 21)
!502 = !DILocalVariable(name: "br_index", scope: !503, file: !3, line: 1571, type: !71)
!503 = distinct !DILexicalBlock(scope: !504, file: !3, line: 1569, column: 39)
!504 = distinct !DILexicalBlock(scope: !505, file: !3, line: 1569, column: 26)
!505 = distinct !DILexicalBlock(scope: !488, file: !3, line: 1567, column: 21)
!506 = !DILocalVariable(name: "config", scope: !503, file: !3, line: 1572, type: !460)
!507 = !DILocalVariable(name: "csum_diff_drop", scope: !503, file: !3, line: 1580, type: !71)
!508 = !DILocalVariable(name: "transaction_id", scope: !488, file: !3, line: 1604, type: !71)
!509 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !488, file: !3, line: 1606, type: !478)
!510 = !DILocalVariable(name: "tcp_payload_len", scope: !488, file: !3, line: 1626, type: !71)
!511 = !DILocalVariable(name: "dns_rate_limit_action", scope: !512, file: !3, line: 1628, type: !78)
!512 = distinct !DILexicalBlock(scope: !513, file: !3, line: 1627, column: 46)
!513 = distinct !DILexicalBlock(scope: !488, file: !3, line: 1627, column: 21)
!514 = !DILocalVariable(name: "csum_diff", scope: !488, file: !3, line: 1641, type: !71)
!515 = !DILocalVariable(name: "udp_data", scope: !516, file: !3, line: 1680, type: !59)
!516 = distinct !DILexicalBlock(scope: !517, file: !3, line: 1675, column: 43)
!517 = distinct !DILexicalBlock(scope: !518, file: !3, line: 1675, column: 13)
!518 = distinct !DILexicalBlock(scope: !519, file: !3, line: 1670, column: 51)
!519 = distinct !DILexicalBlock(scope: !439, file: !3, line: 1670, column: 12)
!520 = !DILocalVariable(name: "total_offset", scope: !516, file: !3, line: 1683, type: !71)
!521 = !DILocalVariable(name: "udp_payload_len", scope: !516, file: !3, line: 1685, type: !71)
!522 = !DILocalVariable(name: "udp_payload_exclude_header", scope: !516, file: !3, line: 1686, type: !71)
!523 = !DILocalVariable(name: "dns_payload", scope: !524, file: !3, line: 1692, type: !59)
!524 = distinct !DILexicalBlock(scope: !525, file: !3, line: 1688, column: 58)
!525 = distinct !DILexicalBlock(scope: !516, file: !3, line: 1688, column: 17)
!526 = !DILocalVariable(name: "dns", scope: !524, file: !3, line: 1694, type: !60)
!527 = !DILocalVariable(name: "parse_flag", scope: !524, file: !3, line: 1701, type: !78)
!528 = !DILocalVariable(name: "result", scope: !524, file: !3, line: 1703, type: !449)
!529 = !DILocalVariable(name: "dns_payload_size", scope: !524, file: !3, line: 1706, type: !56)
!530 = !DILocalVariable(name: "dns_rate_limit_action", scope: !531, file: !3, line: 1708, type: !78)
!531 = distinct !DILexicalBlock(scope: !532, file: !3, line: 1707, column: 46)
!532 = distinct !DILexicalBlock(scope: !524, file: !3, line: 1707, column: 21)
!533 = !DILocalVariable(name: "out", scope: !524, file: !3, line: 1714, type: !71)
!534 = !DILocalVariable(name: "config", scope: !524, file: !3, line: 1716, type: !460)
!535 = !DILocalVariable(name: "br_index", scope: !524, file: !3, line: 1717, type: !71)
!536 = !DILocalVariable(name: "transaction_id", scope: !524, file: !3, line: 1751, type: !56)
!537 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !524, file: !3, line: 1753, type: !478)
!538 = !DILocalVariable(name: "tcp_data", scope: !539, file: !3, line: 1798, type: !59)
!539 = distinct !DILexicalBlock(scope: !540, file: !3, line: 1793, column: 49)
!540 = distinct !DILexicalBlock(scope: !517, file: !3, line: 1793, column: 19)
!541 = !DILocalVariable(name: "dns", scope: !542, file: !3, line: 1803, type: !103)
!542 = distinct !DILexicalBlock(scope: !543, file: !3, line: 1801, column: 58)
!543 = distinct !DILexicalBlock(scope: !539, file: !3, line: 1801, column: 17)
!544 = !DILocalVariable(name: "dns_payload", scope: !542, file: !3, line: 1806, type: !59)
!545 = !DILocalVariable(name: "parse_flag", scope: !542, file: !3, line: 1814, type: !78)
!546 = !DILocalVariable(name: "result", scope: !542, file: !3, line: 1816, type: !449)
!547 = !DILocalVariable(name: "skb_ifIndex", scope: !542, file: !3, line: 1818, type: !71)
!548 = !DILocalVariable(name: "out", scope: !542, file: !3, line: 1821, type: !71)
!549 = !DILocalVariable(name: "config", scope: !542, file: !3, line: 1823, type: !460)
!550 = !DILocalVariable(name: "br_index", scope: !542, file: !3, line: 1824, type: !71)
!551 = !DILocalVariable(name: "transaction_id", scope: !542, file: !3, line: 1843, type: !56)
!552 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !542, file: !3, line: 1845, type: !478)
!553 = !DILocalVariable(name: "tcp_payload_len", scope: !542, file: !3, line: 1866, type: !71)
!554 = !DILocalVariable(name: "dns_rate_limit_action", scope: !555, file: !3, line: 1868, type: !78)
!555 = distinct !DILexicalBlock(scope: !556, file: !3, line: 1867, column: 46)
!556 = distinct !DILexicalBlock(scope: !542, file: !3, line: 1867, column: 21)
!557 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 624, elements: !560)
!558 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !559)
!559 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!560 = !{!561}
!561 = !DISubrange(count: 78)
!562 = !DIGlobalVariableExpression(var: !563, expr: !DIExpression())
!563 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !564, line: 177, type: !565, isLocal: true, isDefinition: true)
!564 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "", checksumkind: CSK_MD5, checksum: "65e4dc8e3121f91a5c2c9eb8563c5692")
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DISubroutineType(types: !568)
!568 = !{!113, !569, !71, null}
!569 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!570 = !DIGlobalVariableExpression(var: !571, expr: !DIExpression())
!571 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !564, line: 56, type: !572, isLocal: true, isDefinition: true)
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!59, !59, !576}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !577, size: 64)
!577 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!578 = !DIGlobalVariableExpression(var: !579, expr: !DIExpression())
!579 = distinct !DIGlobalVariable(name: "____fmt", scope: !213, file: !3, line: 1410, type: !580, isLocal: true, isDefinition: true)
!580 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 464, elements: !581)
!581 = !{!582}
!582 = !DISubrange(count: 58)
!583 = !DIGlobalVariableExpression(var: !584, expr: !DIExpression())
!584 = distinct !DIGlobalVariable(name: "bpf_skb_load_bytes", scope: !2, file: !564, line: 719, type: !585, isLocal: true, isDefinition: true)
!585 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !586)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64)
!587 = !DISubroutineType(types: !588)
!588 = !{!113, !576, !71, !59, !71}
!589 = !DIGlobalVariableExpression(var: !590, expr: !DIExpression())
!590 = distinct !DIGlobalVariable(name: "____fmt", scope: !213, file: !3, line: 1431, type: !591, isLocal: true, isDefinition: true)
!591 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 512, elements: !592)
!592 = !{!593}
!593 = !DISubrange(count: 64)
!594 = !DIGlobalVariableExpression(var: !595, expr: !DIExpression())
!595 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !564, line: 796, type: !596, isLocal: true, isDefinition: true)
!596 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !597)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DISubroutineType(types: !599)
!599 = !{!600, !602, !71, !602, !71, !603}
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !57, line: 30, baseType: !601)
!601 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!602 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!603 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !67, line: 39, baseType: !71)
!604 = !DIGlobalVariableExpression(var: !605, expr: !DIExpression())
!605 = distinct !DIGlobalVariable(name: "bpf_l3_csum_replace", scope: !2, file: !564, line: 256, type: !606, isLocal: true, isDefinition: true)
!606 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !607)
!607 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!608 = !DISubroutineType(types: !609)
!609 = !{!113, !216, !71, !139, !139, !139}
!610 = !DIGlobalVariableExpression(var: !611, expr: !DIExpression())
!611 = distinct !DIGlobalVariable(name: "bpf_skb_store_bytes", scope: !2, file: !564, line: 227, type: !612, isLocal: true, isDefinition: true)
!612 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !613)
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !614, size: 64)
!614 = !DISubroutineType(types: !615)
!615 = !{!113, !216, !71, !576, !71, !139}
!616 = !DIGlobalVariableExpression(var: !617, expr: !DIExpression())
!617 = distinct !DIGlobalVariable(name: "bpf_redirect", scope: !2, file: !564, line: 621, type: !618, isLocal: true, isDefinition: true)
!618 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !619)
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DISubroutineType(types: !621)
!621 = !{!113, !71, !139}
!622 = !DIGlobalVariableExpression(var: !623, expr: !DIExpression())
!623 = distinct !DIGlobalVariable(name: "____fmt", scope: !213, file: !3, line: 1464, type: !624, isLocal: true, isDefinition: true)
!624 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 1344, elements: !625)
!625 = !{!626}
!626 = !DISubrange(count: 168)
!627 = !DIGlobalVariableExpression(var: !628, expr: !DIExpression())
!628 = distinct !DIGlobalVariable(name: "____fmt", scope: !213, file: !3, line: 1562, type: !629, isLocal: true, isDefinition: true)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 672, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 84)
!632 = !DIGlobalVariableExpression(var: !633, expr: !DIExpression())
!633 = distinct !DIGlobalVariable(name: "____fmt", scope: !213, file: !3, line: 1576, type: !591, isLocal: true, isDefinition: true)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "____fmt", scope: !213, file: !3, line: 1611, type: !624, isLocal: true, isDefinition: true)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "____fmt", scope: !213, file: !3, line: 1722, type: !580, isLocal: true, isDefinition: true)
!638 = !DIGlobalVariableExpression(var: !639, expr: !DIExpression())
!639 = distinct !DIGlobalVariable(name: "____fmt", scope: !213, file: !3, line: 1758, type: !624, isLocal: true, isDefinition: true)
!640 = !DIGlobalVariableExpression(var: !641, expr: !DIExpression())
!641 = distinct !DIGlobalVariable(name: "____fmt", scope: !213, file: !3, line: 1829, type: !580, isLocal: true, isDefinition: true)
!642 = !DIGlobalVariableExpression(var: !643, expr: !DIExpression())
!643 = distinct !DIGlobalVariable(name: "____fmt", scope: !213, file: !3, line: 1850, type: !624, isLocal: true, isDefinition: true)
!644 = !DIGlobalVariableExpression(var: !645, expr: !DIExpression())
!645 = distinct !DIGlobalVariable(name: "__license", scope: !2, file: !3, line: 1893, type: !646, isLocal: false, isDefinition: true)
!646 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 104, elements: !647)
!647 = !{!648}
!648 = !DISubrange(count: 13)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "flags", scope: !2, file: !44, line: 21, type: !43, isLocal: false, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "exfil_security_config_map", scope: !2, file: !184, line: 39, type: !653, isLocal: false, isDefinition: true)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_config_map", file: !184, line: 34, size: 256, elements: !654)
!654 = !{!655, !660, !662, !663}
!655 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !653, file: !184, line: 35, baseType: !656, size: 64)
!656 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !657, size: 64)
!657 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 32, elements: !658)
!658 = !{!659}
!659 = !DISubrange(count: 1)
!660 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !653, file: !184, line: 36, baseType: !661, size: 64, offset: 64)
!661 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !653, file: !184, line: 37, baseType: !460, size: 64, offset: 128)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !653, file: !184, line: 38, baseType: !664, size: 64, offset: 192)
!664 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !665, size: 64)
!665 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 2048, elements: !592)
!666 = !DIGlobalVariableExpression(var: !667, expr: !DIExpression())
!667 = distinct !DIGlobalVariable(name: "exfil_security_egress_dns_limites", scope: !2, file: !184, line: 51, type: !668, isLocal: false, isDefinition: true)
!668 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_dns_limites", file: !184, line: 46, size: 256, elements: !669)
!669 = !{!670, !671, !672, !673}
!670 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !668, file: !184, line: 47, baseType: !656, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !668, file: !184, line: 48, baseType: !661, size: 64, offset: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !668, file: !184, line: 49, baseType: !661, size: 64, offset: 128)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !668, file: !184, line: 50, baseType: !674, size: 64, offset: 192)
!674 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !675, size: 64)
!675 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 512, elements: !195)
!676 = !DIGlobalVariableExpression(var: !677, expr: !DIExpression())
!677 = distinct !DIGlobalVariable(name: "exfil_security_egrees_redirect_ring_buff_non_standard_port", scope: !2, file: !3, line: 115, type: !678, isLocal: false, isDefinition: true)
!678 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egrees_redirect_ring_buff_non_standard_port", file: !3, line: 112, size: 128, elements: !679)
!679 = !{!680, !685}
!680 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !678, file: !3, line: 113, baseType: !681, size: 64)
!681 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !682, size: 64)
!682 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 864, elements: !683)
!683 = !{!684}
!684 = !DISubrange(count: 27)
!685 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !678, file: !3, line: 114, baseType: !686, size: 64, offset: 64)
!686 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !687, size: 64)
!687 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 536870912, elements: !688)
!688 = !{!689}
!689 = !DISubrange(count: 16777216)
!690 = !DIGlobalVariableExpression(var: !691, expr: !DIExpression())
!691 = distinct !DIGlobalVariable(name: "exfil_security_egress_reconnisance_map_scan", scope: !2, file: !3, line: 133, type: !692, isLocal: false, isDefinition: true)
!692 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_reconnisance_map_scan", file: !3, line: 128, size: 256, elements: !693)
!693 = !{!694, !699, !700, !708}
!694 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !692, file: !3, line: 129, baseType: !695, size: 64)
!695 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !696, size: 64)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 288, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 9)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !692, file: !3, line: 130, baseType: !115, size: 64, offset: 64)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !692, file: !3, line: 131, baseType: !701, size: 64, offset: 128)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_raw_packet_mirror", file: !3, line: 119, size: 48, elements: !703)
!703 = !{!704, !705, !706, !707}
!704 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !702, file: !3, line: 120, baseType: !56, size: 16)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !702, file: !3, line: 121, baseType: !56, size: 16, offset: 16)
!706 = !DIDerivedType(tag: DW_TAG_member, name: "isUdp", scope: !702, file: !3, line: 122, baseType: !78, size: 8, offset: 32)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "isPacketRescanedAndMalicious", scope: !702, file: !3, line: 123, baseType: !78, size: 8, offset: 40)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !692, file: !3, line: 132, baseType: !709, size: 64, offset: 192)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 2097152, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 65536)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_map", scope: !2, file: !3, line: 148, type: !715, isLocal: false, isDefinition: true)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_map", file: !3, line: 143, size: 256, elements: !716)
!716 = !{!717, !718, !719, !720}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !715, file: !3, line: 144, baseType: !695, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !715, file: !3, line: 145, baseType: !115, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !715, file: !3, line: 146, baseType: !478, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !715, file: !3, line: 147, baseType: !686, size: 64, offset: 192)
!721 = !DIGlobalVariableExpression(var: !722, expr: !DIExpression())
!722 = distinct !DIGlobalVariable(name: "exfil_security_protocols_identifier_maps", scope: !2, file: !3, line: 158, type: !723, isLocal: false, isDefinition: true)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_protocols_identifier_maps", file: !3, line: 153, size: 256, elements: !724)
!724 = !{!725, !728, !729, !730}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !723, file: !3, line: 154, baseType: !726, size: 64)
!726 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !727, size: 64)
!727 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 64, elements: !168)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !723, file: !3, line: 155, baseType: !661, size: 64, offset: 64)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !723, file: !3, line: 156, baseType: !115, size: 64, offset: 128)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !723, file: !3, line: 157, baseType: !731, size: 64, offset: 192)
!731 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !732, size: 64)
!732 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 160, elements: !233)
!733 = !DIGlobalVariableExpression(var: !734, expr: !DIExpression())
!734 = distinct !DIGlobalVariable(name: "exfil_security_egress_redurect_ts_verify", scope: !2, file: !3, line: 165, type: !735, isLocal: false, isDefinition: true)
!735 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redurect_ts_verify", file: !3, line: 160, size: 256, elements: !736)
!736 = !{!737, !738, !740, !741}
!737 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !735, file: !3, line: 161, baseType: !695, size: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !735, file: !3, line: 162, baseType: !739, size: 64, offset: 64)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !735, file: !3, line: 163, baseType: !114, size: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !735, file: !3, line: 164, baseType: !742, size: 64, offset: 192)
!742 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !743, size: 64)
!743 = !DICompositeType(tag: DW_TAG_array_type, baseType: !167, size: 1048576, elements: !744)
!744 = !{!745}
!745 = !DISubrange(count: 32768)
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_loop_time", scope: !2, file: !3, line: 176, type: !748, isLocal: false, isDefinition: true)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_loop_time", file: !3, line: 171, size: 256, elements: !749)
!749 = !{!750, !751, !752, !753}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !748, file: !3, line: 172, baseType: !695, size: 64)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !748, file: !3, line: 173, baseType: !661, size: 64, offset: 64)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !748, file: !3, line: 174, baseType: !739, size: 64, offset: 128)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !748, file: !3, line: 175, baseType: !742, size: 64, offset: 192)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_count_map", scope: !2, file: !3, line: 184, type: !756, isLocal: false, isDefinition: true)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_count_map", file: !3, line: 179, size: 256, elements: !757)
!757 = !{!758, !759, !760, !761}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !756, file: !3, line: 180, baseType: !695, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !756, file: !3, line: 181, baseType: !115, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !756, file: !3, line: 182, baseType: !661, size: 64, offset: 128)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !756, file: !3, line: 183, baseType: !656, size: 64, offset: 192)
!762 = !DIGlobalVariableExpression(var: !763, expr: !DIExpression())
!763 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_drop_count_map", scope: !2, file: !3, line: 192, type: !764, isLocal: false, isDefinition: true)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_drop_count_map", file: !3, line: 187, size: 256, elements: !765)
!765 = !{!766, !767, !768, !769}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !764, file: !3, line: 188, baseType: !695, size: 64)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !764, file: !3, line: 189, baseType: !115, size: 64, offset: 64)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !764, file: !3, line: 190, baseType: !661, size: 64, offset: 128)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !764, file: !3, line: 191, baseType: !656, size: 64, offset: 192)
!770 = !DIGlobalVariableExpression(var: !771, expr: !DIExpression())
!771 = distinct !DIGlobalVariable(name: "exfil_security_egress_vxlan_dns_transport", scope: !2, file: !3, line: 199, type: !772, isLocal: false, isDefinition: true)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_vxlan_dns_transport", file: !3, line: 194, size: 256, elements: !773)
!773 = !{!774, !775, !776, !777}
!774 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !772, file: !3, line: 195, baseType: !695, size: 64)
!775 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !772, file: !3, line: 196, baseType: !114, size: 64, offset: 64)
!776 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !772, file: !3, line: 197, baseType: !661, size: 64, offset: 128)
!777 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !772, file: !3, line: 198, baseType: !656, size: 64, offset: 192)
!778 = !DIGlobalVariableExpression(var: !779, expr: !DIExpression())
!779 = distinct !DIGlobalVariable(name: "exfil_security_egress_rate_limit_map", scope: !2, file: !3, line: 216, type: !780, isLocal: false, isDefinition: true)
!780 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_rate_limit_map", file: !3, line: 211, size: 256, elements: !781)
!781 = !{!782, !783, !784, !790}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !780, file: !3, line: 212, baseType: !695, size: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !780, file: !3, line: 213, baseType: !115, size: 64, offset: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !780, file: !3, line: 214, baseType: !785, size: 64, offset: 128)
!785 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !786, size: 64)
!786 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_volume_stats", file: !3, line: 203, size: 128, elements: !787)
!787 = !{!788, !789}
!788 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !786, file: !3, line: 204, baseType: !139, size: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "packet_size", scope: !786, file: !3, line: 205, baseType: !71, size: 32, offset: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !780, file: !3, line: 215, baseType: !656, size: 64, offset: 192)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "maps", scope: !2, file: !3, line: 1283, type: !793, isLocal: false, isDefinition: true)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_handler_map", file: !3, line: 1277, size: 320, elements: !794)
!794 = !{!795, !796, !797, !798, !799}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !793, file: !3, line: 1278, baseType: !656, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !793, file: !3, line: 1279, baseType: !686, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !793, file: !3, line: 1280, baseType: !114, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !793, file: !3, line: 1281, baseType: !115, size: 64, offset: 192)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !793, file: !3, line: 1282, baseType: !656, size: 64, offset: 256)
!800 = !DIGlobalVariableExpression(var: !801, expr: !DIExpression())
!801 = distinct !DIGlobalVariable(name: "____fmt", scope: !802, file: !3, line: 268, type: !812, isLocal: true, isDefinition: true)
!802 = distinct !DISubprogram(name: "process_udp_payload_mem_verification", scope: !3, file: !3, line: 250, type: !803, scopeLine: 250, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !805)
!803 = !DISubroutineType(types: !804)
!804 = !{!78, !131, !329, !328}
!805 = !{!806, !807, !808, !809, !810, !811}
!806 = !DILocalVariable(name: "udp", arg: 1, scope: !802, file: !3, line: 250, type: !131)
!807 = !DILocalVariable(name: "skb", arg: 2, scope: !802, file: !3, line: 250, type: !329)
!808 = !DILocalVariable(name: "isIPv4", arg: 3, scope: !802, file: !3, line: 250, type: !328)
!809 = !DILocalVariable(name: "udp_len", scope: !802, file: !3, line: 251, type: !56)
!810 = !DILocalVariable(name: "udp_len_payload", scope: !802, file: !3, line: 252, type: !56)
!811 = !DILocalVariable(name: "udp_data", scope: !802, file: !3, line: 255, type: !59)
!812 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 288, elements: !813)
!813 = !{!814}
!814 = !DISubrange(count: 36)
!815 = !DIGlobalVariableExpression(var: !816, expr: !DIExpression())
!816 = distinct !DIGlobalVariable(name: "____fmt", scope: !817, file: !3, line: 722, type: !580, isLocal: true, isDefinition: true)
!817 = distinct !DISubprogram(name: "parse_dns_payload_non_standard_port", scope: !3, file: !3, line: 704, type: !387, scopeLine: 705, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !818)
!818 = !{!819, !820, !821, !822, !823, !826, !827, !828, !829, !842, !843, !844, !845, !846, !849}
!819 = !DILocalVariable(name: "skb", arg: 1, scope: !817, file: !3, line: 704, type: !329)
!820 = !DILocalVariable(name: "raw_skb", arg: 2, scope: !817, file: !3, line: 704, type: !216)
!821 = !DILocalVariable(name: "dns_payload", arg: 3, scope: !817, file: !3, line: 704, type: !59)
!822 = !DILocalVariable(name: "dns_header", arg: 4, scope: !817, file: !3, line: 705, type: !60)
!823 = !DILocalVariable(name: "br_index", scope: !824, file: !3, line: 710, type: !71)
!824 = distinct !DILexicalBlock(scope: !825, file: !3, line: 709, column: 76)
!825 = distinct !DILexicalBlock(scope: !817, file: !3, line: 709, column: 9)
!826 = !DILocalVariable(name: "out", scope: !824, file: !3, line: 711, type: !71)
!827 = !DILocalVariable(name: "dest_addr_route", scope: !824, file: !3, line: 712, type: !96)
!828 = !DILocalVariable(name: "config", scope: !824, file: !3, line: 715, type: !460)
!829 = !DILocalVariable(name: "flags", scope: !817, file: !3, line: 729, type: !830)
!830 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_flags", file: !44, line: 53, size: 80, elements: !831)
!831 = !{!832, !833, !834, !835, !836, !837, !838, !839, !840, !841}
!832 = !DIDerivedType(tag: DW_TAG_member, name: "qr", scope: !830, file: !44, line: 54, baseType: !78, size: 8)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "opcode", scope: !830, file: !44, line: 55, baseType: !78, size: 8, offset: 8)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "aa", scope: !830, file: !44, line: 56, baseType: !78, size: 8, offset: 16)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "tc", scope: !830, file: !44, line: 57, baseType: !78, size: 8, offset: 24)
!836 = !DIDerivedType(tag: DW_TAG_member, name: "rd", scope: !830, file: !44, line: 58, baseType: !78, size: 8, offset: 32)
!837 = !DIDerivedType(tag: DW_TAG_member, name: "ra", scope: !830, file: !44, line: 59, baseType: !78, size: 8, offset: 40)
!838 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !830, file: !44, line: 60, baseType: !78, size: 8, offset: 48)
!839 = !DIDerivedType(tag: DW_TAG_member, name: "ad", scope: !830, file: !44, line: 61, baseType: !78, size: 8, offset: 56)
!840 = !DIDerivedType(tag: DW_TAG_member, name: "cd", scope: !830, file: !44, line: 62, baseType: !78, size: 8, offset: 64)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "rcode", scope: !830, file: !44, line: 63, baseType: !78, size: 8, offset: 72)
!842 = !DILocalVariable(name: "qd_count", scope: !817, file: !3, line: 733, type: !56)
!843 = !DILocalVariable(name: "ans_count", scope: !817, file: !3, line: 734, type: !56)
!844 = !DILocalVariable(name: "auth_count", scope: !817, file: !3, line: 735, type: !56)
!845 = !DILocalVariable(name: "add_count", scope: !817, file: !3, line: 736, type: !56)
!846 = !DILocalVariable(name: "raw_dns_flags", scope: !847, file: !3, line: 750, type: !56)
!847 = distinct !DILexicalBlock(scope: !848, file: !3, line: 744, column: 25)
!848 = distinct !DILexicalBlock(scope: !817, file: !3, line: 744, column: 9)
!849 = !DILocalVariable(name: "dns_header_flags", scope: !847, file: !3, line: 757, type: !830)
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !564, line: 78, type: !852, isLocal: true, isDefinition: true)
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!113, !59, !576, !576, !139}
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !564, line: 114, type: !858, isLocal: true, isDefinition: true)
!858 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!139}
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !564, line: 88, type: !864, isLocal: true, isDefinition: true)
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!113, !59, !576}
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "bpf_ringbuf_reserve", scope: !2, file: !564, line: 3176, type: !870, isLocal: true, isDefinition: true)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!59, !59, !139, !139}
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "bpf_ringbuf_submit", scope: !2, file: !564, line: 3194, type: !876, isLocal: true, isDefinition: true)
!876 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !59, !139}
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "____fmt", scope: !882, file: !3, line: 874, type: !580, isLocal: true, isDefinition: true)
!882 = distinct !DISubprogram(name: "__process_packet_clone_redirection_non_standard_port", scope: !3, file: !3, line: 859, type: !883, scopeLine: 859, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !885)
!883 = !DISubroutineType(types: !884)
!884 = !{!78, !216, !328, !56, !56}
!885 = !{!886, !887, !888, !889, !890, !891, !892, !893, !894, !895, !896, !900, !901, !902, !905}
!886 = !DILocalVariable(name: "skb", arg: 1, scope: !882, file: !3, line: 859, type: !216)
!887 = !DILocalVariable(name: "isUdp", arg: 2, scope: !882, file: !3, line: 859, type: !328)
!888 = !DILocalVariable(name: "__transport_dest_port", arg: 3, scope: !882, file: !3, line: 859, type: !56)
!889 = !DILocalVariable(name: "__transport_src_port", arg: 4, scope: !882, file: !3, line: 859, type: !56)
!890 = !DILocalVariable(name: "br_index", scope: !882, file: !3, line: 862, type: !71)
!891 = !DILocalVariable(name: "out", scope: !882, file: !3, line: 863, type: !71)
!892 = !DILocalVariable(name: "dest_addr_route", scope: !882, file: !3, line: 864, type: !96)
!893 = !DILocalVariable(name: "config", scope: !882, file: !3, line: 867, type: !460)
!894 = !DILocalVariable(name: "MAX_PROTOCOL_SIZE", scope: !882, file: !3, line: 879, type: !167)
!895 = !DILocalVariable(name: "isTunnelC2CStandardUdpTransport", scope: !882, file: !3, line: 881, type: !328)
!896 = !DILocalVariable(name: "i", scope: !897, file: !3, line: 884, type: !167)
!897 = distinct !DILexicalBlock(scope: !898, file: !3, line: 884, column: 9)
!898 = distinct !DILexicalBlock(scope: !899, file: !3, line: 882, column: 16)
!899 = distinct !DILexicalBlock(scope: !882, file: !3, line: 882, column: 9)
!900 = !DILocalVariable(name: "udp_dst_transfer_key", scope: !882, file: !3, line: 892, type: !56)
!901 = !DILocalVariable(name: "raw_pack", scope: !882, file: !3, line: 893, type: !701)
!902 = !DILocalVariable(name: "pack", scope: !903, file: !3, line: 895, type: !702)
!903 = distinct !DILexicalBlock(scope: !904, file: !3, line: 894, column: 19)
!904 = distinct !DILexicalBlock(scope: !882, file: !3, line: 894, column: 9)
!905 = !DILocalVariable(name: "re_scanned_packed_and_malicious", scope: !906, file: !3, line: 918, type: !78)
!906 = distinct !DILexicalBlock(scope: !904, file: !3, line: 916, column: 11)
!907 = !DIGlobalVariableExpression(var: !908, expr: !DIExpression())
!908 = distinct !DIGlobalVariable(name: "____fmt", scope: !882, file: !3, line: 903, type: !909, isLocal: true, isDefinition: true)
!909 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 576, elements: !910)
!910 = !{!911}
!911 = !DISubrange(count: 72)
!912 = !DIGlobalVariableExpression(var: !913, expr: !DIExpression())
!913 = distinct !DIGlobalVariable(scope: null, file: !914, line: 15, type: !915, isLocal: true, isDefinition: true)
!914 = !DIFile(filename: "./raw_proc.h", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "2deca2f9240177b4eba5c462d1899a90")
!915 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 32, elements: !203)
!916 = !DIGlobalVariableExpression(var: !917, expr: !DIExpression())
!917 = distinct !DIGlobalVariable(scope: null, file: !914, line: 16, type: !918, isLocal: true, isDefinition: true)
!918 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 96, elements: !919)
!919 = !{!920}
!920 = !DISubrange(count: 12)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(scope: null, file: !914, line: 17, type: !918, isLocal: true, isDefinition: true)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(scope: null, file: !914, line: 18, type: !925, isLocal: true, isDefinition: true)
!925 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 40, elements: !233)
!926 = !DIGlobalVariableExpression(var: !927, expr: !DIExpression())
!927 = distinct !DIGlobalVariable(scope: null, file: !914, line: 19, type: !915, isLocal: true, isDefinition: true)
!928 = !DIGlobalVariableExpression(var: !929, expr: !DIExpression())
!929 = distinct !DIGlobalVariable(scope: null, file: !914, line: 20, type: !925, isLocal: true, isDefinition: true)
!930 = !DIGlobalVariableExpression(var: !931, expr: !DIExpression())
!931 = distinct !DIGlobalVariable(scope: null, file: !914, line: 21, type: !932, isLocal: true, isDefinition: true)
!932 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 80, elements: !933)
!933 = !{!934}
!934 = !DISubrange(count: 10)
!935 = !DIGlobalVariableExpression(var: !936, expr: !DIExpression())
!936 = distinct !DIGlobalVariable(scope: null, file: !914, line: 22, type: !915, isLocal: true, isDefinition: true)
!937 = !DIGlobalVariableExpression(var: !938, expr: !DIExpression())
!938 = distinct !DIGlobalVariable(scope: null, file: !914, line: 23, type: !939, isLocal: true, isDefinition: true)
!939 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 56, elements: !940)
!940 = !{!941}
!941 = !DISubrange(count: 7)
!942 = !DIGlobalVariableExpression(var: !943, expr: !DIExpression())
!943 = distinct !DIGlobalVariable(scope: null, file: !914, line: 24, type: !939, isLocal: true, isDefinition: true)
!944 = !DIGlobalVariableExpression(var: !945, expr: !DIExpression())
!945 = distinct !DIGlobalVariable(scope: null, file: !914, line: 25, type: !925, isLocal: true, isDefinition: true)
!946 = !DIGlobalVariableExpression(var: !947, expr: !DIExpression())
!947 = distinct !DIGlobalVariable(scope: null, file: !914, line: 26, type: !948, isLocal: true, isDefinition: true)
!948 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 64, elements: !199)
!949 = !DIGlobalVariableExpression(var: !950, expr: !DIExpression())
!950 = distinct !DIGlobalVariable(scope: null, file: !914, line: 27, type: !646, isLocal: true, isDefinition: true)
!951 = !DIGlobalVariableExpression(var: !952, expr: !DIExpression())
!952 = distinct !DIGlobalVariable(scope: null, file: !914, line: 28, type: !932, isLocal: true, isDefinition: true)
!953 = !DIGlobalVariableExpression(var: !954, expr: !DIExpression())
!954 = distinct !DIGlobalVariable(scope: null, file: !914, line: 29, type: !955, isLocal: true, isDefinition: true)
!955 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 88, elements: !956)
!956 = !{!957}
!957 = !DISubrange(count: 11)
!958 = !DIGlobalVariableExpression(var: !959, expr: !DIExpression())
!959 = distinct !DIGlobalVariable(scope: null, file: !914, line: 30, type: !932, isLocal: true, isDefinition: true)
!960 = !DIGlobalVariableExpression(var: !961, expr: !DIExpression())
!961 = distinct !DIGlobalVariable(scope: null, file: !914, line: 32, type: !962, isLocal: true, isDefinition: true)
!962 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 168, elements: !963)
!963 = !{!964}
!964 = !DISubrange(count: 21)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(scope: null, file: !914, line: 33, type: !967, isLocal: true, isDefinition: true)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 136, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 17)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(scope: null, file: !914, line: 35, type: !972, isLocal: true, isDefinition: true)
!972 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 176, elements: !973)
!973 = !{!974}
!974 = !DISubrange(count: 22)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !914, line: 36, type: !925, isLocal: true, isDefinition: true)
!977 = !DIGlobalVariableExpression(var: !978, expr: !DIExpression())
!978 = distinct !DIGlobalVariable(scope: null, file: !914, line: 37, type: !955, isLocal: true, isDefinition: true)
!979 = !DIGlobalVariableExpression(var: !980, expr: !DIExpression())
!980 = distinct !DIGlobalVariable(scope: null, file: !914, line: 38, type: !981, isLocal: true, isDefinition: true)
!981 = !DICompositeType(tag: DW_TAG_array_type, baseType: !559, size: 72, elements: !697)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(name: "UDP_PROTOCOLS", scope: !2, file: !914, line: 14, type: !984, isLocal: true, isDefinition: true)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !985, size: 2816, elements: !973)
!985 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !986)
!986 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PortMapping", file: !914, line: 9, size: 128, elements: !987)
!987 = !{!988, !989}
!988 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !986, file: !914, line: 10, baseType: !569, size: 64)
!989 = !DIDerivedType(tag: DW_TAG_member, name: "port", scope: !986, file: !914, line: 11, baseType: !167, size: 32, offset: 64)
!990 = !DIGlobalVariableExpression(var: !991, expr: !DIExpression())
!991 = distinct !DIGlobalVariable(name: "____fmt", scope: !992, file: !3, line: 829, type: !591, isLocal: true, isDefinition: true)
!992 = distinct !DISubprogram(name: "__clone_redirect_packet", scope: !3, file: !3, line: 824, type: !993, scopeLine: 824, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !995)
!993 = !DISubroutineType(types: !994)
!994 = !{!78, !216, !71, !96}
!995 = !{!996, !997, !998, !999, !1000}
!996 = !DILocalVariable(name: "skb", arg: 1, scope: !992, file: !3, line: 824, type: !216)
!997 = !DILocalVariable(name: "br_index", arg: 2, scope: !992, file: !3, line: 824, type: !71)
!998 = !DILocalVariable(name: "dest_addr_route", arg: 3, scope: !992, file: !3, line: 824, type: !96)
!999 = !DILocalVariable(name: "current_dest_addr", scope: !992, file: !3, line: 826, type: !96)
!1000 = !DILocalVariable(name: "csum_diff_drop", scope: !992, file: !3, line: 833, type: !71)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(name: "bpf_clone_redirect", scope: !2, file: !564, line: 357, type: !1003, isLocal: true, isDefinition: true)
!1003 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1004)
!1004 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1005, size: 64)
!1005 = !DISubroutineType(types: !1006)
!1006 = !{!113, !216, !71, !139}
!1007 = !DIGlobalVariableExpression(var: !1008, expr: !DIExpression())
!1008 = distinct !DIGlobalVariable(name: "____fmt", scope: !992, file: !3, line: 849, type: !1009, isLocal: true, isDefinition: true)
!1009 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 432, elements: !1010)
!1010 = !{!1011}
!1011 = !DISubrange(count: 54)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(name: "____fmt", scope: !1014, file: !3, line: 1147, type: !1027, isLocal: true, isDefinition: true)
!1014 = distinct !DISubprogram(name: "__dns_rate_limit", scope: !3, file: !3, line: 1116, type: !1015, scopeLine: 1116, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1017)
!1015 = !DISubroutineType(types: !1016)
!1016 = !{!78, !329, !216, !71}
!1017 = !{!1018, !1019, !1020, !1021, !1022, !1023, !1024}
!1018 = !DILocalVariable(name: "cursor", arg: 1, scope: !1014, file: !3, line: 1116, type: !329)
!1019 = !DILocalVariable(name: "skb", arg: 2, scope: !1014, file: !3, line: 1116, type: !216)
!1020 = !DILocalVariable(name: "dns_payload_size", arg: 3, scope: !1014, file: !3, line: 1116, type: !71)
!1021 = !DILocalVariable(name: "key", scope: !1014, file: !3, line: 1118, type: !56)
!1022 = !DILocalVariable(name: "ts", scope: !1014, file: !3, line: 1119, type: !139)
!1023 = !DILocalVariable(name: "dns_volume_stats", scope: !1014, file: !3, line: 1122, type: !785)
!1024 = !DILocalVariable(name: "stats", scope: !1025, file: !3, line: 1124, type: !786)
!1025 = distinct !DILexicalBlock(scope: !1026, file: !3, line: 1123, column: 28)
!1026 = distinct !DILexicalBlock(scope: !1014, file: !3, line: 1123, column: 9)
!1027 = !DICompositeType(tag: DW_TAG_array_type, baseType: !558, size: 416, elements: !1028)
!1028 = !{!1029}
!1029 = !DISubrange(count: 52)
!1030 = !{i32 7, !"Dwarf Version", i32 5}
!1031 = !{i32 2, !"Debug Info Version", i32 3}
!1032 = !{i32 1, !"wchar_size", i32 4}
!1033 = !{i32 7, !"frame-pointer", i32 2}
!1034 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!1035 = !{!"Ubuntu clang version 19.1.1 (1ubuntu1)"}
!1036 = distinct !DISubprogram(name: "configure_global_ipv6_route_handlers", scope: !184, file: !184, line: 124, type: !1037, scopeLine: 124, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1040)
!1037 = !DISubroutineType(types: !1038)
!1038 = !{!1039}
!1039 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !187, size: 64)
!1040 = !{!1041}
!1041 = !DILocalVariable(name: "inet_addr", scope: !1036, file: !184, line: 125, type: !1042)
