; ModuleID = 'dns_tc.c'
source_filename = "dns_tc.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.qtypes = type { i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.dns_record_limits_malicious = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.exfil_security_config_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_dns_limites = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egrees_redirect_ring_buff_non_standard_port = type { ptr, ptr }
%struct.exfil_vxlan_block_egress_port = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_vxlan_encap_drop = type { ptr, ptr }
%struct.exfil_security_egress_reconnisance_map_scan = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_protocols_identifier_maps = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redurect_ts_verify = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_loop_time = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_count_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_drop_count_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_vxlan_dns_transport = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_rate_limit_map = type { ptr, ptr, ptr, ptr }
%struct.kernel_handler_map = type { ptr, ptr, ptr, ptr, ptr }
%struct.inet6_bridge_address = type { [2 x %struct.in6_addr] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "qtypes", scope: !2, file: !44, line: 68, type: !402, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 19.1.1 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !61, globals: !213, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "dns_tc.c", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "8720c3691a8bd7909951cfb6e5741ba5")
!4 = !{!5, !39, !43, !49, !55}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 29, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "9c2bb8c4aeb4064bd816bf98027ba7c1")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!9 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!10 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!11 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!12 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!13 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!14 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!15 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!16 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!17 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!18 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!19 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!20 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!21 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!22 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!23 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!24 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!25 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!26 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!27 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!28 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!29 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!30 = !DIEnumerator(name: "IPPROTO_L2TP", value: 115)
!31 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!32 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!33 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!34 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!35 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!36 = !DIEnumerator(name: "IPPROTO_SMC", value: 256)
!37 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!38 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 6050, baseType: !7, size: 32, elements: !41)
!40 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "eec04c95b9f59f758a8270a58c2ff5f6")
!41 = !{!42}
!42 = !DIEnumerator(name: "BPF_F_INGRESS", value: 1)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MALICIOUS_FLAGS", file: !44, line: 16, baseType: !7, size: 32, elements: !45)
!44 = !DIFile(filename: "./dns.h", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "2a4b57adcb6cfe87ed7cef4fb98009e6")
!45 = !{!46, !47, !48}
!46 = !DIEnumerator(name: "BENIGN", value: 0)
!47 = !DIEnumerator(name: "SUSPICIOUS", value: 1)
!48 = !DIEnumerator(name: "MALICIOUS", value: 2)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 1349, baseType: !7, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIEnumerator(name: "BPF_ANY", value: 0)
!52 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!53 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!54 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 6156, baseType: !7, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60}
!57 = !DIEnumerator(name: "BPF_RB_AVAIL_DATA", value: 0)
!58 = !DIEnumerator(name: "BPF_RB_RING_SIZE", value: 1)
!59 = !DIEnumerator(name: "BPF_RB_CONS_POS", value: 2)
!60 = !DIEnumerator(name: "BPF_RB_PROD_POS", value: 3)
!61 = !{!62, !65, !66, !77, !78, !79, !109, !119, !120, !121, !122, !84, !130, !136, !146, !167, !211}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !63, line: 24, baseType: !64)
!63 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!64 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_header", file: !44, line: 85, size: 96, elements: !68)
!68 = !{!69, !70, !71, !74, !75, !76}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "transaction_id", scope: !67, file: !44, line: 86, baseType: !62, size: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !67, file: !44, line: 87, baseType: !62, size: 16, offset: 16)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "qd_count", scope: !67, file: !44, line: 89, baseType: !72, size: 16, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !73, line: 32, baseType: !62)
!73 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "bf9fbc0e8f60927fef9d8917535375a6")
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ans_count", scope: !67, file: !44, line: 90, baseType: !72, size: 16, offset: 48)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "auth_count", scope: !67, file: !44, line: 91, baseType: !72, size: 16, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "add_count", scope: !67, file: !44, line: 92, baseType: !72, size: 16, offset: 80)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !63, line: 27, baseType: !7)
!78 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !81, line: 87, size: 160, elements: !82)
!81 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "149778ace30a1ff208adc8783fd04b29")
!82 = !{!83, !86, !87, !88, !89, !90, !91, !92, !93, !95}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !80, file: !81, line: 89, baseType: !84, size: 4, flags: DIFlagBitField, extraData: i64 0)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !63, line: 21, baseType: !85)
!85 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !80, file: !81, line: 90, baseType: !84, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !80, file: !81, line: 97, baseType: !84, size: 8, offset: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !80, file: !81, line: 98, baseType: !72, size: 16, offset: 16)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !80, file: !81, line: 99, baseType: !72, size: 16, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !80, file: !81, line: 100, baseType: !72, size: 16, offset: 48)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !80, file: !81, line: 101, baseType: !84, size: 8, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !80, file: !81, line: 102, baseType: !84, size: 8, offset: 72)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !80, file: !81, line: 103, baseType: !94, size: 16, offset: 80)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !73, line: 38, baseType: !62)
!95 = !DIDerivedType(tag: DW_TAG_member, scope: !80, file: !81, line: 104, baseType: !96, size: 64, offset: 96)
!96 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !80, file: !81, line: 104, size: 64, elements: !97)
!97 = !{!98, !104}
!98 = !DIDerivedType(tag: DW_TAG_member, scope: !96, file: !81, line: 104, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !81, line: 104, size: 64, elements: !100)
!100 = !{!101, !103}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !99, file: !81, line: 104, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !73, line: 34, baseType: !77)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !99, file: !81, line: 104, baseType: !102, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !96, file: !81, line: 104, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !81, line: 104, size: 64, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !105, file: !81, line: 104, baseType: !102, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !105, file: !81, line: 104, baseType: !102, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_header_tcp", file: !44, line: 95, size: 112, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117, !118}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !110, file: !44, line: 96, baseType: !62, size: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "transaction_id", scope: !110, file: !44, line: 97, baseType: !62, size: 16, offset: 16)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !110, file: !44, line: 98, baseType: !62, size: 16, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "qd_count", scope: !110, file: !44, line: 99, baseType: !72, size: 16, offset: 48)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ans_count", scope: !110, file: !44, line: 100, baseType: !72, size: 16, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "auth_count", scope: !110, file: !44, line: 101, baseType: !72, size: 16, offset: 80)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "add_count", scope: !110, file: !44, line: 102, baseType: !72, size: 16, offset: 96)
!119 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !124, line: 23, size: 64, elements: !125)
!124 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "40b541977cf3a9ce2b2728b52f4091a4")
!125 = !{!126, !127, !128, !129}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !123, file: !124, line: 24, baseType: !72, size: 16)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !123, file: !124, line: 25, baseType: !72, size: 16, offset: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !123, file: !124, line: 26, baseType: !72, size: 16, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !123, file: !124, line: 27, baseType: !94, size: 16, offset: 48)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vxlanhdr", file: !132, line: 23, size: 64, elements: !133)
!132 = !DIFile(filename: "./vxlan.h", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "a6627392fe2b463cf34ba0788b5987a2")
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "vx_flags", scope: !131, file: !132, line: 24, baseType: !77, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "vx_vni", scope: !131, file: !132, line: 25, baseType: !77, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !138, line: 173, size: 112, elements: !139)
!138 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "163f54fb1af2e21fea410f14eb18fa76")
!139 = !{!140, !144, !145}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !137, file: !138, line: 174, baseType: !141, size: 48)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 48, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 6)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !137, file: !138, line: 175, baseType: !141, size: 48, offset: 48)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !137, file: !138, line: 176, baseType: !72, size: 16, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !148, line: 25, size: 160, elements: !149)
!148 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "1aa35012f509549bad9f3decb5d3e7a2")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !147, file: !148, line: 26, baseType: !72, size: 16)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !147, file: !148, line: 27, baseType: !72, size: 16, offset: 16)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !147, file: !148, line: 28, baseType: !102, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !147, file: !148, line: 29, baseType: !102, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !147, file: !148, line: 31, baseType: !62, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !147, file: !148, line: 32, baseType: !62, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !147, file: !148, line: 33, baseType: !62, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !147, file: !148, line: 34, baseType: !62, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !147, file: !148, line: 35, baseType: !62, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !147, file: !148, line: 36, baseType: !62, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !147, file: !148, line: 37, baseType: !62, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !147, file: !148, line: 38, baseType: !62, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !147, file: !148, line: 39, baseType: !62, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !147, file: !148, line: 40, baseType: !62, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !147, file: !148, line: 55, baseType: !72, size: 16, offset: 112)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !147, file: !148, line: 56, baseType: !94, size: 16, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !147, file: !148, line: 57, baseType: !72, size: 16, offset: 144)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !169, line: 118, size: 320, elements: !170)
!169 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "d288e308e142e51c48e7422f4fbbaa3f")
!170 = !{!171, !172, !173, !177, !178, !179, !180}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !168, file: !169, line: 120, baseType: !84, size: 4, flags: DIFlagBitField, extraData: i64 0)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !168, file: !169, line: 121, baseType: !84, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !168, file: !169, line: 128, baseType: !174, size: 24, offset: 8)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 24, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 3)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !168, file: !169, line: 130, baseType: !72, size: 16, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !168, file: !169, line: 131, baseType: !84, size: 8, offset: 48)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !168, file: !169, line: 132, baseType: !84, size: 8, offset: 56)
!180 = !DIDerivedType(tag: DW_TAG_member, scope: !168, file: !169, line: 134, baseType: !181, size: 256, offset: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !168, file: !169, line: 134, size: 256, elements: !182)
!182 = !{!183, !206}
!183 = !DIDerivedType(tag: DW_TAG_member, scope: !181, file: !169, line: 134, baseType: !184, size: 256)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !181, file: !169, line: 134, size: 256, elements: !185)
!185 = !{!186, !205}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !184, file: !169, line: 134, baseType: !187, size: 128)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !188, line: 33, size: 128, elements: !189)
!188 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "fca1889f0274df066e49cf4d8db8011e")
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !187, file: !188, line: 40, baseType: !191, size: 128)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !187, file: !188, line: 34, size: 128, elements: !192)
!192 = !{!193, !197, !201}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !191, file: !188, line: 35, baseType: !194, size: 128)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !191, file: !188, line: 37, baseType: !198, size: 128)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !191, file: !188, line: 38, baseType: !202, size: 128)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 4)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !184, file: !169, line: 134, baseType: !187, size: 128, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !181, file: !169, line: 134, baseType: !207, size: 256)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !181, file: !169, line: 134, size: 256, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !207, file: !169, line: 134, baseType: !187, size: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !207, file: !169, line: 134, baseType: !187, size: 128, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !63, line: 31, baseType: !212)
!212 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!213 = !{!0, !214, !221, !233, !236, !238, !240, !242, !244, !571, !579, !587, !592, !598, !603, !613, !619, !625, !631, !636, !641, !643, !645, !647, !649, !651, !653, !658, !660, !675, !689, !705, !715, !734, !742, !754, !767, !777, !785, !793, !801, !809, !822, !831, !846, !852, !858, !860, !866, !872, !878, !884, !898, !909, !915, !923, !925, !943, !965, !970, !981, !987, !992}
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "valid_opcodes", scope: !2, file: !44, line: 106, type: !216, isLocal: false, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 64, elements: !219)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!219 = !{!220}
!220 = !DISubrange(count: 2)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "DNS_RECORD_LIMITS", scope: !2, file: !44, line: 219, type: !223, isLocal: false, isDefinition: true)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_record_limits_malicious", file: !44, line: 203, size: 256, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_DOMAIN_LENGTH", scope: !223, file: !44, line: 204, baseType: !77, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_DOMAIN_LENGTH", scope: !223, file: !44, line: 205, baseType: !77, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_SUBDOMAIN_LENGTH_PER_LABEL", scope: !223, file: !44, line: 208, baseType: !77, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_SUBDOMAIN_LENGTH_PER_LABEL", scope: !223, file: !44, line: 209, baseType: !77, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_LABEL_COUNT", scope: !223, file: !44, line: 212, baseType: !77, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_LABEL_COUNT", scope: !223, file: !44, line: 213, baseType: !77, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_SUBDOMAIN_LENGTH_EXCLUDING_TLD", scope: !223, file: !44, line: 216, baseType: !77, size: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_SUBDOMAIN_LENGTH_EXCLUDING_TLD", scope: !223, file: !44, line: 217, baseType: !77, size: 32, offset: 224)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "redirect_skb_mark", scope: !2, file: !235, line: 62, type: !77, isLocal: false, isDefinition: true)
!235 = !DIFile(filename: "./consts.h", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "a9bca13aeb8b9fe9860f3a8743a55dfe")
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "bridge_redirect_addr_ipv6_suspicious", scope: !2, file: !235, line: 74, type: !187, isLocal: false, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "bridge_redirect_addr_ipv6_malicious", scope: !2, file: !235, line: 88, type: !187, isLocal: false, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "bridge_redirect_addr_ipv6_malicious_tunnel", scope: !2, file: !235, line: 102, type: !187, isLocal: false, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "INSECURE", scope: !2, file: !3, line: 105, type: !77, isLocal: false, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1545, type: !566, isLocal: true, isDefinition: true)
!246 = distinct !DISubprogram(name: "classify", scope: !3, file: !3, line: 1467, type: !247, scopeLine: 1467, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !342)
!247 = !DISubroutineType(types: !248)
!248 = !{!218, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !40, line: 6229, size: 1536, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !268, !269, !270, !271, !272, !273, !274, !275, !276, !278, !279, !280, !281, !282, !314, !315, !316, !317, !339, !340, !341}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !250, file: !40, line: 6230, baseType: !77, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !250, file: !40, line: 6231, baseType: !77, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !250, file: !40, line: 6232, baseType: !77, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !250, file: !40, line: 6233, baseType: !77, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !250, file: !40, line: 6234, baseType: !77, size: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !250, file: !40, line: 6235, baseType: !77, size: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !250, file: !40, line: 6236, baseType: !77, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !250, file: !40, line: 6237, baseType: !77, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !250, file: !40, line: 6238, baseType: !77, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !250, file: !40, line: 6239, baseType: !77, size: 32, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !250, file: !40, line: 6240, baseType: !77, size: 32, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !250, file: !40, line: 6241, baseType: !77, size: 32, offset: 352)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !250, file: !40, line: 6242, baseType: !265, size: 160, offset: 384)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 160, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 5)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !250, file: !40, line: 6243, baseType: !77, size: 32, offset: 544)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !250, file: !40, line: 6244, baseType: !77, size: 32, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !250, file: !40, line: 6245, baseType: !77, size: 32, offset: 608)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !250, file: !40, line: 6246, baseType: !77, size: 32, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !250, file: !40, line: 6247, baseType: !77, size: 32, offset: 672)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !250, file: !40, line: 6250, baseType: !77, size: 32, offset: 704)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !250, file: !40, line: 6251, baseType: !77, size: 32, offset: 736)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !250, file: !40, line: 6252, baseType: !77, size: 32, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !250, file: !40, line: 6253, baseType: !277, size: 128, offset: 800)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 128, elements: !203)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !250, file: !40, line: 6254, baseType: !277, size: 128, offset: 928)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !250, file: !40, line: 6255, baseType: !77, size: 32, offset: 1056)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !250, file: !40, line: 6256, baseType: !77, size: 32, offset: 1088)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !250, file: !40, line: 6259, baseType: !77, size: 32, offset: 1120)
!282 = !DIDerivedType(tag: DW_TAG_member, scope: !250, file: !40, line: 6260, baseType: !283, size: 64, align: 64, offset: 1152)
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !250, file: !40, line: 6260, size: 64, align: 64, elements: !284)
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !283, file: !40, line: 6260, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !40, line: 7271, size: 448, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !312, !313}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !287, file: !40, line: 7272, baseType: !62, size: 16)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !287, file: !40, line: 7273, baseType: !62, size: 16, offset: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !287, file: !40, line: 7274, baseType: !62, size: 16, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !287, file: !40, line: 7275, baseType: !84, size: 8, offset: 48)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !287, file: !40, line: 7276, baseType: !84, size: 8, offset: 56)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !287, file: !40, line: 7277, baseType: !84, size: 8, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !287, file: !40, line: 7278, baseType: !84, size: 8, offset: 72)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !287, file: !40, line: 7279, baseType: !72, size: 16, offset: 80)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !287, file: !40, line: 7280, baseType: !72, size: 16, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !287, file: !40, line: 7281, baseType: !72, size: 16, offset: 112)
!299 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !40, line: 7282, baseType: !300, size: 256, offset: 128)
!300 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !287, file: !40, line: 7282, size: 256, elements: !301)
!301 = !{!302, !307}
!302 = !DIDerivedType(tag: DW_TAG_member, scope: !300, file: !40, line: 7283, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !300, file: !40, line: 7283, size: 64, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !303, file: !40, line: 7284, baseType: !102, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !303, file: !40, line: 7285, baseType: !102, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, scope: !300, file: !40, line: 7287, baseType: !308, size: 256)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !300, file: !40, line: 7287, size: 256, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !308, file: !40, line: 7288, baseType: !277, size: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !308, file: !40, line: 7289, baseType: !277, size: 128, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !40, line: 7292, baseType: !77, size: 32, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !287, file: !40, line: 7293, baseType: !102, size: 32, offset: 416)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !250, file: !40, line: 6261, baseType: !211, size: 64, offset: 1216)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !250, file: !40, line: 6262, baseType: !77, size: 32, offset: 1280)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !250, file: !40, line: 6263, baseType: !77, size: 32, offset: 1312)
!317 = !DIDerivedType(tag: DW_TAG_member, scope: !250, file: !40, line: 6264, baseType: !318, size: 64, align: 64, offset: 1344)
!318 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !250, file: !40, line: 6264, size: 64, align: 64, elements: !319)
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !318, file: !40, line: 6264, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !40, line: 6333, size: 640, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !322, file: !40, line: 6334, baseType: !77, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !322, file: !40, line: 6335, baseType: !77, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !322, file: !40, line: 6336, baseType: !77, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !322, file: !40, line: 6337, baseType: !77, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !322, file: !40, line: 6338, baseType: !77, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !322, file: !40, line: 6339, baseType: !77, size: 32, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !322, file: !40, line: 6341, baseType: !77, size: 32, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !322, file: !40, line: 6342, baseType: !277, size: 128, offset: 224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !322, file: !40, line: 6343, baseType: !77, size: 32, offset: 352)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !322, file: !40, line: 6344, baseType: !72, size: 16, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !322, file: !40, line: 6346, baseType: !77, size: 32, offset: 416)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !322, file: !40, line: 6347, baseType: !277, size: 128, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !322, file: !40, line: 6348, baseType: !77, size: 32, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !322, file: !40, line: 6349, baseType: !338, size: 32, offset: 608)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !63, line: 26, baseType: !218)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !250, file: !40, line: 6265, baseType: !77, size: 32, offset: 1408)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp_type", scope: !250, file: !40, line: 6266, baseType: !84, size: 8, offset: 1440)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "hwtstamp", scope: !250, file: !40, line: 6268, baseType: !211, size: 64, offset: 1472)
!342 = !{!343, !344, !354, !426, !427, !428, !429, !430, !431, !432, !433, !441, !442, !447, !448, !449, !450, !453, !454, !455, !462, !463, !464, !465, !466, !474, !475, !478, !482, !483, !484, !492, !493, !496, !499, !500, !501, !502, !503, !504, !505, !506, !507, !508, !511, !515, !516, !517, !518, !519, !520, !523, !524, !529, !530, !531, !532, !535, !536, !537, !538, !539, !542, !543, !544, !545, !546, !547, !550, !553, !554, !555, !556, !557, !558, !559, !560, !561, !562, !563}
!343 = !DILocalVariable(name: "skb", arg: 1, scope: !246, file: !3, line: 1467, type: !249)
!344 = !DILocalVariable(name: "cursor", scope: !246, file: !3, line: 1469, type: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "skb_cursor", file: !3, line: 62, size: 192, elements: !346)
!346 = !{!347, !348, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !3, line: 63, baseType: !65, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !345, file: !3, line: 64, baseType: !65, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !345, file: !3, line: 65, baseType: !350, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_spin_lock", file: !40, line: 7311, size: 32, elements: !352)
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !351, file: !40, line: 7312, baseType: !77, size: 32)
!354 = !DILocalVariable(name: "actions", scope: !246, file: !3, line: 1470, type: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_actions", file: !3, line: 74, size: 960, elements: !356)
!356 = !{!357, !363, !367, !371, !372, !373, !377, !378, !382, !386, !390, !394, !398, !418, !422}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_init", scope: !355, file: !3, line: 75, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!361, !362, !249}
!361 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "packet_class_action", scope: !355, file: !3, line: 76, baseType: !364, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!355, !355}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "parse_eth", scope: !355, file: !3, line: 78, baseType: !368, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!84, !362}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "parse_ipv4", scope: !355, file: !3, line: 80, baseType: !368, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "parse_ipv6", scope: !355, file: !3, line: 81, baseType: !368, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "parse_udp", scope: !355, file: !3, line: 83, baseType: !374, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!84, !362, !361}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "parse_tcp", scope: !355, file: !3, line: 84, baseType: !374, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_header_size", scope: !355, file: !3, line: 90, baseType: !379, size: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!84, !362, !361, !361}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_transport_udp", scope: !355, file: !3, line: 91, baseType: !383, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!84, !362, !65, !77, !77, !66, !77}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_transport_tcp", scope: !355, file: !3, line: 92, baseType: !387, size: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!84, !362, !65, !109, !77}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_memsafet_payload", scope: !355, file: !3, line: 94, baseType: !391, size: 64, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!84, !362, !65, !66}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_memsafet_payload_transport_tcp", scope: !355, file: !3, line: 95, baseType: !395, size: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!84, !362, !65, !109}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_queries_section", scope: !355, file: !3, line: 98, baseType: !399, size: 64, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!84, !362, !62, !402}
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qtypes", file: !44, line: 65, size: 112, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !402, file: !44, line: 66, baseType: !84, size: 8)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "NS", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 8)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "CNAME", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 16)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "SOA", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 24)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "PTR", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "MX", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 40)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "TXT", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 48)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "AAAA", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 56)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "SRV", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "NAPTR", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 72)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "OPT", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 80)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "HTTPS", scope: !402, file: !44, line: 67, baseType: !84, size: 8, offset: 88)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ANY", scope: !402, file: !44, line: 67, baseType: !84, size: 8, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "NULL_TYPE", scope: !402, file: !44, line: 67, baseType: !84, size: 8, offset: 104)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_non_standard_port", scope: !355, file: !3, line: 101, baseType: !419, size: 64, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!84, !362, !249, !65, !66, !122}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_non_standard_port_tcp", scope: !355, file: !3, line: 102, baseType: !423, size: 64, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!84, !362, !249, !65, !109}
!426 = !DILocalVariable(name: "eth", scope: !246, file: !3, line: 1475, type: !136)
!427 = !DILocalVariable(name: "ip", scope: !246, file: !3, line: 1476, type: !79)
!428 = !DILocalVariable(name: "ipv6", scope: !246, file: !3, line: 1477, type: !167)
!429 = !DILocalVariable(name: "nhoff", scope: !246, file: !3, line: 1483, type: !77)
!430 = !DILocalVariable(name: "udp", scope: !246, file: !3, line: 1487, type: !122)
!431 = !DILocalVariable(name: "tcp", scope: !246, file: !3, line: 1487, type: !146)
!432 = !DILocalVariable(name: "hproto", scope: !246, file: !3, line: 1489, type: !72)
!433 = !DILocalVariable(name: "vlan", scope: !434, file: !3, line: 1492, type: !436)
!434 = distinct !DILexicalBlock(scope: !435, file: !3, line: 1491, column: 92)
!435 = distinct !DILexicalBlock(scope: !246, file: !3, line: 1491, column: 9)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !3, line: 69, size: 32, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !437, file: !3, line: 70, baseType: !72, size: 16)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !437, file: !3, line: 71, baseType: !72, size: 16, offset: 16)
!441 = !DILocalVariable(name: "isEncapL2", scope: !246, file: !3, line: 1504, type: !361)
!442 = !DILocalVariable(name: "udp_data", scope: !443, file: !3, line: 1517, type: !65)
!443 = distinct !DILexicalBlock(scope: !444, file: !3, line: 1513, column: 42)
!444 = distinct !DILexicalBlock(scope: !445, file: !3, line: 1513, column: 13)
!445 = distinct !DILexicalBlock(scope: !446, file: !3, line: 1506, column: 40)
!446 = distinct !DILexicalBlock(scope: !246, file: !3, line: 1506, column: 9)
!447 = !DILocalVariable(name: "total_offset", scope: !443, file: !3, line: 1520, type: !77)
!448 = !DILocalVariable(name: "udp_payload_len", scope: !443, file: !3, line: 1522, type: !77)
!449 = !DILocalVariable(name: "udp_payload_exclude_header", scope: !443, file: !3, line: 1523, type: !77)
!450 = !DILocalVariable(name: "dns_payload", scope: !451, file: !3, line: 1531, type: !65)
!451 = distinct !DILexicalBlock(scope: !452, file: !3, line: 1526, column: 58)
!452 = distinct !DILexicalBlock(scope: !443, file: !3, line: 1526, column: 17)
!453 = !DILocalVariable(name: "dns", scope: !451, file: !3, line: 1533, type: !66)
!454 = !DILocalVariable(name: "parse_flag", scope: !451, file: !3, line: 1540, type: !84)
!455 = !DILocalVariable(name: "result", scope: !451, file: !3, line: 1542, type: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "result_parse_dns_labels", file: !235, line: 152, size: 32, elements: !457)
!457 = !{!458, !459, !460, !461}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "deep_scan_mirror", scope: !456, file: !235, line: 153, baseType: !361, size: 8)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !456, file: !235, line: 154, baseType: !361, size: 8, offset: 8)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "isBenign", scope: !456, file: !235, line: 155, baseType: !361, size: 8, offset: 16)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "isC2c", scope: !456, file: !235, line: 156, baseType: !361, size: 8, offset: 24)
!462 = !DILocalVariable(name: "current_dest_addr", scope: !451, file: !3, line: 1548, type: !102)
!463 = !DILocalVariable(name: "dest_addr_route", scope: !451, file: !3, line: 1549, type: !102)
!464 = !DILocalVariable(name: "dest_addr_route_malicious", scope: !451, file: !3, line: 1550, type: !102)
!465 = !DILocalVariable(name: "out", scope: !451, file: !3, line: 1552, type: !77)
!466 = !DILocalVariable(name: "config", scope: !451, file: !3, line: 1554, type: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_kernel_config", file: !235, line: 27, size: 128, elements: !469)
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "BridgeIndexId", scope: !468, file: !235, line: 28, baseType: !77, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "NfNdpBridgeIndexId", scope: !468, file: !235, line: 29, baseType: !77, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "RedirectIpv4", scope: !468, file: !235, line: 30, baseType: !102, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "NfNdpBridgeRedirectIpv4", scope: !468, file: !235, line: 31, baseType: !102, size: 32, offset: 96)
!474 = !DILocalVariable(name: "br_index", scope: !451, file: !3, line: 1555, type: !77)
!475 = !DILocalVariable(name: "redirect_address_from_config", scope: !476, file: !3, line: 1558, type: !102)
!476 = distinct !DILexicalBlock(scope: !477, file: !3, line: 1557, column: 29)
!477 = distinct !DILexicalBlock(scope: !451, file: !3, line: 1557, column: 21)
!478 = !DILocalVariable(name: "csum_diff_drop", scope: !479, file: !3, line: 1588, type: !77)
!479 = distinct !DILexicalBlock(scope: !480, file: !3, line: 1577, column: 38)
!480 = distinct !DILexicalBlock(scope: !481, file: !3, line: 1577, column: 26)
!481 = distinct !DILexicalBlock(scope: !451, file: !3, line: 1569, column: 21)
!482 = !DILocalVariable(name: "transaction_id", scope: !451, file: !3, line: 1611, type: !62)
!483 = !DILocalVariable(name: "ip_checksum", scope: !451, file: !3, line: 1612, type: !62)
!484 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !451, file: !3, line: 1613, type: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "checkSum_redirect_struct_value", file: !3, line: 158, size: 192, elements: !487)
!487 = !{!488, !489, !490, !491}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !486, file: !3, line: 159, baseType: !62, size: 16)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_timets", scope: !486, file: !3, line: 160, baseType: !211, size: 64, offset: 64)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "procId", scope: !486, file: !3, line: 161, baseType: !77, size: 32, offset: 128)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "threadId", scope: !486, file: !3, line: 162, baseType: !77, size: 32, offset: 160)
!492 = !DILocalVariable(name: "csum_diff", scope: !451, file: !3, line: 1639, type: !77)
!493 = !DILocalVariable(name: "tcp_data", scope: !494, file: !3, line: 1680, type: !65)
!494 = distinct !DILexicalBlock(scope: !495, file: !3, line: 1675, column: 48)
!495 = distinct !DILexicalBlock(scope: !444, file: !3, line: 1675, column: 19)
!496 = !DILocalVariable(name: "dns_payload", scope: !497, file: !3, line: 1685, type: !65)
!497 = distinct !DILexicalBlock(scope: !498, file: !3, line: 1683, column: 58)
!498 = distinct !DILexicalBlock(scope: !494, file: !3, line: 1683, column: 17)
!499 = !DILocalVariable(name: "dns", scope: !497, file: !3, line: 1687, type: !109)
!500 = !DILocalVariable(name: "parse_flag", scope: !497, file: !3, line: 1696, type: !84)
!501 = !DILocalVariable(name: "result", scope: !497, file: !3, line: 1698, type: !456)
!502 = !DILocalVariable(name: "current_dest_addr", scope: !497, file: !3, line: 1701, type: !102)
!503 = !DILocalVariable(name: "dest_addr_route", scope: !497, file: !3, line: 1702, type: !102)
!504 = !DILocalVariable(name: "dest_addr_route_malicious", scope: !497, file: !3, line: 1703, type: !102)
!505 = !DILocalVariable(name: "out", scope: !497, file: !3, line: 1705, type: !77)
!506 = !DILocalVariable(name: "config", scope: !497, file: !3, line: 1706, type: !467)
!507 = !DILocalVariable(name: "br_index", scope: !497, file: !3, line: 1707, type: !77)
!508 = !DILocalVariable(name: "redirect_address_from_config", scope: !509, file: !3, line: 1710, type: !102)
!509 = distinct !DILexicalBlock(scope: !510, file: !3, line: 1709, column: 29)
!510 = distinct !DILexicalBlock(scope: !497, file: !3, line: 1709, column: 21)
!511 = !DILocalVariable(name: "br_index", scope: !512, file: !3, line: 1725, type: !77)
!512 = distinct !DILexicalBlock(scope: !513, file: !3, line: 1723, column: 39)
!513 = distinct !DILexicalBlock(scope: !514, file: !3, line: 1723, column: 26)
!514 = distinct !DILexicalBlock(scope: !497, file: !3, line: 1721, column: 21)
!515 = !DILocalVariable(name: "config", scope: !512, file: !3, line: 1726, type: !467)
!516 = !DILocalVariable(name: "csum_diff_drop", scope: !512, file: !3, line: 1734, type: !77)
!517 = !DILocalVariable(name: "transaction_id", scope: !497, file: !3, line: 1758, type: !77)
!518 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !497, file: !3, line: 1760, type: !485)
!519 = !DILocalVariable(name: "tcp_payload_len", scope: !497, file: !3, line: 1780, type: !77)
!520 = !DILocalVariable(name: "dns_rate_limit_action", scope: !521, file: !3, line: 1782, type: !84)
!521 = distinct !DILexicalBlock(scope: !522, file: !3, line: 1781, column: 46)
!522 = distinct !DILexicalBlock(scope: !497, file: !3, line: 1781, column: 21)
!523 = !DILocalVariable(name: "csum_diff", scope: !497, file: !3, line: 1795, type: !77)
!524 = !DILocalVariable(name: "udp_data", scope: !525, file: !3, line: 1838, type: !65)
!525 = distinct !DILexicalBlock(scope: !526, file: !3, line: 1833, column: 43)
!526 = distinct !DILexicalBlock(scope: !527, file: !3, line: 1833, column: 13)
!527 = distinct !DILexicalBlock(scope: !528, file: !3, line: 1828, column: 51)
!528 = distinct !DILexicalBlock(scope: !446, file: !3, line: 1828, column: 12)
!529 = !DILocalVariable(name: "total_offset", scope: !525, file: !3, line: 1841, type: !77)
!530 = !DILocalVariable(name: "udp_payload_len", scope: !525, file: !3, line: 1843, type: !77)
!531 = !DILocalVariable(name: "udp_payload_exclude_header", scope: !525, file: !3, line: 1844, type: !77)
!532 = !DILocalVariable(name: "dns_payload", scope: !533, file: !3, line: 1850, type: !65)
!533 = distinct !DILexicalBlock(scope: !534, file: !3, line: 1846, column: 58)
!534 = distinct !DILexicalBlock(scope: !525, file: !3, line: 1846, column: 17)
!535 = !DILocalVariable(name: "dns", scope: !533, file: !3, line: 1852, type: !66)
!536 = !DILocalVariable(name: "parse_flag", scope: !533, file: !3, line: 1859, type: !84)
!537 = !DILocalVariable(name: "result", scope: !533, file: !3, line: 1861, type: !456)
!538 = !DILocalVariable(name: "dns_payload_size", scope: !533, file: !3, line: 1864, type: !62)
!539 = !DILocalVariable(name: "dns_rate_limit_action", scope: !540, file: !3, line: 1866, type: !84)
!540 = distinct !DILexicalBlock(scope: !541, file: !3, line: 1865, column: 46)
!541 = distinct !DILexicalBlock(scope: !533, file: !3, line: 1865, column: 21)
!542 = !DILocalVariable(name: "out", scope: !533, file: !3, line: 1872, type: !77)
!543 = !DILocalVariable(name: "config", scope: !533, file: !3, line: 1874, type: !467)
!544 = !DILocalVariable(name: "br_index", scope: !533, file: !3, line: 1875, type: !77)
!545 = !DILocalVariable(name: "transaction_id", scope: !533, file: !3, line: 1909, type: !62)
!546 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !533, file: !3, line: 1911, type: !485)
!547 = !DILocalVariable(name: "tcp_data", scope: !548, file: !3, line: 1956, type: !65)
!548 = distinct !DILexicalBlock(scope: !549, file: !3, line: 1951, column: 49)
!549 = distinct !DILexicalBlock(scope: !526, file: !3, line: 1951, column: 19)
!550 = !DILocalVariable(name: "dns", scope: !551, file: !3, line: 1961, type: !109)
!551 = distinct !DILexicalBlock(scope: !552, file: !3, line: 1959, column: 58)
!552 = distinct !DILexicalBlock(scope: !548, file: !3, line: 1959, column: 17)
!553 = !DILocalVariable(name: "dns_payload", scope: !551, file: !3, line: 1964, type: !65)
!554 = !DILocalVariable(name: "parse_flag", scope: !551, file: !3, line: 1972, type: !84)
!555 = !DILocalVariable(name: "result", scope: !551, file: !3, line: 1974, type: !456)
!556 = !DILocalVariable(name: "skb_ifIndex", scope: !551, file: !3, line: 1976, type: !77)
!557 = !DILocalVariable(name: "out", scope: !551, file: !3, line: 1979, type: !77)
!558 = !DILocalVariable(name: "config", scope: !551, file: !3, line: 1981, type: !467)
!559 = !DILocalVariable(name: "br_index", scope: !551, file: !3, line: 1982, type: !77)
!560 = !DILocalVariable(name: "transaction_id", scope: !551, file: !3, line: 2001, type: !62)
!561 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !551, file: !3, line: 2003, type: !485)
!562 = !DILocalVariable(name: "tcp_payload_len", scope: !551, file: !3, line: 2024, type: !77)
!563 = !DILocalVariable(name: "dns_rate_limit_action", scope: !564, file: !3, line: 2026, type: !84)
!564 = distinct !DILexicalBlock(scope: !565, file: !3, line: 2025, column: 46)
!565 = distinct !DILexicalBlock(scope: !551, file: !3, line: 2025, column: 21)
!566 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 624, elements: !569)
!567 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !568)
!568 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!569 = !{!570}
!570 = !DISubrange(count: 78)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !573, line: 177, type: !574, isLocal: true, isDefinition: true)
!573 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "", checksumkind: CSK_MD5, checksum: "65e4dc8e3121f91a5c2c9eb8563c5692")
!574 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !575)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !576, size: 64)
!576 = !DISubroutineType(types: !577)
!577 = !{!119, !578, !77, null}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!579 = !DIGlobalVariableExpression(var: !580, expr: !DIExpression())
!580 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !573, line: 56, type: !581, isLocal: true, isDefinition: true)
!581 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !582)
!582 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !583, size: 64)
!583 = !DISubroutineType(types: !584)
!584 = !{!65, !65, !585}
!585 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !586, size: 64)
!586 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!587 = !DIGlobalVariableExpression(var: !588, expr: !DIExpression())
!588 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1564, type: !589, isLocal: true, isDefinition: true)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 464, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 58)
!592 = !DIGlobalVariableExpression(var: !593, expr: !DIExpression())
!593 = distinct !DIGlobalVariable(name: "bpf_skb_load_bytes", scope: !2, file: !573, line: 719, type: !594, isLocal: true, isDefinition: true)
!594 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !595)
!595 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !596, size: 64)
!596 = !DISubroutineType(types: !597)
!597 = !{!119, !585, !77, !65, !77}
!598 = !DIGlobalVariableExpression(var: !599, expr: !DIExpression())
!599 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1585, type: !600, isLocal: true, isDefinition: true)
!600 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 512, elements: !601)
!601 = !{!602}
!602 = !DISubrange(count: 64)
!603 = !DIGlobalVariableExpression(var: !604, expr: !DIExpression())
!604 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !573, line: 796, type: !605, isLocal: true, isDefinition: true)
!605 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !606)
!606 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !607, size: 64)
!607 = !DISubroutineType(types: !608)
!608 = !{!609, !611, !77, !611, !77, !612}
!609 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !63, line: 30, baseType: !610)
!610 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !73, line: 39, baseType: !77)
!613 = !DIGlobalVariableExpression(var: !614, expr: !DIExpression())
!614 = distinct !DIGlobalVariable(name: "bpf_l3_csum_replace", scope: !2, file: !573, line: 256, type: !615, isLocal: true, isDefinition: true)
!615 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !616)
!616 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !617, size: 64)
!617 = !DISubroutineType(types: !618)
!618 = !{!119, !249, !77, !211, !211, !211}
!619 = !DIGlobalVariableExpression(var: !620, expr: !DIExpression())
!620 = distinct !DIGlobalVariable(name: "bpf_skb_store_bytes", scope: !2, file: !573, line: 227, type: !621, isLocal: true, isDefinition: true)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!622 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !623, size: 64)
!623 = !DISubroutineType(types: !624)
!624 = !{!119, !249, !77, !585, !77, !211}
!625 = !DIGlobalVariableExpression(var: !626, expr: !DIExpression())
!626 = distinct !DIGlobalVariable(name: "bpf_redirect", scope: !2, file: !573, line: 621, type: !627, isLocal: true, isDefinition: true)
!627 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DISubroutineType(types: !630)
!630 = !{!119, !77, !211}
!631 = !DIGlobalVariableExpression(var: !632, expr: !DIExpression())
!632 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1618, type: !633, isLocal: true, isDefinition: true)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 1344, elements: !634)
!634 = !{!635}
!635 = !DISubrange(count: 168)
!636 = !DIGlobalVariableExpression(var: !637, expr: !DIExpression())
!637 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1716, type: !638, isLocal: true, isDefinition: true)
!638 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 672, elements: !639)
!639 = !{!640}
!640 = !DISubrange(count: 84)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1730, type: !600, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1765, type: !633, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1880, type: !589, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1916, type: !633, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1987, type: !589, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 2008, type: !633, isLocal: true, isDefinition: true)
!653 = !DIGlobalVariableExpression(var: !654, expr: !DIExpression())
!654 = distinct !DIGlobalVariable(name: "__license", scope: !2, file: !3, line: 2055, type: !655, isLocal: false, isDefinition: true)
!655 = !DICompositeType(tag: DW_TAG_array_type, baseType: !568, size: 104, elements: !656)
!656 = !{!657}
!657 = !DISubrange(count: 13)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "flags", scope: !2, file: !44, line: 20, type: !43, isLocal: false, isDefinition: true)
!660 = !DIGlobalVariableExpression(var: !661, expr: !DIExpression())
!661 = distinct !DIGlobalVariable(name: "exfil_security_egress_dns_limites", scope: !2, file: !235, line: 43, type: !662, isLocal: false, isDefinition: true)
!662 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_dns_limites", file: !235, line: 38, size: 256, elements: !663)
!663 = !{!664, !669, !671, !672}
!664 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !662, file: !235, line: 39, baseType: !665, size: 64)
!665 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !666, size: 64)
!666 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 32, elements: !667)
!667 = !{!668}
!668 = !DISubrange(count: 1)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !662, file: !235, line: 40, baseType: !670, size: 64, offset: 64)
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !662, file: !235, line: 41, baseType: !670, size: 64, offset: 128)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !662, file: !235, line: 42, baseType: !673, size: 64, offset: 192)
!673 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !674, size: 64)
!674 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 512, elements: !195)
!675 = !DIGlobalVariableExpression(var: !676, expr: !DIExpression())
!676 = distinct !DIGlobalVariable(name: "exfil_security_egrees_redirect_ring_buff_non_standard_port", scope: !2, file: !3, line: 114, type: !677, isLocal: false, isDefinition: true)
!677 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egrees_redirect_ring_buff_non_standard_port", file: !3, line: 111, size: 128, elements: !678)
!678 = !{!679, !684}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !677, file: !3, line: 112, baseType: !680, size: 64)
!680 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !681, size: 64)
!681 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 864, elements: !682)
!682 = !{!683}
!683 = !DISubrange(count: 27)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !677, file: !3, line: 113, baseType: !685, size: 64, offset: 64)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !686, size: 64)
!686 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 536870912, elements: !687)
!687 = !{!688}
!688 = !DISubrange(count: 16777216)
!689 = !DIGlobalVariableExpression(var: !690, expr: !DIExpression())
!690 = distinct !DIGlobalVariable(name: "exfil_vxlan_block_egress_port", scope: !2, file: !3, line: 129, type: !691, isLocal: false, isDefinition: true)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_vxlan_block_egress_port", file: !3, line: 124, size: 256, elements: !692)
!692 = !{!693, !698, !699, !700}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !691, file: !3, line: 125, baseType: !694, size: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !695, size: 64)
!695 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 288, elements: !696)
!696 = !{!697}
!697 = !DISubrange(count: 9)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !691, file: !3, line: 126, baseType: !121, size: 64, offset: 64)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !691, file: !3, line: 127, baseType: !120, size: 64, offset: 128)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !691, file: !3, line: 128, baseType: !701, size: 64, offset: 192)
!701 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !702, size: 64)
!702 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 32768, elements: !703)
!703 = !{!704}
!704 = !DISubrange(count: 1024)
!705 = !DIGlobalVariableExpression(var: !706, expr: !DIExpression())
!706 = distinct !DIGlobalVariable(name: "exfil_security_egress_vxlan_encap_drop", scope: !2, file: !3, line: 136, type: !707, isLocal: false, isDefinition: true)
!707 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_vxlan_encap_drop", file: !3, line: 133, size: 128, elements: !708)
!708 = !{!709, !710}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !707, file: !3, line: 134, baseType: !680, size: 64)
!710 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !707, file: !3, line: 135, baseType: !711, size: 64, offset: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 131072, elements: !713)
!713 = !{!714}
!714 = !DISubrange(count: 4096)
!715 = !DIGlobalVariableExpression(var: !716, expr: !DIExpression())
!716 = distinct !DIGlobalVariable(name: "exfil_security_egress_reconnisance_map_scan", scope: !2, file: !3, line: 154, type: !717, isLocal: false, isDefinition: true)
!717 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_reconnisance_map_scan", file: !3, line: 149, size: 256, elements: !718)
!718 = !{!719, !720, !721, !729}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !717, file: !3, line: 150, baseType: !694, size: 64)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !717, file: !3, line: 151, baseType: !121, size: 64, offset: 64)
!721 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !717, file: !3, line: 152, baseType: !722, size: 64, offset: 128)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !723, size: 64)
!723 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_raw_packet_mirror", file: !3, line: 140, size: 48, elements: !724)
!724 = !{!725, !726, !727, !728}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !723, file: !3, line: 141, baseType: !62, size: 16)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !723, file: !3, line: 142, baseType: !62, size: 16, offset: 16)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "isUdp", scope: !723, file: !3, line: 143, baseType: !84, size: 8, offset: 32)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "isPacketRescanedAndMalicious", scope: !723, file: !3, line: 144, baseType: !84, size: 8, offset: 40)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !717, file: !3, line: 153, baseType: !730, size: 64, offset: 192)
!730 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !731, size: 64)
!731 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 2097152, elements: !732)
!732 = !{!733}
!733 = !DISubrange(count: 65536)
!734 = !DIGlobalVariableExpression(var: !735, expr: !DIExpression())
!735 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_map", scope: !2, file: !3, line: 171, type: !736, isLocal: false, isDefinition: true)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_map", file: !3, line: 166, size: 256, elements: !737)
!737 = !{!738, !739, !740, !741}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !736, file: !3, line: 167, baseType: !694, size: 64)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !736, file: !3, line: 168, baseType: !121, size: 64, offset: 64)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !736, file: !3, line: 169, baseType: !485, size: 64, offset: 128)
!741 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !736, file: !3, line: 170, baseType: !685, size: 64, offset: 192)
!742 = !DIGlobalVariableExpression(var: !743, expr: !DIExpression())
!743 = distinct !DIGlobalVariable(name: "exfil_security_protocols_identifier_maps", scope: !2, file: !3, line: 181, type: !744, isLocal: false, isDefinition: true)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_protocols_identifier_maps", file: !3, line: 176, size: 256, elements: !745)
!745 = !{!746, !749, !750, !751}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !744, file: !3, line: 177, baseType: !747, size: 64)
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !748, size: 64)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 64, elements: !219)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !744, file: !3, line: 178, baseType: !670, size: 64, offset: 64)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !744, file: !3, line: 179, baseType: !121, size: 64, offset: 128)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !744, file: !3, line: 180, baseType: !752, size: 64, offset: 192)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !753, size: 64)
!753 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 160, elements: !266)
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "exfil_security_egress_redurect_ts_verify", scope: !2, file: !3, line: 188, type: !756, isLocal: false, isDefinition: true)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redurect_ts_verify", file: !3, line: 183, size: 256, elements: !757)
!757 = !{!758, !759, !761, !762}
!758 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !756, file: !3, line: 184, baseType: !694, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !756, file: !3, line: 185, baseType: !760, size: 64, offset: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !756, file: !3, line: 186, baseType: !120, size: 64, offset: 128)
!762 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !756, file: !3, line: 187, baseType: !763, size: 64, offset: 192)
!763 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !764, size: 64)
!764 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 1048576, elements: !765)
!765 = !{!766}
!766 = !DISubrange(count: 32768)
!767 = !DIGlobalVariableExpression(var: !768, expr: !DIExpression())
!768 = distinct !DIGlobalVariable(name: "exfil_security_config_map", scope: !2, file: !3, line: 196, type: !769, isLocal: false, isDefinition: true)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_config_map", file: !3, line: 191, size: 256, elements: !770)
!770 = !{!771, !772, !773, !774}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !769, file: !3, line: 192, baseType: !665, size: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !769, file: !3, line: 193, baseType: !670, size: 64, offset: 64)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !769, file: !3, line: 194, baseType: !467, size: 64, offset: 128)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !769, file: !3, line: 195, baseType: !775, size: 64, offset: 192)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 2048, elements: !601)
!777 = !DIGlobalVariableExpression(var: !778, expr: !DIExpression())
!778 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_loop_time", scope: !2, file: !3, line: 208, type: !779, isLocal: false, isDefinition: true)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_loop_time", file: !3, line: 203, size: 256, elements: !780)
!780 = !{!781, !782, !783, !784}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !779, file: !3, line: 204, baseType: !694, size: 64)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !779, file: !3, line: 205, baseType: !670, size: 64, offset: 64)
!783 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !779, file: !3, line: 206, baseType: !760, size: 64, offset: 128)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !779, file: !3, line: 207, baseType: !763, size: 64, offset: 192)
!785 = !DIGlobalVariableExpression(var: !786, expr: !DIExpression())
!786 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_count_map", scope: !2, file: !3, line: 216, type: !787, isLocal: false, isDefinition: true)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_count_map", file: !3, line: 211, size: 256, elements: !788)
!788 = !{!789, !790, !791, !792}
!789 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !787, file: !3, line: 212, baseType: !694, size: 64)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !787, file: !3, line: 213, baseType: !121, size: 64, offset: 64)
!791 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !787, file: !3, line: 214, baseType: !670, size: 64, offset: 128)
!792 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !787, file: !3, line: 215, baseType: !665, size: 64, offset: 192)
!793 = !DIGlobalVariableExpression(var: !794, expr: !DIExpression())
!794 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_drop_count_map", scope: !2, file: !3, line: 224, type: !795, isLocal: false, isDefinition: true)
!795 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_drop_count_map", file: !3, line: 219, size: 256, elements: !796)
!796 = !{!797, !798, !799, !800}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !795, file: !3, line: 220, baseType: !694, size: 64)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !795, file: !3, line: 221, baseType: !121, size: 64, offset: 64)
!799 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !795, file: !3, line: 222, baseType: !670, size: 64, offset: 128)
!800 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !795, file: !3, line: 223, baseType: !665, size: 64, offset: 192)
!801 = !DIGlobalVariableExpression(var: !802, expr: !DIExpression())
!802 = distinct !DIGlobalVariable(name: "exfil_security_egress_vxlan_dns_transport", scope: !2, file: !3, line: 231, type: !803, isLocal: false, isDefinition: true)
!803 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_vxlan_dns_transport", file: !3, line: 226, size: 256, elements: !804)
!804 = !{!805, !806, !807, !808}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !803, file: !3, line: 227, baseType: !694, size: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !803, file: !3, line: 228, baseType: !120, size: 64, offset: 64)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !803, file: !3, line: 229, baseType: !670, size: 64, offset: 128)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !803, file: !3, line: 230, baseType: !665, size: 64, offset: 192)
!809 = !DIGlobalVariableExpression(var: !810, expr: !DIExpression())
!810 = distinct !DIGlobalVariable(name: "exfil_security_egress_rate_limit_map", scope: !2, file: !3, line: 248, type: !811, isLocal: false, isDefinition: true)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_rate_limit_map", file: !3, line: 243, size: 256, elements: !812)
!812 = !{!813, !814, !815, !821}
!813 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !811, file: !3, line: 244, baseType: !694, size: 64)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !811, file: !3, line: 245, baseType: !121, size: 64, offset: 64)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !811, file: !3, line: 246, baseType: !816, size: 64, offset: 128)
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !817, size: 64)
!817 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_volume_stats", file: !3, line: 235, size: 128, elements: !818)
!818 = !{!819, !820}
!819 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !817, file: !3, line: 236, baseType: !211, size: 64)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "packet_size", scope: !817, file: !3, line: 237, baseType: !77, size: 32, offset: 64)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !811, file: !3, line: 247, baseType: !665, size: 64, offset: 192)
!822 = !DIGlobalVariableExpression(var: !823, expr: !DIExpression())
!823 = distinct !DIGlobalVariable(name: "maps", scope: !2, file: !3, line: 1444, type: !824, isLocal: false, isDefinition: true)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_handler_map", file: !3, line: 1438, size: 320, elements: !825)
!825 = !{!826, !827, !828, !829, !830}
!826 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !824, file: !3, line: 1439, baseType: !665, size: 64)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !824, file: !3, line: 1440, baseType: !685, size: 64, offset: 64)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !824, file: !3, line: 1441, baseType: !120, size: 64, offset: 128)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !824, file: !3, line: 1442, baseType: !121, size: 64, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !824, file: !3, line: 1443, baseType: !665, size: 64, offset: 256)
!831 = !DIGlobalVariableExpression(var: !832, expr: !DIExpression())
!832 = distinct !DIGlobalVariable(name: "____fmt", scope: !833, file: !3, line: 336, type: !843, isLocal: true, isDefinition: true)
!833 = distinct !DISubprogram(name: "process_udp_payload_mem_verification", scope: !3, file: !3, line: 318, type: !834, scopeLine: 318, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !836)
!834 = !DISubroutineType(types: !835)
!835 = !{!84, !122, !362, !361}
!836 = !{!837, !838, !839, !840, !841, !842}
!837 = !DILocalVariable(name: "udp", arg: 1, scope: !833, file: !3, line: 318, type: !122)
!838 = !DILocalVariable(name: "skb", arg: 2, scope: !833, file: !3, line: 318, type: !362)
!839 = !DILocalVariable(name: "isIPv4", arg: 3, scope: !833, file: !3, line: 318, type: !361)
!840 = !DILocalVariable(name: "udp_len", scope: !833, file: !3, line: 319, type: !62)
!841 = !DILocalVariable(name: "udp_len_payload", scope: !833, file: !3, line: 320, type: !62)
!842 = !DILocalVariable(name: "udp_data", scope: !833, file: !3, line: 323, type: !65)
!843 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 288, elements: !844)
!844 = !{!845}
!845 = !DISubrange(count: 36)
!846 = !DIGlobalVariableExpression(var: !847, expr: !DIExpression())
!847 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !573, line: 78, type: !848, isLocal: true, isDefinition: true)
!848 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !849)
!849 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !850, size: 64)
!850 = !DISubroutineType(types: !851)
!851 = !{!119, !65, !585, !585, !211}
!852 = !DIGlobalVariableExpression(var: !853, expr: !DIExpression())
!853 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !573, line: 114, type: !854, isLocal: true, isDefinition: true)
!854 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !855)
!855 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !856, size: 64)
!856 = !DISubroutineType(types: !857)
!857 = !{!211}
!858 = !DIGlobalVariableExpression(var: !859, expr: !DIExpression())
!859 = distinct !DIGlobalVariable(name: "bpf_get_current_pid_tgid", scope: !2, file: !573, line: 370, type: !854, isLocal: true, isDefinition: true)
!860 = !DIGlobalVariableExpression(var: !861, expr: !DIExpression())
!861 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !573, line: 88, type: !862, isLocal: true, isDefinition: true)
!862 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !863)
!863 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !864, size: 64)
!864 = !DISubroutineType(types: !865)
!865 = !{!119, !65, !585}
!866 = !DIGlobalVariableExpression(var: !867, expr: !DIExpression())
!867 = distinct !DIGlobalVariable(name: "bpf_ringbuf_reserve", scope: !2, file: !573, line: 3176, type: !868, isLocal: true, isDefinition: true)
!868 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DISubroutineType(types: !871)
!871 = !{!65, !65, !211, !211}
!872 = !DIGlobalVariableExpression(var: !873, expr: !DIExpression())
!873 = distinct !DIGlobalVariable(name: "bpf_ringbuf_query", scope: !2, file: !573, line: 3233, type: !874, isLocal: true, isDefinition: true)
!874 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !875)
!875 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !876, size: 64)
!876 = !DISubroutineType(types: !877)
!877 = !{!211, !65, !211}
!878 = !DIGlobalVariableExpression(var: !879, expr: !DIExpression())
!879 = distinct !DIGlobalVariable(name: "bpf_ringbuf_submit", scope: !2, file: !573, line: 3194, type: !880, isLocal: true, isDefinition: true)
!880 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !881)
!881 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !882, size: 64)
!882 = !DISubroutineType(types: !883)
!883 = !{null, !65, !211}
!884 = !DIGlobalVariableExpression(var: !885, expr: !DIExpression())
!885 = distinct !DIGlobalVariable(name: "____fmt", scope: !886, file: !132, line: 47, type: !895, isLocal: true, isDefinition: true)
!886 = distinct !DISubprogram(name: "__parse_vxlan_vni_hdr", scope: !132, file: !132, line: 42, type: !887, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !889)
!887 = !DISubroutineType(types: !888)
!888 = !{!77, !65, !130, !65}
!889 = !{!890, !891, !892, !893, !894}
!890 = !DILocalVariable(name: "transport_payload", arg: 1, scope: !886, file: !132, line: 42, type: !65)
!891 = !DILocalVariable(name: "vxlan_hdr", arg: 2, scope: !886, file: !132, line: 42, type: !130)
!892 = !DILocalVariable(name: "data_end", arg: 3, scope: !886, file: !132, line: 42, type: !65)
!893 = !DILocalVariable(name: "vni", scope: !886, file: !132, line: 43, type: !77)
!894 = !DILocalVariable(name: "resrvered", scope: !886, file: !132, line: 45, type: !77)
!895 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 272, elements: !896)
!896 = !{!897}
!897 = !DISubrange(count: 34)
!898 = !DIGlobalVariableExpression(var: !899, expr: !DIExpression())
!899 = distinct !DIGlobalVariable(name: "bpf_ringbuf_reserve_dynptr", scope: !2, file: !573, line: 4485, type: !900, isLocal: true, isDefinition: true)
!900 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!901 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !902, size: 64)
!902 = !DISubroutineType(types: !903)
!903 = !{!119, !65, !77, !211, !904}
!904 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !905, size: 64)
!905 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_dynptr", file: !40, line: 7323, size: 128, align: 64, elements: !906)
!906 = !{!907}
!907 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !905, file: !40, line: 7324, baseType: !908, size: 128)
!908 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 128, elements: !219)
!909 = !DIGlobalVariableExpression(var: !910, expr: !DIExpression())
!910 = distinct !DIGlobalVariable(name: "bpf_ringbuf_discard_dynptr", scope: !2, file: !573, line: 4514, type: !911, isLocal: true, isDefinition: true)
!911 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !912)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{null, !904, !211}
!915 = !DIGlobalVariableExpression(var: !916, expr: !DIExpression())
!916 = distinct !DIGlobalVariable(name: "bpf_dynptr_write", scope: !2, file: !573, line: 4553, type: !917, isLocal: true, isDefinition: true)
!917 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !918)
!918 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !919, size: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!119, !921, !77, !65, !77, !211}
!921 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !922, size: 64)
!922 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !905)
!923 = !DIGlobalVariableExpression(var: !924, expr: !DIExpression())
!924 = distinct !DIGlobalVariable(name: "bpf_ringbuf_submit_dynptr", scope: !2, file: !573, line: 4500, type: !911, isLocal: true, isDefinition: true)
!925 = !DIGlobalVariableExpression(var: !926, expr: !DIExpression())
!926 = distinct !DIGlobalVariable(name: "____fmt", scope: !927, file: !3, line: 734, type: !940, isLocal: true, isDefinition: true)
!927 = distinct !DISubprogram(name: "__emit_kernel_encap_event_vxlan_encap", scope: !3, file: !3, line: 712, type: !928, scopeLine: 712, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !930)
!928 = !DISubroutineType(types: !929)
!929 = !{null, !122, !77}
!930 = !{!931, !932, !933, !934, !939}
!931 = !DILocalVariable(name: "udp", arg: 1, scope: !927, file: !3, line: 712, type: !122)
!932 = !DILocalVariable(name: "egress_ifindex", arg: 2, scope: !927, file: !3, line: 712, type: !77)
!933 = !DILocalVariable(name: "dptr", scope: !927, file: !3, line: 713, type: !905)
!934 = !DILocalVariable(name: "vxlan_event", scope: !927, file: !3, line: 723, type: !935)
!935 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_vxlan_exfil_event", file: !3, line: 117, size: 32, elements: !936)
!936 = !{!937, !938}
!937 = !DIDerivedType(tag: DW_TAG_member, name: "transport_dest_port", scope: !935, file: !3, line: 118, baseType: !62, size: 16)
!938 = !DIDerivedType(tag: DW_TAG_member, name: "transport_src_port", scope: !935, file: !3, line: 119, baseType: !62, size: 16, offset: 16)
!939 = !DILocalVariable(name: "res", scope: !927, file: !3, line: 727, type: !119)
!940 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 392, elements: !941)
!941 = !{!942}
!942 = !DISubrange(count: 49)
!943 = !DIGlobalVariableExpression(var: !944, expr: !DIExpression())
!944 = distinct !DIGlobalVariable(name: "____fmt", scope: !945, file: !3, line: 962, type: !589, isLocal: true, isDefinition: true)
!945 = distinct !DISubprogram(name: "__process_packet_clone_redirection_non_standard_port", scope: !3, file: !3, line: 947, type: !946, scopeLine: 947, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !948)
!946 = !DISubroutineType(types: !947)
!947 = !{!84, !249, !361, !62, !62}
!948 = !{!949, !950, !951, !952, !953, !954, !955, !956, !957, !958, !959, !960, !963}
!949 = !DILocalVariable(name: "skb", arg: 1, scope: !945, file: !3, line: 947, type: !249)
!950 = !DILocalVariable(name: "isUdp", arg: 2, scope: !945, file: !3, line: 947, type: !361)
!951 = !DILocalVariable(name: "__transport_dest_port", arg: 3, scope: !945, file: !3, line: 947, type: !62)
!952 = !DILocalVariable(name: "__transport_src_port", arg: 4, scope: !945, file: !3, line: 947, type: !62)
!953 = !DILocalVariable(name: "br_index", scope: !945, file: !3, line: 950, type: !77)
!954 = !DILocalVariable(name: "out", scope: !945, file: !3, line: 951, type: !77)
!955 = !DILocalVariable(name: "dest_addr_route", scope: !945, file: !3, line: 952, type: !102)
!956 = !DILocalVariable(name: "config", scope: !945, file: !3, line: 955, type: !467)
!957 = !DILocalVariable(name: "isTunnelC2CStandardUdpTransport", scope: !945, file: !3, line: 968, type: !361)
!958 = !DILocalVariable(name: "udp_dst_transfer_key", scope: !945, file: !3, line: 984, type: !62)
!959 = !DILocalVariable(name: "raw_pack", scope: !945, file: !3, line: 985, type: !722)
!960 = !DILocalVariable(name: "pack", scope: !961, file: !3, line: 987, type: !723)
!961 = distinct !DILexicalBlock(scope: !962, file: !3, line: 986, column: 19)
!962 = distinct !DILexicalBlock(scope: !945, file: !3, line: 986, column: 9)
!963 = !DILocalVariable(name: "re_scanned_packed_and_malicious", scope: !964, file: !3, line: 1010, type: !84)
!964 = distinct !DILexicalBlock(scope: !962, file: !3, line: 1008, column: 11)
!965 = !DIGlobalVariableExpression(var: !966, expr: !DIExpression())
!966 = distinct !DIGlobalVariable(name: "____fmt", scope: !945, file: !3, line: 995, type: !967, isLocal: true, isDefinition: true)
!967 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 576, elements: !968)
!968 = !{!969}
!969 = !DISubrange(count: 72)
!970 = !DIGlobalVariableExpression(var: !971, expr: !DIExpression())
!971 = distinct !DIGlobalVariable(name: "____fmt", scope: !972, file: !3, line: 917, type: !600, isLocal: true, isDefinition: true)
!972 = distinct !DISubprogram(name: "__clone_redirect_packet", scope: !3, file: !3, line: 912, type: !973, scopeLine: 912, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !975)
!973 = !DISubroutineType(types: !974)
!974 = !{!84, !249, !77, !102}
!975 = !{!976, !977, !978, !979, !980}
!976 = !DILocalVariable(name: "skb", arg: 1, scope: !972, file: !3, line: 912, type: !249)
!977 = !DILocalVariable(name: "br_index", arg: 2, scope: !972, file: !3, line: 912, type: !77)
!978 = !DILocalVariable(name: "dest_addr_route", arg: 3, scope: !972, file: !3, line: 912, type: !102)
!979 = !DILocalVariable(name: "current_dest_addr", scope: !972, file: !3, line: 914, type: !102)
!980 = !DILocalVariable(name: "csum_diff_drop", scope: !972, file: !3, line: 921, type: !77)
!981 = !DIGlobalVariableExpression(var: !982, expr: !DIExpression())
!982 = distinct !DIGlobalVariable(name: "bpf_clone_redirect", scope: !2, file: !573, line: 357, type: !983, isLocal: true, isDefinition: true)
!983 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !984)
!984 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !985, size: 64)
!985 = !DISubroutineType(types: !986)
!986 = !{!119, !249, !77, !211}
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(name: "____fmt", scope: !972, file: !3, line: 937, type: !989, isLocal: true, isDefinition: true)
!989 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 432, elements: !990)
!990 = !{!991}
!991 = !DISubrange(count: 54)
!992 = !DIGlobalVariableExpression(var: !993, expr: !DIExpression())
!993 = distinct !DIGlobalVariable(name: "____fmt", scope: !994, file: !3, line: 1290, type: !1007, isLocal: true, isDefinition: true)
!994 = distinct !DISubprogram(name: "__dns_rate_limit", scope: !3, file: !3, line: 1259, type: !995, scopeLine: 1259, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !997)
!995 = !DISubroutineType(types: !996)
!996 = !{!84, !362, !249, !77}
!997 = !{!998, !999, !1000, !1001, !1002, !1003, !1004}
!998 = !DILocalVariable(name: "cursor", arg: 1, scope: !994, file: !3, line: 1259, type: !362)
!999 = !DILocalVariable(name: "skb", arg: 2, scope: !994, file: !3, line: 1259, type: !249)
!1000 = !DILocalVariable(name: "dns_payload_size", arg: 3, scope: !994, file: !3, line: 1259, type: !77)
!1001 = !DILocalVariable(name: "key", scope: !994, file: !3, line: 1261, type: !62)
!1002 = !DILocalVariable(name: "ts", scope: !994, file: !3, line: 1262, type: !211)
!1003 = !DILocalVariable(name: "dns_volume_stats", scope: !994, file: !3, line: 1265, type: !816)
!1004 = !DILocalVariable(name: "stats", scope: !1005, file: !3, line: 1267, type: !817)
!1005 = distinct !DILexicalBlock(scope: !1006, file: !3, line: 1266, column: 28)
!1006 = distinct !DILexicalBlock(scope: !994, file: !3, line: 1266, column: 9)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !567, size: 416, elements: !1008)
!1008 = !{!1009}
!1009 = !DISubrange(count: 52)
!1010 = !{i32 7, !"Dwarf Version", i32 5}
!1011 = !{i32 2, !"Debug Info Version", i32 3}
!1012 = !{i32 1, !"wchar_size", i32 4}
!1013 = !{i32 7, !"frame-pointer", i32 2}
!1014 = !{i32 7, !"debug-info-assignment-tracking", i1 true}
!1015 = !{!"Ubuntu clang version 19.1.1 (1ubuntu1)"}
!1016 = distinct !DISubprogram(name: "configure_global_ipv6_route_handlers", scope: !235, file: !235, line: 123, type: !1017, scopeLine: 123, flags: DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1025)
!1017 = !DISubroutineType(types: !1018)
!1018 = !{!1019}
!1019 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1020, size: 64)
!1020 = !DIDerivedType(tag: DW_TAG_typedef, name: "inet6_bridge_address", file: !235, line: 119, baseType: !1021)
!1021 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "inet6_bridge_address", file: !235, line: 117, size: 256, elements: !1022)
!1022 = !{!1023}
!1023 = !DIDerivedType(tag: DW_TAG_member, name: "inet_addr", scope: !1021, file: !235, line: 118, baseType: !1024, size: 256)
!1024 = !DICompositeType(tag: DW_TAG_array_type, baseType: !187, size: 256, elements: !219)
!1025 = !{!1026}
!1026 = !DILocalVariable(name: "inet_addr_map", scope: !1016, file: !235, line: 124, type: !1020)
!1027 = distinct !DIAssignID()
!1028 = !DILocation(line: 0, scope: !1016)
!1029 = distinct !DIAssignID()
!1030 = distinct !DIAssignID()
!1031 = distinct !DIAssignID()
!1032 = distinct !DIAssignID()
!1033 = distinct !DIAssignID()
!1034 = distinct !DIAssignID()
!1035 = distinct !DIAssignID()
!1036 = distinct !DIAssignID()
!1037 = distinct !DIAssignID()
!1038 = distinct !DIAssignID()
!1039 = distinct !DIAssignID()
!1040 = !DILocation(line: 149, column: 5, scope: !1016)
!1041 = distinct !DIAssignID()
!1042 = !DILocalVariable(name: "label_key_subdomain_per_label_min", scope: !1043, file: !3, line: 627, type: !77)
!1043 = distinct !DILexicalBlock(scope: !1044, file: !3, line: 615, column: 26)
!1044 = distinct !DILexicalBlock(scope: !1045, file: !3, line: 615, column: 10)
!1045 = distinct !DILexicalBlock(scope: !1046, file: !3, line: 614, column: 23)
!1046 = distinct !DILexicalBlock(scope: !1047, file: !3, line: 614, column: 8)
!1047 = distinct !DISubprogram(name: "parse_dns_payload_memsafet_payload_transport_tcp", scope: !3, file: !3, line: 584, type: !396, scopeLine: 585, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !1048)
!1048 = !{!1049, !1050, !1051, !1052, !1065, !1066, !1067, !1068, !1069, !1070, !1042, !1071, !1072, !1073, !1074, !1075, !1076, !1077, !1078, !1079, !1081, !1084, !1085, !1086, !1087, !1089, !1092, !1093, !1094}
!1049 = !DILocalVariable(name: "skb", arg: 1, scope: !1047, file: !3, line: 584, type: !362)
!1050 = !DILocalVariable(name: "dns_payload", arg: 2, scope: !1047, file: !3, line: 584, type: !65)
