; ModuleID = 'dns_tc.c'
source_filename = "dns_tc.c"
target datalayout = "e-m:e-p:64:64-i64:64-i128:128-n32:64-S128"
target triple = "bpf"

%struct.qtypes = type { i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8, i8 }
%struct.dns_record_limits_malicious = type { i32, i32, i32, i32, i32, i32, i32, i32 }
%struct.exfil_security_config_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_dns_limites = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egrees_redirect_ring_buff_non_standard_port = type { ptr, ptr }
%struct.exfil_vxlan_block_egress_port = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_vxlan_encap_drop = type { ptr, ptr }
%struct.exfil_security_egress_reconnisance_map_scan = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_protocols_identifier_maps = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redurect_ts_verify = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_loop_time = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_count_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_redirect_drop_count_map = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_vxlan_dns_transport = type { ptr, ptr, ptr, ptr }
%struct.exfil_security_egress_rate_limit_map = type { ptr, ptr, ptr, ptr }
%struct.kernel_handler_map = type { ptr, ptr, ptr, ptr, ptr }
%struct.inet6_bridge_address = type { [2 x %struct.in6_addr] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "qtypes", scope: !2, file: !44, line: 68, type: !402, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C11, file: !3, producer: "Ubuntu clang version 19.1.1 (1ubuntu1)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !61, globals: !213, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "dns_tc.c", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "53b70d74442677f0fff6129fbba8f4c7")
!4 = !{!5, !39, !43, !49, !55}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 29, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/linux/in.h", directory: "", checksumkind: CSK_MD5, checksum: "9c2bb8c4aeb4064bd816bf98027ba7c1")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35, !36, !37, !38}
!9 = !DIEnumerator(name: "IPPROTO_IP", value: 0)
!10 = !DIEnumerator(name: "IPPROTO_ICMP", value: 1)
!11 = !DIEnumerator(name: "IPPROTO_IGMP", value: 2)
!12 = !DIEnumerator(name: "IPPROTO_IPIP", value: 4)
!13 = !DIEnumerator(name: "IPPROTO_TCP", value: 6)
!14 = !DIEnumerator(name: "IPPROTO_EGP", value: 8)
!15 = !DIEnumerator(name: "IPPROTO_PUP", value: 12)
!16 = !DIEnumerator(name: "IPPROTO_UDP", value: 17)
!17 = !DIEnumerator(name: "IPPROTO_IDP", value: 22)
!18 = !DIEnumerator(name: "IPPROTO_TP", value: 29)
!19 = !DIEnumerator(name: "IPPROTO_DCCP", value: 33)
!20 = !DIEnumerator(name: "IPPROTO_IPV6", value: 41)
!21 = !DIEnumerator(name: "IPPROTO_RSVP", value: 46)
!22 = !DIEnumerator(name: "IPPROTO_GRE", value: 47)
!23 = !DIEnumerator(name: "IPPROTO_ESP", value: 50)
!24 = !DIEnumerator(name: "IPPROTO_AH", value: 51)
!25 = !DIEnumerator(name: "IPPROTO_MTP", value: 92)
!26 = !DIEnumerator(name: "IPPROTO_BEETPH", value: 94)
!27 = !DIEnumerator(name: "IPPROTO_ENCAP", value: 98)
!28 = !DIEnumerator(name: "IPPROTO_PIM", value: 103)
!29 = !DIEnumerator(name: "IPPROTO_COMP", value: 108)
!30 = !DIEnumerator(name: "IPPROTO_L2TP", value: 115)
!31 = !DIEnumerator(name: "IPPROTO_SCTP", value: 132)
!32 = !DIEnumerator(name: "IPPROTO_UDPLITE", value: 136)
!33 = !DIEnumerator(name: "IPPROTO_MPLS", value: 137)
!34 = !DIEnumerator(name: "IPPROTO_ETHERNET", value: 143)
!35 = !DIEnumerator(name: "IPPROTO_RAW", value: 255)
!36 = !DIEnumerator(name: "IPPROTO_SMC", value: 256)
!37 = !DIEnumerator(name: "IPPROTO_MPTCP", value: 262)
!38 = !DIEnumerator(name: "IPPROTO_MAX", value: 263)
!39 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 6050, baseType: !7, size: 32, elements: !41)
!40 = !DIFile(filename: "/usr/include/linux/bpf.h", directory: "", checksumkind: CSK_MD5, checksum: "eec04c95b9f59f758a8270a58c2ff5f6")
!41 = !{!42}
!42 = !DIEnumerator(name: "BPF_F_INGRESS", value: 1)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "MALICIOUS_FLAGS", file: !44, line: 16, baseType: !7, size: 32, elements: !45)
!44 = !DIFile(filename: "./dns.h", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "c6d8cc9cca8d4cfda48bb78b1aba6ebe")
!45 = !{!46, !47, !48}
!46 = !DIEnumerator(name: "BENIGN", value: 0)
!47 = !DIEnumerator(name: "SUSPICIOUS", value: 1)
!48 = !DIEnumerator(name: "MALICIOUS", value: 2)
!49 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 1349, baseType: !7, size: 32, elements: !50)
!50 = !{!51, !52, !53, !54}
!51 = !DIEnumerator(name: "BPF_ANY", value: 0)
!52 = !DIEnumerator(name: "BPF_NOEXIST", value: 1)
!53 = !DIEnumerator(name: "BPF_EXIST", value: 2)
!54 = !DIEnumerator(name: "BPF_F_LOCK", value: 4)
!55 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !40, line: 6156, baseType: !7, size: 32, elements: !56)
!56 = !{!57, !58, !59, !60}
!57 = !DIEnumerator(name: "BPF_RB_AVAIL_DATA", value: 0)
!58 = !DIEnumerator(name: "BPF_RB_RING_SIZE", value: 1)
!59 = !DIEnumerator(name: "BPF_RB_CONS_POS", value: 2)
!60 = !DIEnumerator(name: "BPF_RB_PROD_POS", value: 3)
!61 = !{!62, !65, !66, !77, !78, !79, !109, !119, !120, !121, !122, !84, !130, !136, !146, !167, !211}
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u16", file: !63, line: 24, baseType: !64)
!63 = !DIFile(filename: "/usr/include/asm-generic/int-ll64.h", directory: "", checksumkind: CSK_MD5, checksum: "b810f270733e106319b67ef512c6246e")
!64 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_header", file: !44, line: 85, size: 96, elements: !68)
!68 = !{!69, !70, !71, !74, !75, !76}
!69 = !DIDerivedType(tag: DW_TAG_member, name: "transaction_id", scope: !67, file: !44, line: 86, baseType: !62, size: 16)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !67, file: !44, line: 87, baseType: !62, size: 16, offset: 16)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "qd_count", scope: !67, file: !44, line: 89, baseType: !72, size: 16, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be16", file: !73, line: 32, baseType: !62)
!73 = !DIFile(filename: "/usr/include/linux/types.h", directory: "", checksumkind: CSK_MD5, checksum: "bf9fbc0e8f60927fef9d8917535375a6")
!74 = !DIDerivedType(tag: DW_TAG_member, name: "ans_count", scope: !67, file: !44, line: 90, baseType: !72, size: 16, offset: 48)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "auth_count", scope: !67, file: !44, line: 91, baseType: !72, size: 16, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "add_count", scope: !67, file: !44, line: 92, baseType: !72, size: 16, offset: 80)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u32", file: !63, line: 27, baseType: !7)
!78 = !DIBasicType(name: "unsigned long", size: 64, encoding: DW_ATE_unsigned)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "iphdr", file: !81, line: 87, size: 160, elements: !82)
!81 = !DIFile(filename: "/usr/include/linux/ip.h", directory: "", checksumkind: CSK_MD5, checksum: "149778ace30a1ff208adc8783fd04b29")
!82 = !{!83, !86, !87, !88, !89, !90, !91, !92, !93, !95}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "ihl", scope: !80, file: !81, line: 89, baseType: !84, size: 4, flags: DIFlagBitField, extraData: i64 0)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u8", file: !63, line: 21, baseType: !85)
!85 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !80, file: !81, line: 90, baseType: !84, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "tos", scope: !80, file: !81, line: 97, baseType: !84, size: 8, offset: 8)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "tot_len", scope: !80, file: !81, line: 98, baseType: !72, size: 16, offset: 16)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !80, file: !81, line: 99, baseType: !72, size: 16, offset: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "frag_off", scope: !80, file: !81, line: 100, baseType: !72, size: 16, offset: 48)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "ttl", scope: !80, file: !81, line: 101, baseType: !84, size: 8, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !80, file: !81, line: 102, baseType: !84, size: 8, offset: 72)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !80, file: !81, line: 103, baseType: !94, size: 16, offset: 80)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sum16", file: !73, line: 38, baseType: !62)
!95 = !DIDerivedType(tag: DW_TAG_member, scope: !80, file: !81, line: 104, baseType: !96, size: 64, offset: 96)
!96 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !80, file: !81, line: 104, size: 64, elements: !97)
!97 = !{!98, !104}
!98 = !DIDerivedType(tag: DW_TAG_member, scope: !96, file: !81, line: 104, baseType: !99, size: 64)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !81, line: 104, size: 64, elements: !100)
!100 = !{!101, !103}
!101 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !99, file: !81, line: 104, baseType: !102, size: 32)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__be32", file: !73, line: 34, baseType: !77)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !99, file: !81, line: 104, baseType: !102, size: 32, offset: 32)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !96, file: !81, line: 104, baseType: !105, size: 64)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !96, file: !81, line: 104, size: 64, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !105, file: !81, line: 104, baseType: !102, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !105, file: !81, line: 104, baseType: !102, size: 32, offset: 32)
!109 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !110, size: 64)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_header_tcp", file: !44, line: 95, size: 112, elements: !111)
!111 = !{!112, !113, !114, !115, !116, !117, !118}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !110, file: !44, line: 96, baseType: !62, size: 16)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "transaction_id", scope: !110, file: !44, line: 97, baseType: !62, size: 16, offset: 16)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !110, file: !44, line: 98, baseType: !62, size: 16, offset: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "qd_count", scope: !110, file: !44, line: 99, baseType: !72, size: 16, offset: 48)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ans_count", scope: !110, file: !44, line: 100, baseType: !72, size: 16, offset: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "auth_count", scope: !110, file: !44, line: 101, baseType: !72, size: 16, offset: 80)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "add_count", scope: !110, file: !44, line: 102, baseType: !72, size: 16, offset: 96)
!119 = !DIBasicType(name: "long", size: 64, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "udphdr", file: !124, line: 23, size: 64, elements: !125)
!124 = !DIFile(filename: "/usr/include/linux/udp.h", directory: "", checksumkind: CSK_MD5, checksum: "40b541977cf3a9ce2b2728b52f4091a4")
!125 = !{!126, !127, !128, !129}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !123, file: !124, line: 24, baseType: !72, size: 16)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !123, file: !124, line: 25, baseType: !72, size: 16, offset: 16)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !123, file: !124, line: 26, baseType: !72, size: 16, offset: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !123, file: !124, line: 27, baseType: !94, size: 16, offset: 48)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vxlanhdr", file: !132, line: 23, size: 64, elements: !133)
!132 = !DIFile(filename: "./vxlan.h", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "a6627392fe2b463cf34ba0788b5987a2")
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "vx_flags", scope: !131, file: !132, line: 24, baseType: !77, size: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "vx_vni", scope: !131, file: !132, line: 25, baseType: !77, size: 32, offset: 32)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ethhdr", file: !138, line: 173, size: 112, elements: !139)
!138 = !DIFile(filename: "/usr/include/linux/if_ether.h", directory: "", checksumkind: CSK_MD5, checksum: "163f54fb1af2e21fea410f14eb18fa76")
!139 = !{!140, !144, !145}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "h_dest", scope: !137, file: !138, line: 174, baseType: !141, size: 48)
!141 = !DICompositeType(tag: DW_TAG_array_type, baseType: !85, size: 48, elements: !142)
!142 = !{!143}
!143 = !DISubrange(count: 6)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "h_source", scope: !137, file: !138, line: 175, baseType: !141, size: 48, offset: 48)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "h_proto", scope: !137, file: !138, line: 176, baseType: !72, size: 16, offset: 96)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tcphdr", file: !148, line: 25, size: 160, elements: !149)
!148 = !DIFile(filename: "/usr/include/linux/tcp.h", directory: "", checksumkind: CSK_MD5, checksum: "1aa35012f509549bad9f3decb5d3e7a2")
!149 = !{!150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166}
!150 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !147, file: !148, line: 26, baseType: !72, size: 16)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "dest", scope: !147, file: !148, line: 27, baseType: !72, size: 16, offset: 16)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "seq", scope: !147, file: !148, line: 28, baseType: !102, size: 32, offset: 32)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "ack_seq", scope: !147, file: !148, line: 29, baseType: !102, size: 32, offset: 64)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "res1", scope: !147, file: !148, line: 31, baseType: !62, size: 4, offset: 96, flags: DIFlagBitField, extraData: i64 96)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "doff", scope: !147, file: !148, line: 32, baseType: !62, size: 4, offset: 100, flags: DIFlagBitField, extraData: i64 96)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "fin", scope: !147, file: !148, line: 33, baseType: !62, size: 1, offset: 104, flags: DIFlagBitField, extraData: i64 96)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "syn", scope: !147, file: !148, line: 34, baseType: !62, size: 1, offset: 105, flags: DIFlagBitField, extraData: i64 96)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "rst", scope: !147, file: !148, line: 35, baseType: !62, size: 1, offset: 106, flags: DIFlagBitField, extraData: i64 96)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "psh", scope: !147, file: !148, line: 36, baseType: !62, size: 1, offset: 107, flags: DIFlagBitField, extraData: i64 96)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "ack", scope: !147, file: !148, line: 37, baseType: !62, size: 1, offset: 108, flags: DIFlagBitField, extraData: i64 96)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "urg", scope: !147, file: !148, line: 38, baseType: !62, size: 1, offset: 109, flags: DIFlagBitField, extraData: i64 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ece", scope: !147, file: !148, line: 39, baseType: !62, size: 1, offset: 110, flags: DIFlagBitField, extraData: i64 96)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "cwr", scope: !147, file: !148, line: 40, baseType: !62, size: 1, offset: 111, flags: DIFlagBitField, extraData: i64 96)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "window", scope: !147, file: !148, line: 55, baseType: !72, size: 16, offset: 112)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !147, file: !148, line: 56, baseType: !94, size: 16, offset: 128)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "urg_ptr", scope: !147, file: !148, line: 57, baseType: !72, size: 16, offset: 144)
!167 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !168, size: 64)
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6hdr", file: !169, line: 118, size: 320, elements: !170)
!169 = !DIFile(filename: "/usr/include/linux/ipv6.h", directory: "", checksumkind: CSK_MD5, checksum: "d288e308e142e51c48e7422f4fbbaa3f")
!170 = !{!171, !172, !173, !177, !178, !179, !180}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !168, file: !169, line: 120, baseType: !84, size: 4, flags: DIFlagBitField, extraData: i64 0)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !168, file: !169, line: 121, baseType: !84, size: 4, offset: 4, flags: DIFlagBitField, extraData: i64 0)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "flow_lbl", scope: !168, file: !169, line: 128, baseType: !174, size: 24, offset: 8)
!174 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 24, elements: !175)
!175 = !{!176}
!176 = !DISubrange(count: 3)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "payload_len", scope: !168, file: !169, line: 130, baseType: !72, size: 16, offset: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "nexthdr", scope: !168, file: !169, line: 131, baseType: !84, size: 8, offset: 48)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "hop_limit", scope: !168, file: !169, line: 132, baseType: !84, size: 8, offset: 56)
!180 = !DIDerivedType(tag: DW_TAG_member, scope: !168, file: !169, line: 134, baseType: !181, size: 256, offset: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !168, file: !169, line: 134, size: 256, elements: !182)
!182 = !{!183, !206}
!183 = !DIDerivedType(tag: DW_TAG_member, scope: !181, file: !169, line: 134, baseType: !184, size: 256)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !181, file: !169, line: 134, size: 256, elements: !185)
!185 = !{!186, !205}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !184, file: !169, line: 134, baseType: !187, size: 128)
!187 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", file: !188, line: 33, size: 128, elements: !189)
!188 = !DIFile(filename: "/usr/include/linux/in6.h", directory: "", checksumkind: CSK_MD5, checksum: "fca1889f0274df066e49cf4d8db8011e")
!189 = !{!190}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "in6_u", scope: !187, file: !188, line: 40, baseType: !191, size: 128)
!191 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !187, file: !188, line: 34, size: 128, elements: !192)
!192 = !{!193, !197, !201}
!193 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr8", scope: !191, file: !188, line: 35, baseType: !194, size: 128)
!194 = !DICompositeType(tag: DW_TAG_array_type, baseType: !84, size: 128, elements: !195)
!195 = !{!196}
!196 = !DISubrange(count: 16)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr16", scope: !191, file: !188, line: 37, baseType: !198, size: 128)
!198 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 128, elements: !199)
!199 = !{!200}
!200 = !DISubrange(count: 8)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "u6_addr32", scope: !191, file: !188, line: 38, baseType: !202, size: 128)
!202 = !DICompositeType(tag: DW_TAG_array_type, baseType: !102, size: 128, elements: !203)
!203 = !{!204}
!204 = !DISubrange(count: 4)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !184, file: !169, line: 134, baseType: !187, size: 128, offset: 128)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "addrs", scope: !181, file: !169, line: 134, baseType: !207, size: 256)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !181, file: !169, line: 134, size: 256, elements: !208)
!208 = !{!209, !210}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "saddr", scope: !207, file: !169, line: 134, baseType: !187, size: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "daddr", scope: !207, file: !169, line: 134, baseType: !187, size: 128, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "__u64", file: !63, line: 31, baseType: !212)
!212 = !DIBasicType(name: "unsigned long long", size: 64, encoding: DW_ATE_unsigned)
!213 = !{!0, !214, !221, !233, !236, !238, !240, !242, !244, !569, !577, !585, !590, !596, !601, !611, !617, !623, !629, !634, !639, !641, !643, !645, !647, !649, !651, !656, !658, !673, !687, !703, !713, !732, !740, !752, !765, !775, !783, !791, !799, !807, !820, !829, !844, !850, !856, !862, !868, !874, !880, !894, !905, !911, !919, !921, !939, !966, !971, !975, !980, !982, !985, !987, !989, !994, !996, !1001, !1003, !1005, !1008, !1010, !1012, !1017, !1019, !1024, !1029, !1034, !1036, !1038, !1041, !1049, !1060, !1066, !1071}
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "valid_opcodes", scope: !2, file: !44, line: 106, type: !216, isLocal: false, isDefinition: true)
!216 = !DICompositeType(tag: DW_TAG_array_type, baseType: !217, size: 64, elements: !219)
!217 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !218)
!218 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!219 = !{!220}
!220 = !DISubrange(count: 2)
!221 = !DIGlobalVariableExpression(var: !222, expr: !DIExpression())
!222 = distinct !DIGlobalVariable(name: "DNS_RECORD_LIMITS", scope: !2, file: !44, line: 224, type: !223, isLocal: false, isDefinition: true)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_record_limits_malicious", file: !44, line: 208, size: 256, elements: !224)
!224 = !{!225, !226, !227, !228, !229, !230, !231, !232}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_DOMAIN_LENGTH", scope: !223, file: !44, line: 209, baseType: !77, size: 32)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_DOMAIN_LENGTH", scope: !223, file: !44, line: 210, baseType: !77, size: 32, offset: 32)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_SUBDOMAIN_LENGTH_PER_LABEL", scope: !223, file: !44, line: 213, baseType: !77, size: 32, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_SUBDOMAIN_LENGTH_PER_LABEL", scope: !223, file: !44, line: 214, baseType: !77, size: 32, offset: 96)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_LABEL_COUNT", scope: !223, file: !44, line: 217, baseType: !77, size: 32, offset: 128)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_LABEL_COUNT", scope: !223, file: !44, line: 218, baseType: !77, size: 32, offset: 160)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "MIN_SUBDOMAIN_LENGTH_EXCLUDING_TLD", scope: !223, file: !44, line: 221, baseType: !77, size: 32, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_SUBDOMAIN_LENGTH_EXCLUDING_TLD", scope: !223, file: !44, line: 222, baseType: !77, size: 32, offset: 224)
!233 = !DIGlobalVariableExpression(var: !234, expr: !DIExpression())
!234 = distinct !DIGlobalVariable(name: "redirect_skb_mark", scope: !2, file: !235, line: 60, type: !77, isLocal: false, isDefinition: true)
!235 = !DIFile(filename: "./consts.h", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "23435a748b8553c58f2f4a7d9fa3fe48")
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "bridge_redirect_addr_ipv6_suspicious", scope: !2, file: !235, line: 72, type: !187, isLocal: false, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "bridge_redirect_addr_ipv6_malicious", scope: !2, file: !235, line: 86, type: !187, isLocal: false, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "bridge_redirect_addr_ipv6_malicious_tunnel", scope: !2, file: !235, line: 100, type: !187, isLocal: false, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "INSECURE", scope: !2, file: !3, line: 103, type: !77, isLocal: false, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1511, type: !564, isLocal: true, isDefinition: true)
!246 = distinct !DISubprogram(name: "classify", scope: !3, file: !3, line: 1426, type: !247, scopeLine: 1426, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !342)
!247 = !DISubroutineType(types: !248)
!248 = !{!218, !249}
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__sk_buff", file: !40, line: 6229, size: 1536, elements: !251)
!251 = !{!252, !253, !254, !255, !256, !257, !258, !259, !260, !261, !262, !263, !264, !268, !269, !270, !271, !272, !273, !274, !275, !276, !278, !279, !280, !281, !282, !314, !315, !316, !317, !339, !340, !341}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !250, file: !40, line: 6230, baseType: !77, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "pkt_type", scope: !250, file: !40, line: 6231, baseType: !77, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !250, file: !40, line: 6232, baseType: !77, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "queue_mapping", scope: !250, file: !40, line: 6233, baseType: !77, size: 32, offset: 96)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !250, file: !40, line: 6234, baseType: !77, size: 32, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_present", scope: !250, file: !40, line: 6235, baseType: !77, size: 32, offset: 160)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_tci", scope: !250, file: !40, line: 6236, baseType: !77, size: 32, offset: 192)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "vlan_proto", scope: !250, file: !40, line: 6237, baseType: !77, size: 32, offset: 224)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !250, file: !40, line: 6238, baseType: !77, size: 32, offset: 256)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "ingress_ifindex", scope: !250, file: !40, line: 6239, baseType: !77, size: 32, offset: 288)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "ifindex", scope: !250, file: !40, line: 6240, baseType: !77, size: 32, offset: 320)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tc_index", scope: !250, file: !40, line: 6241, baseType: !77, size: 32, offset: 352)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "cb", scope: !250, file: !40, line: 6242, baseType: !265, size: 160, offset: 384)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 160, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 5)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !250, file: !40, line: 6243, baseType: !77, size: 32, offset: 544)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "tc_classid", scope: !250, file: !40, line: 6244, baseType: !77, size: 32, offset: 576)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !250, file: !40, line: 6245, baseType: !77, size: 32, offset: 608)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !250, file: !40, line: 6246, baseType: !77, size: 32, offset: 640)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "napi_id", scope: !250, file: !40, line: 6247, baseType: !77, size: 32, offset: 672)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !250, file: !40, line: 6250, baseType: !77, size: 32, offset: 704)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip4", scope: !250, file: !40, line: 6251, baseType: !77, size: 32, offset: 736)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip4", scope: !250, file: !40, line: 6252, baseType: !77, size: 32, offset: 768)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "remote_ip6", scope: !250, file: !40, line: 6253, baseType: !277, size: 128, offset: 800)
!277 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 128, elements: !203)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "local_ip6", scope: !250, file: !40, line: 6254, baseType: !277, size: 128, offset: 928)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "remote_port", scope: !250, file: !40, line: 6255, baseType: !77, size: 32, offset: 1056)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "local_port", scope: !250, file: !40, line: 6256, baseType: !77, size: 32, offset: 1088)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "data_meta", scope: !250, file: !40, line: 6259, baseType: !77, size: 32, offset: 1120)
!282 = !DIDerivedType(tag: DW_TAG_member, scope: !250, file: !40, line: 6260, baseType: !283, size: 64, align: 64, offset: 1152)
!283 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !250, file: !40, line: 6260, size: 64, align: 64, elements: !284)
!284 = !{!285}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "flow_keys", scope: !283, file: !40, line: 6260, baseType: !286, size: 64)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_flow_keys", file: !40, line: 7271, size: 448, elements: !288)
!288 = !{!289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !312, !313}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "nhoff", scope: !287, file: !40, line: 7272, baseType: !62, size: 16)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "thoff", scope: !287, file: !40, line: 7273, baseType: !62, size: 16, offset: 16)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "addr_proto", scope: !287, file: !40, line: 7274, baseType: !62, size: 16, offset: 32)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "is_frag", scope: !287, file: !40, line: 7275, baseType: !84, size: 8, offset: 48)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "is_first_frag", scope: !287, file: !40, line: 7276, baseType: !84, size: 8, offset: 56)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "is_encap", scope: !287, file: !40, line: 7277, baseType: !84, size: 8, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "ip_proto", scope: !287, file: !40, line: 7278, baseType: !84, size: 8, offset: 72)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "n_proto", scope: !287, file: !40, line: 7279, baseType: !72, size: 16, offset: 80)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "sport", scope: !287, file: !40, line: 7280, baseType: !72, size: 16, offset: 96)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "dport", scope: !287, file: !40, line: 7281, baseType: !72, size: 16, offset: 112)
!299 = !DIDerivedType(tag: DW_TAG_member, scope: !287, file: !40, line: 7282, baseType: !300, size: 256, offset: 128)
!300 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !287, file: !40, line: 7282, size: 256, elements: !301)
!301 = !{!302, !307}
!302 = !DIDerivedType(tag: DW_TAG_member, scope: !300, file: !40, line: 7283, baseType: !303, size: 64)
!303 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !300, file: !40, line: 7283, size: 64, elements: !304)
!304 = !{!305, !306}
!305 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_src", scope: !303, file: !40, line: 7284, baseType: !102, size: 32)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ipv4_dst", scope: !303, file: !40, line: 7285, baseType: !102, size: 32, offset: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, scope: !300, file: !40, line: 7287, baseType: !308, size: 256)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !300, file: !40, line: 7287, size: 256, elements: !309)
!309 = !{!310, !311}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_src", scope: !308, file: !40, line: 7288, baseType: !277, size: 128)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6_dst", scope: !308, file: !40, line: 7289, baseType: !277, size: 128, offset: 128)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !287, file: !40, line: 7292, baseType: !77, size: 32, offset: 384)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "flow_label", scope: !287, file: !40, line: 7293, baseType: !102, size: 32, offset: 416)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp", scope: !250, file: !40, line: 6261, baseType: !211, size: 64, offset: 1216)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "wire_len", scope: !250, file: !40, line: 6262, baseType: !77, size: 32, offset: 1280)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "gso_segs", scope: !250, file: !40, line: 6263, baseType: !77, size: 32, offset: 1312)
!317 = !DIDerivedType(tag: DW_TAG_member, scope: !250, file: !40, line: 6264, baseType: !318, size: 64, align: 64, offset: 1344)
!318 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !250, file: !40, line: 6264, size: 64, align: 64, elements: !319)
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "sk", scope: !318, file: !40, line: 6264, baseType: !321, size: 64)
!321 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !322, size: 64)
!322 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_sock", file: !40, line: 6333, size: 640, elements: !323)
!323 = !{!324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!324 = !DIDerivedType(tag: DW_TAG_member, name: "bound_dev_if", scope: !322, file: !40, line: 6334, baseType: !77, size: 32)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "family", scope: !322, file: !40, line: 6335, baseType: !77, size: 32, offset: 32)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !322, file: !40, line: 6336, baseType: !77, size: 32, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !322, file: !40, line: 6337, baseType: !77, size: 32, offset: 96)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "mark", scope: !322, file: !40, line: 6338, baseType: !77, size: 32, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !322, file: !40, line: 6339, baseType: !77, size: 32, offset: 160)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip4", scope: !322, file: !40, line: 6341, baseType: !77, size: 32, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "src_ip6", scope: !322, file: !40, line: 6342, baseType: !277, size: 128, offset: 224)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !322, file: !40, line: 6343, baseType: !77, size: 32, offset: 352)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !322, file: !40, line: 6344, baseType: !72, size: 16, offset: 384)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip4", scope: !322, file: !40, line: 6346, baseType: !77, size: 32, offset: 416)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "dst_ip6", scope: !322, file: !40, line: 6347, baseType: !277, size: 128, offset: 448)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !322, file: !40, line: 6348, baseType: !77, size: 32, offset: 576)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "rx_queue_mapping", scope: !322, file: !40, line: 6349, baseType: !338, size: 32, offset: 608)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s32", file: !63, line: 26, baseType: !218)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "gso_size", scope: !250, file: !40, line: 6265, baseType: !77, size: 32, offset: 1408)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "tstamp_type", scope: !250, file: !40, line: 6266, baseType: !84, size: 8, offset: 1440)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "hwtstamp", scope: !250, file: !40, line: 6268, baseType: !211, size: 64, offset: 1472)
!342 = !{!343, !344, !354, !426, !427, !428, !429, !430, !431, !432, !433, !441, !442, !447, !448, !449, !450, !453, !454, !455, !462, !463, !464, !465, !466, !474, !475, !478, !482, !483, !484, !490, !491, !494, !497, !498, !499, !500, !501, !502, !503, !504, !505, !506, !509, !513, !514, !515, !516, !517, !518, !521, !522, !527, !528, !529, !530, !533, !534, !535, !536, !537, !540, !541, !542, !543, !544, !545, !548, !551, !552, !553, !554, !555, !556, !557, !558, !559, !560, !561}
!343 = !DILocalVariable(name: "skb", arg: 1, scope: !246, file: !3, line: 1426, type: !249)
!344 = !DILocalVariable(name: "cursor", scope: !246, file: !3, line: 1428, type: !345)
!345 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "skb_cursor", file: !3, line: 60, size: 192, elements: !346)
!346 = !{!347, !348, !349}
!347 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !345, file: !3, line: 61, baseType: !65, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "data_end", scope: !345, file: !3, line: 62, baseType: !65, size: 64, offset: 64)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "lock", scope: !345, file: !3, line: 63, baseType: !350, size: 64, offset: 128)
!350 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !351, size: 64)
!351 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_spin_lock", file: !40, line: 7311, size: 32, elements: !352)
!352 = !{!353}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !351, file: !40, line: 7312, baseType: !77, size: 32)
!354 = !DILocalVariable(name: "actions", scope: !246, file: !3, line: 1429, type: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "packet_actions", file: !3, line: 72, size: 960, elements: !356)
!356 = !{!357, !363, !367, !371, !372, !373, !377, !378, !382, !386, !390, !394, !398, !418, !422}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "cursor_init", scope: !355, file: !3, line: 73, baseType: !358, size: 64)
!358 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !359, size: 64)
!359 = !DISubroutineType(types: !360)
!360 = !{!361, !362, !249}
!361 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !345, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "packet_class_action", scope: !355, file: !3, line: 74, baseType: !364, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64)
!365 = !DISubroutineType(types: !366)
!366 = !{!355, !355}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "parse_eth", scope: !355, file: !3, line: 76, baseType: !368, size: 64, offset: 128)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64)
!369 = !DISubroutineType(types: !370)
!370 = !{!84, !362}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "parse_ipv4", scope: !355, file: !3, line: 78, baseType: !368, size: 64, offset: 192)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "parse_ipv6", scope: !355, file: !3, line: 79, baseType: !368, size: 64, offset: 256)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "parse_udp", scope: !355, file: !3, line: 81, baseType: !374, size: 64, offset: 320)
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DISubroutineType(types: !376)
!376 = !{!84, !362, !361}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "parse_tcp", scope: !355, file: !3, line: 82, baseType: !374, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_header_size", scope: !355, file: !3, line: 88, baseType: !379, size: 64, offset: 448)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!84, !362, !361, !361}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_transport_udp", scope: !355, file: !3, line: 89, baseType: !383, size: 64, offset: 512)
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DISubroutineType(types: !385)
!385 = !{!84, !362, !65, !77, !77, !66, !77}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_transport_tcp", scope: !355, file: !3, line: 90, baseType: !387, size: 64, offset: 576)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DISubroutineType(types: !389)
!389 = !{!84, !362, !65, !109, !77}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_memsafet_payload", scope: !355, file: !3, line: 92, baseType: !391, size: 64, offset: 640)
!391 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !392, size: 64)
!392 = !DISubroutineType(types: !393)
!393 = !{!84, !362, !65, !66}
!394 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_memsafet_payload_transport_tcp", scope: !355, file: !3, line: 93, baseType: !395, size: 64, offset: 704)
!395 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !396, size: 64)
!396 = !DISubroutineType(types: !397)
!397 = !{!84, !362, !65, !109}
!398 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_queries_section", scope: !355, file: !3, line: 96, baseType: !399, size: 64, offset: 768)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DISubroutineType(types: !401)
!401 = !{!84, !362, !62, !402}
!402 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "qtypes", file: !44, line: 65, size: 112, elements: !403)
!403 = !{!404, !405, !406, !407, !408, !409, !410, !411, !412, !413, !414, !415, !416, !417}
!404 = !DIDerivedType(tag: DW_TAG_member, name: "A", scope: !402, file: !44, line: 66, baseType: !84, size: 8)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "NS", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 8)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "CNAME", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 16)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "SOA", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 24)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "PTR", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "MX", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 40)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "TXT", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 48)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "AAAA", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 56)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "SRV", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "NAPTR", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 72)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "OPT", scope: !402, file: !44, line: 66, baseType: !84, size: 8, offset: 80)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "HTTPS", scope: !402, file: !44, line: 67, baseType: !84, size: 8, offset: 88)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ANY", scope: !402, file: !44, line: 67, baseType: !84, size: 8, offset: 96)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "NULL_TYPE", scope: !402, file: !44, line: 67, baseType: !84, size: 8, offset: 104)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_non_standard_port", scope: !355, file: !3, line: 99, baseType: !419, size: 64, offset: 832)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64)
!420 = !DISubroutineType(types: !421)
!421 = !{!84, !362, !249, !65, !66, !122}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "parse_dns_payload_non_standard_port_tcp", scope: !355, file: !3, line: 100, baseType: !423, size: 64, offset: 896)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !424, size: 64)
!424 = !DISubroutineType(types: !425)
!425 = !{!84, !362, !249, !65, !109}
!426 = !DILocalVariable(name: "eth", scope: !246, file: !3, line: 1434, type: !136)
!427 = !DILocalVariable(name: "ip", scope: !246, file: !3, line: 1435, type: !79)
!428 = !DILocalVariable(name: "ipv6", scope: !246, file: !3, line: 1436, type: !167)
!429 = !DILocalVariable(name: "nhoff", scope: !246, file: !3, line: 1442, type: !77)
!430 = !DILocalVariable(name: "udp", scope: !246, file: !3, line: 1453, type: !122)
!431 = !DILocalVariable(name: "tcp", scope: !246, file: !3, line: 1453, type: !146)
!432 = !DILocalVariable(name: "hproto", scope: !246, file: !3, line: 1455, type: !72)
!433 = !DILocalVariable(name: "vlan", scope: !434, file: !3, line: 1458, type: !436)
!434 = distinct !DILexicalBlock(scope: !435, file: !3, line: 1457, column: 92)
!435 = distinct !DILexicalBlock(scope: !246, file: !3, line: 1457, column: 9)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "vlan_hdr", file: !3, line: 67, size: 32, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_TCI", scope: !437, file: !3, line: 68, baseType: !72, size: 16)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "h_vlan_encapsulated_proto", scope: !437, file: !3, line: 69, baseType: !72, size: 16, offset: 16)
!441 = !DILocalVariable(name: "isEncapL2", scope: !246, file: !3, line: 1470, type: !361)
!442 = !DILocalVariable(name: "udp_data", scope: !443, file: !3, line: 1483, type: !65)
!443 = distinct !DILexicalBlock(scope: !444, file: !3, line: 1479, column: 42)
!444 = distinct !DILexicalBlock(scope: !445, file: !3, line: 1479, column: 13)
!445 = distinct !DILexicalBlock(scope: !446, file: !3, line: 1472, column: 40)
!446 = distinct !DILexicalBlock(scope: !246, file: !3, line: 1472, column: 9)
!447 = !DILocalVariable(name: "total_offset", scope: !443, file: !3, line: 1486, type: !77)
!448 = !DILocalVariable(name: "udp_payload_len", scope: !443, file: !3, line: 1488, type: !77)
!449 = !DILocalVariable(name: "udp_payload_exclude_header", scope: !443, file: !3, line: 1489, type: !77)
!450 = !DILocalVariable(name: "dns_payload", scope: !451, file: !3, line: 1497, type: !65)
!451 = distinct !DILexicalBlock(scope: !452, file: !3, line: 1492, column: 58)
!452 = distinct !DILexicalBlock(scope: !443, file: !3, line: 1492, column: 17)
!453 = !DILocalVariable(name: "dns", scope: !451, file: !3, line: 1499, type: !66)
!454 = !DILocalVariable(name: "parse_flag", scope: !451, file: !3, line: 1506, type: !84)
!455 = !DILocalVariable(name: "result", scope: !451, file: !3, line: 1508, type: !456)
!456 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "result_parse_dns_labels", file: !235, line: 150, size: 32, elements: !457)
!457 = !{!458, !459, !460, !461}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "deep_scan_mirror", scope: !456, file: !235, line: 151, baseType: !361, size: 8)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "drop", scope: !456, file: !235, line: 152, baseType: !361, size: 8, offset: 8)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "isBenign", scope: !456, file: !235, line: 153, baseType: !361, size: 8, offset: 16)
!461 = !DIDerivedType(tag: DW_TAG_member, name: "isC2c", scope: !456, file: !235, line: 154, baseType: !361, size: 8, offset: 24)
!462 = !DILocalVariable(name: "current_dest_addr", scope: !451, file: !3, line: 1514, type: !102)
!463 = !DILocalVariable(name: "dest_addr_route", scope: !451, file: !3, line: 1515, type: !102)
!464 = !DILocalVariable(name: "dest_addr_route_malicious", scope: !451, file: !3, line: 1516, type: !102)
!465 = !DILocalVariable(name: "out", scope: !451, file: !3, line: 1518, type: !77)
!466 = !DILocalVariable(name: "config", scope: !451, file: !3, line: 1520, type: !467)
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_kernel_config", file: !235, line: 27, size: 128, elements: !469)
!469 = !{!470, !471, !472, !473}
!470 = !DIDerivedType(tag: DW_TAG_member, name: "BridgeIndexId", scope: !468, file: !235, line: 28, baseType: !77, size: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "NfNdpBridgeIndexId", scope: !468, file: !235, line: 29, baseType: !77, size: 32, offset: 32)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "RedirectIpv4", scope: !468, file: !235, line: 30, baseType: !102, size: 32, offset: 64)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "NfNdpBridgeRedirectIpv4", scope: !468, file: !235, line: 31, baseType: !102, size: 32, offset: 96)
!474 = !DILocalVariable(name: "br_index", scope: !451, file: !3, line: 1521, type: !77)
!475 = !DILocalVariable(name: "redirect_address_from_config", scope: !476, file: !3, line: 1524, type: !102)
!476 = distinct !DILexicalBlock(scope: !477, file: !3, line: 1523, column: 29)
!477 = distinct !DILexicalBlock(scope: !451, file: !3, line: 1523, column: 21)
!478 = !DILocalVariable(name: "csum_diff_drop", scope: !479, file: !3, line: 1554, type: !77)
!479 = distinct !DILexicalBlock(scope: !480, file: !3, line: 1543, column: 38)
!480 = distinct !DILexicalBlock(scope: !481, file: !3, line: 1543, column: 26)
!481 = distinct !DILexicalBlock(scope: !451, file: !3, line: 1535, column: 21)
!482 = !DILocalVariable(name: "transaction_id", scope: !451, file: !3, line: 1577, type: !62)
!483 = !DILocalVariable(name: "ip_checksum", scope: !451, file: !3, line: 1578, type: !62)
!484 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !451, file: !3, line: 1579, type: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !486, size: 64)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "checkSum_redirect_struct_value", file: !3, line: 156, size: 128, elements: !487)
!487 = !{!488, !489}
!488 = !DIDerivedType(tag: DW_TAG_member, name: "checksum", scope: !486, file: !3, line: 157, baseType: !62, size: 16)
!489 = !DIDerivedType(tag: DW_TAG_member, name: "kernel_timets", scope: !486, file: !3, line: 158, baseType: !211, size: 64, offset: 64)
!490 = !DILocalVariable(name: "csum_diff", scope: !451, file: !3, line: 1605, type: !77)
!491 = !DILocalVariable(name: "tcp_data", scope: !492, file: !3, line: 1647, type: !65)
!492 = distinct !DILexicalBlock(scope: !493, file: !3, line: 1642, column: 48)
!493 = distinct !DILexicalBlock(scope: !444, file: !3, line: 1642, column: 19)
!494 = !DILocalVariable(name: "dns_payload", scope: !495, file: !3, line: 1652, type: !65)
!495 = distinct !DILexicalBlock(scope: !496, file: !3, line: 1650, column: 58)
!496 = distinct !DILexicalBlock(scope: !492, file: !3, line: 1650, column: 17)
!497 = !DILocalVariable(name: "dns", scope: !495, file: !3, line: 1654, type: !109)
!498 = !DILocalVariable(name: "parse_flag", scope: !495, file: !3, line: 1662, type: !84)
!499 = !DILocalVariable(name: "result", scope: !495, file: !3, line: 1664, type: !456)
!500 = !DILocalVariable(name: "current_dest_addr", scope: !495, file: !3, line: 1667, type: !102)
!501 = !DILocalVariable(name: "dest_addr_route", scope: !495, file: !3, line: 1668, type: !102)
!502 = !DILocalVariable(name: "dest_addr_route_malicious", scope: !495, file: !3, line: 1669, type: !102)
!503 = !DILocalVariable(name: "out", scope: !495, file: !3, line: 1671, type: !77)
!504 = !DILocalVariable(name: "config", scope: !495, file: !3, line: 1672, type: !467)
!505 = !DILocalVariable(name: "br_index", scope: !495, file: !3, line: 1673, type: !77)
!506 = !DILocalVariable(name: "redirect_address_from_config", scope: !507, file: !3, line: 1676, type: !102)
!507 = distinct !DILexicalBlock(scope: !508, file: !3, line: 1675, column: 29)
!508 = distinct !DILexicalBlock(scope: !495, file: !3, line: 1675, column: 21)
!509 = !DILocalVariable(name: "br_index", scope: !510, file: !3, line: 1691, type: !77)
!510 = distinct !DILexicalBlock(scope: !511, file: !3, line: 1689, column: 39)
!511 = distinct !DILexicalBlock(scope: !512, file: !3, line: 1689, column: 26)
!512 = distinct !DILexicalBlock(scope: !495, file: !3, line: 1687, column: 21)
!513 = !DILocalVariable(name: "config", scope: !510, file: !3, line: 1692, type: !467)
!514 = !DILocalVariable(name: "csum_diff_drop", scope: !510, file: !3, line: 1700, type: !77)
!515 = !DILocalVariable(name: "transaction_id", scope: !495, file: !3, line: 1724, type: !77)
!516 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !495, file: !3, line: 1726, type: !485)
!517 = !DILocalVariable(name: "tcp_payload_len", scope: !495, file: !3, line: 1746, type: !77)
!518 = !DILocalVariable(name: "dns_rate_limit_action", scope: !519, file: !3, line: 1748, type: !84)
!519 = distinct !DILexicalBlock(scope: !520, file: !3, line: 1747, column: 46)
!520 = distinct !DILexicalBlock(scope: !495, file: !3, line: 1747, column: 21)
!521 = !DILocalVariable(name: "csum_diff", scope: !495, file: !3, line: 1761, type: !77)
!522 = !DILocalVariable(name: "udp_data", scope: !523, file: !3, line: 1800, type: !65)
!523 = distinct !DILexicalBlock(scope: !524, file: !3, line: 1795, column: 43)
!524 = distinct !DILexicalBlock(scope: !525, file: !3, line: 1795, column: 13)
!525 = distinct !DILexicalBlock(scope: !526, file: !3, line: 1790, column: 51)
!526 = distinct !DILexicalBlock(scope: !446, file: !3, line: 1790, column: 12)
!527 = !DILocalVariable(name: "total_offset", scope: !523, file: !3, line: 1803, type: !77)
!528 = !DILocalVariable(name: "udp_payload_len", scope: !523, file: !3, line: 1805, type: !77)
!529 = !DILocalVariable(name: "udp_payload_exclude_header", scope: !523, file: !3, line: 1806, type: !77)
!530 = !DILocalVariable(name: "dns_payload", scope: !531, file: !3, line: 1812, type: !65)
!531 = distinct !DILexicalBlock(scope: !532, file: !3, line: 1808, column: 58)
!532 = distinct !DILexicalBlock(scope: !523, file: !3, line: 1808, column: 17)
!533 = !DILocalVariable(name: "dns", scope: !531, file: !3, line: 1814, type: !66)
!534 = !DILocalVariable(name: "parse_flag", scope: !531, file: !3, line: 1821, type: !84)
!535 = !DILocalVariable(name: "result", scope: !531, file: !3, line: 1823, type: !456)
!536 = !DILocalVariable(name: "dns_payload_size", scope: !531, file: !3, line: 1826, type: !62)
!537 = !DILocalVariable(name: "dns_rate_limit_action", scope: !538, file: !3, line: 1828, type: !84)
!538 = distinct !DILexicalBlock(scope: !539, file: !3, line: 1827, column: 46)
!539 = distinct !DILexicalBlock(scope: !531, file: !3, line: 1827, column: 21)
!540 = !DILocalVariable(name: "out", scope: !531, file: !3, line: 1834, type: !77)
!541 = !DILocalVariable(name: "config", scope: !531, file: !3, line: 1836, type: !467)
!542 = !DILocalVariable(name: "br_index", scope: !531, file: !3, line: 1837, type: !77)
!543 = !DILocalVariable(name: "transaction_id", scope: !531, file: !3, line: 1871, type: !62)
!544 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !531, file: !3, line: 1873, type: !485)
!545 = !DILocalVariable(name: "tcp_data", scope: !546, file: !3, line: 1918, type: !65)
!546 = distinct !DILexicalBlock(scope: !547, file: !3, line: 1913, column: 49)
!547 = distinct !DILexicalBlock(scope: !524, file: !3, line: 1913, column: 19)
!548 = !DILocalVariable(name: "dns", scope: !549, file: !3, line: 1923, type: !109)
!549 = distinct !DILexicalBlock(scope: !550, file: !3, line: 1921, column: 58)
!550 = distinct !DILexicalBlock(scope: !546, file: !3, line: 1921, column: 17)
!551 = !DILocalVariable(name: "dns_payload", scope: !549, file: !3, line: 1926, type: !65)
!552 = !DILocalVariable(name: "parse_flag", scope: !549, file: !3, line: 1934, type: !84)
!553 = !DILocalVariable(name: "result", scope: !549, file: !3, line: 1936, type: !456)
!554 = !DILocalVariable(name: "skb_ifIndex", scope: !549, file: !3, line: 1938, type: !77)
!555 = !DILocalVariable(name: "out", scope: !549, file: !3, line: 1941, type: !77)
!556 = !DILocalVariable(name: "config", scope: !549, file: !3, line: 1943, type: !467)
!557 = !DILocalVariable(name: "br_index", scope: !549, file: !3, line: 1944, type: !77)
!558 = !DILocalVariable(name: "transaction_id", scope: !549, file: !3, line: 1963, type: !62)
!559 = !DILocalVariable(name: "map_layer3_redirect_value", scope: !549, file: !3, line: 1965, type: !485)
!560 = !DILocalVariable(name: "tcp_payload_len", scope: !549, file: !3, line: 1986, type: !77)
!561 = !DILocalVariable(name: "dns_rate_limit_action", scope: !562, file: !3, line: 1988, type: !84)
!562 = distinct !DILexicalBlock(scope: !563, file: !3, line: 1987, column: 46)
!563 = distinct !DILexicalBlock(scope: !549, file: !3, line: 1987, column: 21)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 624, elements: !567)
!565 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !566)
!566 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!567 = !{!568}
!568 = !DISubrange(count: 78)
!569 = !DIGlobalVariableExpression(var: !570, expr: !DIExpression())
!570 = distinct !DIGlobalVariable(name: "bpf_trace_printk", scope: !2, file: !571, line: 177, type: !572, isLocal: true, isDefinition: true)
!571 = !DIFile(filename: "/usr/include/bpf/bpf_helper_defs.h", directory: "", checksumkind: CSK_MD5, checksum: "65e4dc8e3121f91a5c2c9eb8563c5692")
!572 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !573)
!573 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !574, size: 64)
!574 = !DISubroutineType(types: !575)
!575 = !{!119, !576, !77, null}
!576 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !565, size: 64)
!577 = !DIGlobalVariableExpression(var: !578, expr: !DIExpression())
!578 = distinct !DIGlobalVariable(name: "bpf_map_lookup_elem", scope: !2, file: !571, line: 56, type: !579, isLocal: true, isDefinition: true)
!579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !581, size: 64)
!581 = !DISubroutineType(types: !582)
!582 = !{!65, !65, !583}
!583 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !584, size: 64)
!584 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1530, type: !587, isLocal: true, isDefinition: true)
!587 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 464, elements: !588)
!588 = !{!589}
!589 = !DISubrange(count: 58)
!590 = !DIGlobalVariableExpression(var: !591, expr: !DIExpression())
!591 = distinct !DIGlobalVariable(name: "bpf_skb_load_bytes", scope: !2, file: !571, line: 719, type: !592, isLocal: true, isDefinition: true)
!592 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !593)
!593 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !594, size: 64)
!594 = !DISubroutineType(types: !595)
!595 = !{!119, !583, !77, !65, !77}
!596 = !DIGlobalVariableExpression(var: !597, expr: !DIExpression())
!597 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1551, type: !598, isLocal: true, isDefinition: true)
!598 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 512, elements: !599)
!599 = !{!600}
!600 = !DISubrange(count: 64)
!601 = !DIGlobalVariableExpression(var: !602, expr: !DIExpression())
!602 = distinct !DIGlobalVariable(name: "bpf_csum_diff", scope: !2, file: !571, line: 796, type: !603, isLocal: true, isDefinition: true)
!603 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !604)
!604 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !605, size: 64)
!605 = !DISubroutineType(types: !606)
!606 = !{!607, !609, !77, !609, !77, !610}
!607 = !DIDerivedType(tag: DW_TAG_typedef, name: "__s64", file: !63, line: 30, baseType: !608)
!608 = !DIBasicType(name: "long long", size: 64, encoding: DW_ATE_signed)
!609 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!610 = !DIDerivedType(tag: DW_TAG_typedef, name: "__wsum", file: !73, line: 39, baseType: !77)
!611 = !DIGlobalVariableExpression(var: !612, expr: !DIExpression())
!612 = distinct !DIGlobalVariable(name: "bpf_l3_csum_replace", scope: !2, file: !571, line: 256, type: !613, isLocal: true, isDefinition: true)
!613 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !614)
!614 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !615, size: 64)
!615 = !DISubroutineType(types: !616)
!616 = !{!119, !249, !77, !211, !211, !211}
!617 = !DIGlobalVariableExpression(var: !618, expr: !DIExpression())
!618 = distinct !DIGlobalVariable(name: "bpf_skb_store_bytes", scope: !2, file: !571, line: 227, type: !619, isLocal: true, isDefinition: true)
!619 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !620)
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DISubroutineType(types: !622)
!622 = !{!119, !249, !77, !583, !77, !211}
!623 = !DIGlobalVariableExpression(var: !624, expr: !DIExpression())
!624 = distinct !DIGlobalVariable(name: "bpf_redirect", scope: !2, file: !571, line: 621, type: !625, isLocal: true, isDefinition: true)
!625 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !626)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !627, size: 64)
!627 = !DISubroutineType(types: !628)
!628 = !{!119, !77, !211}
!629 = !DIGlobalVariableExpression(var: !630, expr: !DIExpression())
!630 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1584, type: !631, isLocal: true, isDefinition: true)
!631 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 1344, elements: !632)
!632 = !{!633}
!633 = !DISubrange(count: 168)
!634 = !DIGlobalVariableExpression(var: !635, expr: !DIExpression())
!635 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1682, type: !636, isLocal: true, isDefinition: true)
!636 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 672, elements: !637)
!637 = !{!638}
!638 = !DISubrange(count: 84)
!639 = !DIGlobalVariableExpression(var: !640, expr: !DIExpression())
!640 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1696, type: !598, isLocal: true, isDefinition: true)
!641 = !DIGlobalVariableExpression(var: !642, expr: !DIExpression())
!642 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1731, type: !631, isLocal: true, isDefinition: true)
!643 = !DIGlobalVariableExpression(var: !644, expr: !DIExpression())
!644 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1842, type: !587, isLocal: true, isDefinition: true)
!645 = !DIGlobalVariableExpression(var: !646, expr: !DIExpression())
!646 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1878, type: !631, isLocal: true, isDefinition: true)
!647 = !DIGlobalVariableExpression(var: !648, expr: !DIExpression())
!648 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1949, type: !587, isLocal: true, isDefinition: true)
!649 = !DIGlobalVariableExpression(var: !650, expr: !DIExpression())
!650 = distinct !DIGlobalVariable(name: "____fmt", scope: !246, file: !3, line: 1970, type: !631, isLocal: true, isDefinition: true)
!651 = !DIGlobalVariableExpression(var: !652, expr: !DIExpression())
!652 = distinct !DIGlobalVariable(name: "__license", scope: !2, file: !3, line: 2013, type: !653, isLocal: false, isDefinition: true)
!653 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 104, elements: !654)
!654 = !{!655}
!655 = !DISubrange(count: 13)
!656 = !DIGlobalVariableExpression(var: !657, expr: !DIExpression())
!657 = distinct !DIGlobalVariable(name: "flags", scope: !2, file: !44, line: 20, type: !43, isLocal: false, isDefinition: true)
!658 = !DIGlobalVariableExpression(var: !659, expr: !DIExpression())
!659 = distinct !DIGlobalVariable(name: "exfil_security_egress_dns_limites", scope: !2, file: !235, line: 43, type: !660, isLocal: false, isDefinition: true)
!660 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_dns_limites", file: !235, line: 38, size: 256, elements: !661)
!661 = !{!662, !667, !669, !670}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !660, file: !235, line: 39, baseType: !663, size: 64)
!663 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !664, size: 64)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 32, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 1)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !660, file: !235, line: 40, baseType: !668, size: 64, offset: 64)
!668 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !660, file: !235, line: 41, baseType: !668, size: 64, offset: 128)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !660, file: !235, line: 42, baseType: !671, size: 64, offset: 192)
!671 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 512, elements: !195)
!673 = !DIGlobalVariableExpression(var: !674, expr: !DIExpression())
!674 = distinct !DIGlobalVariable(name: "exfil_security_egrees_redirect_ring_buff_non_standard_port", scope: !2, file: !3, line: 112, type: !675, isLocal: false, isDefinition: true)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egrees_redirect_ring_buff_non_standard_port", file: !3, line: 109, size: 128, elements: !676)
!676 = !{!677, !682}
!677 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !675, file: !3, line: 110, baseType: !678, size: 64)
!678 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !679, size: 64)
!679 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 864, elements: !680)
!680 = !{!681}
!681 = !DISubrange(count: 27)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !675, file: !3, line: 111, baseType: !683, size: 64, offset: 64)
!683 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !684, size: 64)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 536870912, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 16777216)
!687 = !DIGlobalVariableExpression(var: !688, expr: !DIExpression())
!688 = distinct !DIGlobalVariable(name: "exfil_vxlan_block_egress_port", scope: !2, file: !3, line: 127, type: !689, isLocal: false, isDefinition: true)
!689 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_vxlan_block_egress_port", file: !3, line: 122, size: 256, elements: !690)
!690 = !{!691, !696, !697, !698}
!691 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !689, file: !3, line: 123, baseType: !692, size: 64)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !693, size: 64)
!693 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 288, elements: !694)
!694 = !{!695}
!695 = !DISubrange(count: 9)
!696 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !689, file: !3, line: 124, baseType: !121, size: 64, offset: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !689, file: !3, line: 125, baseType: !120, size: 64, offset: 128)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !689, file: !3, line: 126, baseType: !699, size: 64, offset: 192)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !700, size: 64)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 32768, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 1024)
!703 = !DIGlobalVariableExpression(var: !704, expr: !DIExpression())
!704 = distinct !DIGlobalVariable(name: "exfil_security_egress_vxlan_encap_drop", scope: !2, file: !3, line: 134, type: !705, isLocal: false, isDefinition: true)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_vxlan_encap_drop", file: !3, line: 131, size: 128, elements: !706)
!706 = !{!707, !708}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !705, file: !3, line: 132, baseType: !678, size: 64)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !705, file: !3, line: 133, baseType: !709, size: 64, offset: 64)
!709 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !710, size: 64)
!710 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 131072, elements: !711)
!711 = !{!712}
!712 = !DISubrange(count: 4096)
!713 = !DIGlobalVariableExpression(var: !714, expr: !DIExpression())
!714 = distinct !DIGlobalVariable(name: "exfil_security_egress_reconnisance_map_scan", scope: !2, file: !3, line: 152, type: !715, isLocal: false, isDefinition: true)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_reconnisance_map_scan", file: !3, line: 147, size: 256, elements: !716)
!716 = !{!717, !718, !719, !727}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !715, file: !3, line: 148, baseType: !692, size: 64)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !715, file: !3, line: 149, baseType: !121, size: 64, offset: 64)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !715, file: !3, line: 150, baseType: !720, size: 64, offset: 128)
!720 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !721, size: 64)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_raw_packet_mirror", file: !3, line: 138, size: 48, elements: !722)
!722 = !{!723, !724, !725, !726}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "dst_port", scope: !721, file: !3, line: 139, baseType: !62, size: 16)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "src_port", scope: !721, file: !3, line: 140, baseType: !62, size: 16, offset: 16)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "isUdp", scope: !721, file: !3, line: 141, baseType: !84, size: 8, offset: 32)
!726 = !DIDerivedType(tag: DW_TAG_member, name: "isPacketRescanedAndMalicious", scope: !721, file: !3, line: 142, baseType: !84, size: 8, offset: 40)
!727 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !715, file: !3, line: 151, baseType: !728, size: 64, offset: 192)
!728 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !729, size: 64)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 2097152, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 65536)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_map", scope: !2, file: !3, line: 167, type: !734, isLocal: false, isDefinition: true)
!734 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_map", file: !3, line: 162, size: 256, elements: !735)
!735 = !{!736, !737, !738, !739}
!736 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !734, file: !3, line: 163, baseType: !692, size: 64)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !734, file: !3, line: 164, baseType: !121, size: 64, offset: 64)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !734, file: !3, line: 165, baseType: !485, size: 64, offset: 128)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !734, file: !3, line: 166, baseType: !683, size: 64, offset: 192)
!740 = !DIGlobalVariableExpression(var: !741, expr: !DIExpression())
!741 = distinct !DIGlobalVariable(name: "exfil_security_protocols_identifier_maps", scope: !2, file: !3, line: 177, type: !742, isLocal: false, isDefinition: true)
!742 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_protocols_identifier_maps", file: !3, line: 172, size: 256, elements: !743)
!743 = !{!744, !747, !748, !749}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !742, file: !3, line: 173, baseType: !745, size: 64)
!745 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !746, size: 64)
!746 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 64, elements: !219)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !742, file: !3, line: 174, baseType: !668, size: 64, offset: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !742, file: !3, line: 175, baseType: !121, size: 64, offset: 128)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !742, file: !3, line: 176, baseType: !750, size: 64, offset: 192)
!750 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !751, size: 64)
!751 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 160, elements: !266)
!752 = !DIGlobalVariableExpression(var: !753, expr: !DIExpression())
!753 = distinct !DIGlobalVariable(name: "exfil_security_egress_redurect_ts_verify", scope: !2, file: !3, line: 184, type: !754, isLocal: false, isDefinition: true)
!754 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redurect_ts_verify", file: !3, line: 179, size: 256, elements: !755)
!755 = !{!756, !757, !759, !760}
!756 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !754, file: !3, line: 180, baseType: !692, size: 64)
!757 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !754, file: !3, line: 181, baseType: !758, size: 64, offset: 64)
!758 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!759 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !754, file: !3, line: 182, baseType: !120, size: 64, offset: 128)
!760 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !754, file: !3, line: 183, baseType: !761, size: 64, offset: 192)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 1048576, elements: !763)
!763 = !{!764}
!764 = !DISubrange(count: 32768)
!765 = !DIGlobalVariableExpression(var: !766, expr: !DIExpression())
!766 = distinct !DIGlobalVariable(name: "exfil_security_config_map", scope: !2, file: !3, line: 192, type: !767, isLocal: false, isDefinition: true)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_config_map", file: !3, line: 187, size: 256, elements: !768)
!768 = !{!769, !770, !771, !772}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !767, file: !3, line: 188, baseType: !663, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !767, file: !3, line: 189, baseType: !668, size: 64, offset: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !767, file: !3, line: 190, baseType: !467, size: 64, offset: 128)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !767, file: !3, line: 191, baseType: !773, size: 64, offset: 192)
!773 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !774, size: 64)
!774 = !DICompositeType(tag: DW_TAG_array_type, baseType: !218, size: 2048, elements: !599)
!775 = !DIGlobalVariableExpression(var: !776, expr: !DIExpression())
!776 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_loop_time", scope: !2, file: !3, line: 204, type: !777, isLocal: false, isDefinition: true)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_loop_time", file: !3, line: 199, size: 256, elements: !778)
!778 = !{!779, !780, !781, !782}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !777, file: !3, line: 200, baseType: !692, size: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !777, file: !3, line: 201, baseType: !668, size: 64, offset: 64)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !777, file: !3, line: 202, baseType: !758, size: 64, offset: 128)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !777, file: !3, line: 203, baseType: !761, size: 64, offset: 192)
!783 = !DIGlobalVariableExpression(var: !784, expr: !DIExpression())
!784 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_count_map", scope: !2, file: !3, line: 212, type: !785, isLocal: false, isDefinition: true)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_count_map", file: !3, line: 207, size: 256, elements: !786)
!786 = !{!787, !788, !789, !790}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !785, file: !3, line: 208, baseType: !692, size: 64)
!788 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !785, file: !3, line: 209, baseType: !121, size: 64, offset: 64)
!789 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !785, file: !3, line: 210, baseType: !668, size: 64, offset: 128)
!790 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !785, file: !3, line: 211, baseType: !663, size: 64, offset: 192)
!791 = !DIGlobalVariableExpression(var: !792, expr: !DIExpression())
!792 = distinct !DIGlobalVariable(name: "exfil_security_egress_redirect_drop_count_map", scope: !2, file: !3, line: 220, type: !793, isLocal: false, isDefinition: true)
!793 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_redirect_drop_count_map", file: !3, line: 215, size: 256, elements: !794)
!794 = !{!795, !796, !797, !798}
!795 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !793, file: !3, line: 216, baseType: !692, size: 64)
!796 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !793, file: !3, line: 217, baseType: !121, size: 64, offset: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !793, file: !3, line: 218, baseType: !668, size: 64, offset: 128)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !793, file: !3, line: 219, baseType: !663, size: 64, offset: 192)
!799 = !DIGlobalVariableExpression(var: !800, expr: !DIExpression())
!800 = distinct !DIGlobalVariable(name: "exfil_security_egress_vxlan_dns_transport", scope: !2, file: !3, line: 227, type: !801, isLocal: false, isDefinition: true)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_vxlan_dns_transport", file: !3, line: 222, size: 256, elements: !802)
!802 = !{!803, !804, !805, !806}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !801, file: !3, line: 223, baseType: !692, size: 64)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !801, file: !3, line: 224, baseType: !120, size: 64, offset: 64)
!805 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !801, file: !3, line: 225, baseType: !668, size: 64, offset: 128)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !801, file: !3, line: 226, baseType: !663, size: 64, offset: 192)
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "exfil_security_egress_rate_limit_map", scope: !2, file: !3, line: 244, type: !809, isLocal: false, isDefinition: true)
!809 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_security_egress_rate_limit_map", file: !3, line: 239, size: 256, elements: !810)
!810 = !{!811, !812, !813, !819}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !809, file: !3, line: 240, baseType: !692, size: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !809, file: !3, line: 241, baseType: !121, size: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !809, file: !3, line: 242, baseType: !814, size: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !815, size: 64)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dns_volume_stats", file: !3, line: 231, size: 128, elements: !816)
!816 = !{!817, !818}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "last_timestamp", scope: !815, file: !3, line: 232, baseType: !211, size: 64)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "packet_size", scope: !815, file: !3, line: 233, baseType: !77, size: 32, offset: 64)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !809, file: !3, line: 243, baseType: !663, size: 64, offset: 192)
!820 = !DIGlobalVariableExpression(var: !821, expr: !DIExpression())
!821 = distinct !DIGlobalVariable(name: "maps", scope: !2, file: !3, line: 1403, type: !822, isLocal: false, isDefinition: true)
!822 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "kernel_handler_map", file: !3, line: 1397, size: 320, elements: !823)
!823 = !{!824, !825, !826, !827, !828}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !822, file: !3, line: 1398, baseType: !663, size: 64)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "max_entries", scope: !822, file: !3, line: 1399, baseType: !683, size: 64, offset: 64)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !822, file: !3, line: 1400, baseType: !120, size: 64, offset: 128)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !822, file: !3, line: 1401, baseType: !121, size: 64, offset: 192)
!828 = !DIDerivedType(tag: DW_TAG_member, name: "map_flags", scope: !822, file: !3, line: 1402, baseType: !663, size: 64, offset: 256)
!829 = !DIGlobalVariableExpression(var: !830, expr: !DIExpression())
!830 = distinct !DIGlobalVariable(name: "____fmt", scope: !831, file: !3, line: 296, type: !841, isLocal: true, isDefinition: true)
!831 = distinct !DISubprogram(name: "process_udp_payload_mem_verification", scope: !3, file: !3, line: 278, type: !832, scopeLine: 278, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !834)
!832 = !DISubroutineType(types: !833)
!833 = !{!84, !122, !362, !361}
!834 = !{!835, !836, !837, !838, !839, !840}
!835 = !DILocalVariable(name: "udp", arg: 1, scope: !831, file: !3, line: 278, type: !122)
!836 = !DILocalVariable(name: "skb", arg: 2, scope: !831, file: !3, line: 278, type: !362)
!837 = !DILocalVariable(name: "isIPv4", arg: 3, scope: !831, file: !3, line: 278, type: !361)
!838 = !DILocalVariable(name: "udp_len", scope: !831, file: !3, line: 279, type: !62)
!839 = !DILocalVariable(name: "udp_len_payload", scope: !831, file: !3, line: 280, type: !62)
!840 = !DILocalVariable(name: "udp_data", scope: !831, file: !3, line: 283, type: !65)
!841 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 288, elements: !842)
!842 = !{!843}
!843 = !DISubrange(count: 36)
!844 = !DIGlobalVariableExpression(var: !845, expr: !DIExpression())
!845 = distinct !DIGlobalVariable(name: "bpf_map_update_elem", scope: !2, file: !571, line: 78, type: !846, isLocal: true, isDefinition: true)
!846 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !847)
!847 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !848, size: 64)
!848 = !DISubroutineType(types: !849)
!849 = !{!119, !65, !583, !583, !211}
!850 = !DIGlobalVariableExpression(var: !851, expr: !DIExpression())
!851 = distinct !DIGlobalVariable(name: "bpf_ktime_get_ns", scope: !2, file: !571, line: 114, type: !852, isLocal: true, isDefinition: true)
!852 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !853)
!853 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !854, size: 64)
!854 = !DISubroutineType(types: !855)
!855 = !{!211}
!856 = !DIGlobalVariableExpression(var: !857, expr: !DIExpression())
!857 = distinct !DIGlobalVariable(name: "bpf_map_delete_elem", scope: !2, file: !571, line: 88, type: !858, isLocal: true, isDefinition: true)
!858 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !859)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !860, size: 64)
!860 = !DISubroutineType(types: !861)
!861 = !{!119, !65, !583}
!862 = !DIGlobalVariableExpression(var: !863, expr: !DIExpression())
!863 = distinct !DIGlobalVariable(name: "bpf_ringbuf_reserve", scope: !2, file: !571, line: 3176, type: !864, isLocal: true, isDefinition: true)
!864 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !865)
!865 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !866, size: 64)
!866 = !DISubroutineType(types: !867)
!867 = !{!65, !65, !211, !211}
!868 = !DIGlobalVariableExpression(var: !869, expr: !DIExpression())
!869 = distinct !DIGlobalVariable(name: "bpf_ringbuf_query", scope: !2, file: !571, line: 3233, type: !870, isLocal: true, isDefinition: true)
!870 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !871)
!871 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !872, size: 64)
!872 = !DISubroutineType(types: !873)
!873 = !{!211, !65, !211}
!874 = !DIGlobalVariableExpression(var: !875, expr: !DIExpression())
!875 = distinct !DIGlobalVariable(name: "bpf_ringbuf_submit", scope: !2, file: !571, line: 3194, type: !876, isLocal: true, isDefinition: true)
!876 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !877)
!877 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !878, size: 64)
!878 = !DISubroutineType(types: !879)
!879 = !{null, !65, !211}
!880 = !DIGlobalVariableExpression(var: !881, expr: !DIExpression())
!881 = distinct !DIGlobalVariable(name: "____fmt", scope: !882, file: !132, line: 47, type: !891, isLocal: true, isDefinition: true)
!882 = distinct !DISubprogram(name: "__parse_vxlan_vni_hdr", scope: !132, file: !132, line: 42, type: !883, scopeLine: 42, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !885)
!883 = !DISubroutineType(types: !884)
!884 = !{!77, !65, !130, !65}
!885 = !{!886, !887, !888, !889, !890}
!886 = !DILocalVariable(name: "transport_payload", arg: 1, scope: !882, file: !132, line: 42, type: !65)
!887 = !DILocalVariable(name: "vxlan_hdr", arg: 2, scope: !882, file: !132, line: 42, type: !130)
!888 = !DILocalVariable(name: "data_end", arg: 3, scope: !882, file: !132, line: 42, type: !65)
!889 = !DILocalVariable(name: "vni", scope: !882, file: !132, line: 43, type: !77)
!890 = !DILocalVariable(name: "resrvered", scope: !882, file: !132, line: 45, type: !77)
!891 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 272, elements: !892)
!892 = !{!893}
!893 = !DISubrange(count: 34)
!894 = !DIGlobalVariableExpression(var: !895, expr: !DIExpression())
!895 = distinct !DIGlobalVariable(name: "bpf_ringbuf_reserve_dynptr", scope: !2, file: !571, line: 4485, type: !896, isLocal: true, isDefinition: true)
!896 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !897)
!897 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !898, size: 64)
!898 = !DISubroutineType(types: !899)
!899 = !{!119, !65, !77, !211, !900}
!900 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !901, size: 64)
!901 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "bpf_dynptr", file: !40, line: 7323, size: 128, align: 64, elements: !902)
!902 = !{!903}
!903 = !DIDerivedType(tag: DW_TAG_member, name: "__opaque", scope: !901, file: !40, line: 7324, baseType: !904, size: 128)
!904 = !DICompositeType(tag: DW_TAG_array_type, baseType: !211, size: 128, elements: !219)
!905 = !DIGlobalVariableExpression(var: !906, expr: !DIExpression())
!906 = distinct !DIGlobalVariable(name: "bpf_ringbuf_discard_dynptr", scope: !2, file: !571, line: 4514, type: !907, isLocal: true, isDefinition: true)
!907 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !908)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = !DISubroutineType(types: !910)
!910 = !{null, !900, !211}
!911 = !DIGlobalVariableExpression(var: !912, expr: !DIExpression())
!912 = distinct !DIGlobalVariable(name: "bpf_dynptr_write", scope: !2, file: !571, line: 4553, type: !913, isLocal: true, isDefinition: true)
!913 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !914)
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !915, size: 64)
!915 = !DISubroutineType(types: !916)
!916 = !{!119, !917, !77, !65, !77, !211}
!917 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !918, size: 64)
!918 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !901)
!919 = !DIGlobalVariableExpression(var: !920, expr: !DIExpression())
!920 = distinct !DIGlobalVariable(name: "bpf_ringbuf_submit_dynptr", scope: !2, file: !571, line: 4500, type: !907, isLocal: true, isDefinition: true)
!921 = !DIGlobalVariableExpression(var: !922, expr: !DIExpression())
!922 = distinct !DIGlobalVariable(name: "____fmt", scope: !923, file: !3, line: 715, type: !936, isLocal: true, isDefinition: true)
!923 = distinct !DISubprogram(name: "__emit_kernel_encap_event_vxlan_encap", scope: !3, file: !3, line: 693, type: !924, scopeLine: 693, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !926)
!924 = !DISubroutineType(types: !925)
!925 = !{null, !122, !77}
!926 = !{!927, !928, !929, !930, !935}
!927 = !DILocalVariable(name: "udp", arg: 1, scope: !923, file: !3, line: 693, type: !122)
!928 = !DILocalVariable(name: "egress_ifindex", arg: 2, scope: !923, file: !3, line: 693, type: !77)
!929 = !DILocalVariable(name: "dptr", scope: !923, file: !3, line: 694, type: !901)
!930 = !DILocalVariable(name: "vxlan_event", scope: !923, file: !3, line: 704, type: !931)
!931 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exfil_vxlan_exfil_event", file: !3, line: 115, size: 32, elements: !932)
!932 = !{!933, !934}
!933 = !DIDerivedType(tag: DW_TAG_member, name: "transport_dest_port", scope: !931, file: !3, line: 116, baseType: !62, size: 16)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "transport_src_port", scope: !931, file: !3, line: 117, baseType: !62, size: 16, offset: 16)
!935 = !DILocalVariable(name: "res", scope: !923, file: !3, line: 708, type: !119)
!936 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 392, elements: !937)
!937 = !{!938}
!938 = !DISubrange(count: 49)
!939 = !DIGlobalVariableExpression(var: !940, expr: !DIExpression())
!940 = distinct !DIGlobalVariable(name: "____fmt", scope: !941, file: !3, line: 943, type: !587, isLocal: true, isDefinition: true)
!941 = distinct !DISubprogram(name: "__process_packet_clone_redirection_non_standard_port", scope: !3, file: !3, line: 928, type: !942, scopeLine: 928, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition | DISPFlagOptimized, unit: !2, retainedNodes: !944)
!942 = !DISubroutineType(types: !943)
!943 = !{!84, !249, !361, !62, !62}
!944 = !{!945, !946, !947, !948, !949, !950, !951, !952, !953, !954, !955, !959, !960, !961, !964}
!945 = !DILocalVariable(name: "skb", arg: 1, scope: !941, file: !3, line: 928, type: !249)
!946 = !DILocalVariable(name: "isUdp", arg: 2, scope: !941, file: !3, line: 928, type: !361)
!947 = !DILocalVariable(name: "__transport_dest_port", arg: 3, scope: !941, file: !3, line: 928, type: !62)
!948 = !DILocalVariable(name: "__transport_src_port", arg: 4, scope: !941, file: !3, line: 928, type: !62)
!949 = !DILocalVariable(name: "br_index", scope: !941, file: !3, line: 931, type: !77)
!950 = !DILocalVariable(name: "out", scope: !941, file: !3, line: 932, type: !77)
!951 = !DILocalVariable(name: "dest_addr_route", scope: !941, file: !3, line: 933, type: !102)
!952 = !DILocalVariable(name: "config", scope: !941, file: !3, line: 936, type: !467)
!953 = !DILocalVariable(name: "MAX_PROTOCOL_SIZE", scope: !941, file: !3, line: 948, type: !218)
!954 = !DILocalVariable(name: "isTunnelC2CStandardUdpTransport", scope: !941, file: !3, line: 950, type: !361)
!955 = !DILocalVariable(name: "i", scope: !956, file: !3, line: 953, type: !218)
!956 = distinct !DILexicalBlock(scope: !957, file: !3, line: 953, column: 9)
!957 = distinct !DILexicalBlock(scope: !958, file: !3, line: 951, column: 16)
!958 = distinct !DILexicalBlock(scope: !941, file: !3, line: 951, column: 9)
!959 = !DILocalVariable(name: "udp_dst_transfer_key", scope: !941, file: !3, line: 961, type: !62)
!960 = !DILocalVariable(name: "raw_pack", scope: !941, file: !3, line: 962, type: !720)
!961 = !DILocalVariable(name: "pack", scope: !962, file: !3, line: 964, type: !721)
!962 = distinct !DILexicalBlock(scope: !963, file: !3, line: 963, column: 19)
!963 = distinct !DILexicalBlock(scope: !941, file: !3, line: 963, column: 9)
!964 = !DILocalVariable(name: "re_scanned_packed_and_malicious", scope: !965, file: !3, line: 987, type: !84)
!965 = distinct !DILexicalBlock(scope: !963, file: !3, line: 985, column: 11)
!966 = !DIGlobalVariableExpression(var: !967, expr: !DIExpression())
!967 = distinct !DIGlobalVariable(name: "____fmt", scope: !941, file: !3, line: 972, type: !968, isLocal: true, isDefinition: true)
!968 = !DICompositeType(tag: DW_TAG_array_type, baseType: !565, size: 576, elements: !969)
!969 = !{!970}
!970 = !DISubrange(count: 72)
!971 = !DIGlobalVariableExpression(var: !972, expr: !DIExpression())
!972 = distinct !DIGlobalVariable(scope: null, file: !973, line: 15, type: !974, isLocal: true, isDefinition: true)
!973 = !DIFile(filename: "./raw_proc.h", directory: "/home/synarcs/Desktop/Kernel_security/Data-Exfiltration-Security-Framework/kernel", checksumkind: CSK_MD5, checksum: "2deca2f9240177b4eba5c462d1899a90")
!974 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 32, elements: !203)
!975 = !DIGlobalVariableExpression(var: !976, expr: !DIExpression())
!976 = distinct !DIGlobalVariable(scope: null, file: !973, line: 16, type: !977, isLocal: true, isDefinition: true)
!977 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 96, elements: !978)
!978 = !{!979}
!979 = !DISubrange(count: 12)
!980 = !DIGlobalVariableExpression(var: !981, expr: !DIExpression())
!981 = distinct !DIGlobalVariable(scope: null, file: !973, line: 17, type: !977, isLocal: true, isDefinition: true)
!982 = !DIGlobalVariableExpression(var: !983, expr: !DIExpression())
!983 = distinct !DIGlobalVariable(scope: null, file: !973, line: 18, type: !984, isLocal: true, isDefinition: true)
!984 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 40, elements: !266)
!985 = !DIGlobalVariableExpression(var: !986, expr: !DIExpression())
!986 = distinct !DIGlobalVariable(scope: null, file: !973, line: 19, type: !974, isLocal: true, isDefinition: true)
!987 = !DIGlobalVariableExpression(var: !988, expr: !DIExpression())
!988 = distinct !DIGlobalVariable(scope: null, file: !973, line: 20, type: !984, isLocal: true, isDefinition: true)
!989 = !DIGlobalVariableExpression(var: !990, expr: !DIExpression())
!990 = distinct !DIGlobalVariable(scope: null, file: !973, line: 21, type: !991, isLocal: true, isDefinition: true)
!991 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 80, elements: !992)
!992 = !{!993}
!993 = !DISubrange(count: 10)
!994 = !DIGlobalVariableExpression(var: !995, expr: !DIExpression())
!995 = distinct !DIGlobalVariable(scope: null, file: !973, line: 22, type: !974, isLocal: true, isDefinition: true)
!996 = !DIGlobalVariableExpression(var: !997, expr: !DIExpression())
!997 = distinct !DIGlobalVariable(scope: null, file: !973, line: 23, type: !998, isLocal: true, isDefinition: true)
!998 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 56, elements: !999)
!999 = !{!1000}
!1000 = !DISubrange(count: 7)
!1001 = !DIGlobalVariableExpression(var: !1002, expr: !DIExpression())
!1002 = distinct !DIGlobalVariable(scope: null, file: !973, line: 24, type: !998, isLocal: true, isDefinition: true)
!1003 = !DIGlobalVariableExpression(var: !1004, expr: !DIExpression())
!1004 = distinct !DIGlobalVariable(scope: null, file: !973, line: 25, type: !984, isLocal: true, isDefinition: true)
!1005 = !DIGlobalVariableExpression(var: !1006, expr: !DIExpression())
!1006 = distinct !DIGlobalVariable(scope: null, file: !973, line: 26, type: !1007, isLocal: true, isDefinition: true)
!1007 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 64, elements: !199)
!1008 = !DIGlobalVariableExpression(var: !1009, expr: !DIExpression())
!1009 = distinct !DIGlobalVariable(scope: null, file: !973, line: 27, type: !653, isLocal: true, isDefinition: true)
!1010 = !DIGlobalVariableExpression(var: !1011, expr: !DIExpression())
!1011 = distinct !DIGlobalVariable(scope: null, file: !973, line: 28, type: !991, isLocal: true, isDefinition: true)
!1012 = !DIGlobalVariableExpression(var: !1013, expr: !DIExpression())
!1013 = distinct !DIGlobalVariable(scope: null, file: !973, line: 29, type: !1014, isLocal: true, isDefinition: true)
!1014 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 88, elements: !1015)
!1015 = !{!1016}
!1016 = !DISubrange(count: 11)
!1017 = !DIGlobalVariableExpression(var: !1018, expr: !DIExpression())
!1018 = distinct !DIGlobalVariable(scope: null, file: !973, line: 30, type: !991, isLocal: true, isDefinition: true)
!1019 = !DIGlobalVariableExpression(var: !1020, expr: !DIExpression())
!1020 = distinct !DIGlobalVariable(scope: null, file: !973, line: 32, type: !1021, isLocal: true, isDefinition: true)
!1021 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 168, elements: !1022)
!1022 = !{!1023}
!1023 = !DISubrange(count: 21)
!1024 = !DIGlobalVariableExpression(var: !1025, expr: !DIExpression())
!1025 = distinct !DIGlobalVariable(scope: null, file: !973, line: 33, type: !1026, isLocal: true, isDefinition: true)
!1026 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 136, elements: !1027)
!1027 = !{!1028}
!1028 = !DISubrange(count: 17)
!1029 = !DIGlobalVariableExpression(var: !1030, expr: !DIExpression())
!1030 = distinct !DIGlobalVariable(scope: null, file: !973, line: 35, type: !1031, isLocal: true, isDefinition: true)
!1031 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 176, elements: !1032)
!1032 = !{!1033}
!1033 = !DISubrange(count: 22)
!1034 = !DIGlobalVariableExpression(var: !1035, expr: !DIExpression())
!1035 = distinct !DIGlobalVariable(scope: null, file: !973, line: 36, type: !984, isLocal: true, isDefinition: true)
!1036 = !DIGlobalVariableExpression(var: !1037, expr: !DIExpression())
!1037 = distinct !DIGlobalVariable(scope: null, file: !973, line: 37, type: !1014, isLocal: true, isDefinition: true)
!1038 = !DIGlobalVariableExpression(var: !1039, expr: !DIExpression())
!1039 = distinct !DIGlobalVariable(scope: null, file: !973, line: 38, type: !1040, isLocal: true, isDefinition: true)
!1040 = !DICompositeType(tag: DW_TAG_array_type, baseType: !566, size: 72, elements: !694)
!1041 = !DIGlobalVariableExpression(var: !1042, expr: !DIExpression())
!1042 = distinct !DIGlobalVariable(name: "UDP_PROTOCOLS", scope: !2, file: !973, line: 14, type: !1043, isLocal: true, isDefinition: true)
!1043 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1044, size: 2816, elements: !1032)
!1044 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !1045)
!1045 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PortMapping", file: !973, line: 9, size: 128, elements: !1046)
!1046 = !{!1047, !1048}
